[
    {
        "date": "2024-02-01",
        "most-common-noun": "Thursday",
        "frequency": 11,
        "snippets": [
            "U.S. Secretary of Defense Lloyd Austin apologized on Thursday for his secret hospital visit, during which he seemingly disappeared for several days, admitting t...",
            "The Wall Street Journal sharply cut its Washington, D.C. bureau staff on Thursday, letting nearly 20 reporters and various editors go as the paper re-envisions ...",
            "The game of coaching musical chairs has stopped with Bill Belichick still standing. The last NFL vacancy vanished Thursday when the Washington Commanders hired ...",
            "A fire suppression system inside a hangar at George Bush Intercontinental Airport in Houston malfunctioned Thursday morning, pouring foam onto the adjacent tarm...",
            "Apple chief Tim Cook on Thursday promised the tech titan has artificial intelligence news in store as shares suffered despite sales growth in the final three mo...",
            "\"We have a deal,\" European Council President Charles Michel announced on X Thursday, declaring that all 27 European Union countries have finally agreed to the a...",
            "On Thursday’s broadcast of MSNBC’s “José Díaz-Balart Reports,” Sen. Alex Padilla (D-CA) stated that many of the reported details of the border agreeme...",
            "Jewish groups and legal experts are slamming President Joe Biden’s executive order Thursday applying sanctions against what the White House calls “extremist...",
            "US President Joe Biden issued an executive order Thursday enabling sanctions to be issued against violent Israeli settlers in the West Bank. The first round of ...",
            "WASHINGTON (AP) — The Biden administration on Thursday approved a nearly $4 billion sale of drones and military equipment to India that are meant to be used t...",
            "Meta and Amazon on Thursday blew through expectations in their latest quarterly results as Big Tech continued to impress Wall Street.\n\nMeta, the tech titan behi..."
        ]
    },
    {
        "date": "2024-02-02",
        "most-common-noun": "Friday",
        "frequency": 12,
        "snippets": [
            "The United States launched military strikes on Iranian-backed militants in both Syria and Iraq on Friday in retaliation for the killing of three U.S. service me...",
            "Joe and Jill Biden on Friday attended the dignified transfer of the three US servicemembers killed in a drone attack in Jordan last weekend.\n\nThree U.S. Service...",
            "The White House stressed Friday evening that the United States is \"not looking for a war with Iran,\" saying the retaliatory strikes carried out in Syria and Ira...",
            "(Photo by South Korean Defense Ministry via Getty Images)\n\nOAN’s Sophia Flores\n\n3:34 PM –Friday, February 2, 2024\n\nThe United States military has conducted ...",
            "The New York Times reports:\n\nThe New York Police Department robot sat motionless like a sad Wall-E on Friday morning, gathering dust inside an empty storefront ...",
            "Federal wildlife officials on Friday rejected requests from conservation groups to restore protections for gray wolves across the northern U.S Rocky Mountains, ...",
            "Cyprus' president on Friday required all government ministers to sign a \"zero tolerance\" declaration on sexist behavior and sexual harassment among employees an...",
            "The U.S. military hit dozens of targets across Iraq and Syria on Friday, targeting facilities for Iran’s elite Islamic Revolutionary Guards Corps Quds Force, ...",
            "The Ukrainian Defense Ministry announced Friday that it had suspended senior official Toomas Makhkur after the Security Service of Ukraine (SSU) announced that ...",
            "February 2, 2024 — Washington (AFP)\n\nThe United States on Friday carried out strikes against Iranian forces in Iraq and Syria in retaliation over a drone atta...",
            "Happy Friday, Gentle Readers,\n\nIf you are someone who eschewed college to learn a trade, the following stories from The College Fix will give you reasons to say...",
            "The Biden administration launched air strikes against Iranian interests in Syria and Iraq Friday, the latest volley in a growing proxy war across the Middle Eas...",
            "House Speaker Mike Johnson (R) admitted Friday that he believes White House staff — not President Joe Biden — are making decisions about Biden's immigration..."
        ]
    },
    {
        "date": "2024-02-03",
        "most-common-noun": "Saturday",
        "frequency": 14,
        "snippets": [
            "In the Cure's post-punk/alternative tune, \"10:15 Saturday Night,\" singer Robert Smith expressed the feeling of time crawling by, dropping the perfectly apt meta...",
            "Authorities in Los Angeles arrested a 21-year-old woman on Saturday in relation to a viral dognapping that sent the owner skidding across the hood of a moving c...",
            "The US unleashed another round of strikes against Houthi targets on Saturday, hours after Iran condemned the retaliation but stopped short of threatening a mili...",
            "American and British forces struck multiple sites in Yemen Saturday in the second phase of a military campaign against Iran-backed military organizations.\n\nSatu...",
            "Oh, how great is this man?\n\nPresident Trump pulled off an epic troll on Saturday on Truth Social.\n\nTrump compared himself with his look-alike Elvis Presley.\n\nTH...",
            "In the 105-year history of Pebble Beach Golf Links, nobody had ever shot a 60.\n\nUntil Saturday, that is, when Wyndham Clark did it.\n\nThe defending U.S. Open cha...",
            "*World War Three watch*\n\nThe US and UK launched new strikes on Iran-backed Houthis in Yemen on Saturday.\n\n“The United States and Britain struck 36 Houthi targ...",
            "When Northern Ireland's lawmakers returned to their jobs Saturday for the first time in two years, only one politician received applause: Michelle O'Neill. The ...",
            "CHAPEL HILL — As thousands of fans and students waited outside the Dean E. Smith Center Saturday afternoon, there was a sense that this rivalry — Duke vs. N...",
            "The U.S. and U.K. launched airstrikes Saturday targeting the Iran-backed Houthi rebels in Yemen in response to the group's continued attacks in the Red Sea, the...",
            "U.S. and U.K. military forces late Saturday night launched joint airstrikes on Iranian-backed Houthi targets in Yemen, two U.S. officials confirmed to CBS News....",
            "The U.S. military on Saturday attacked sites in Yemen with six Houthi anti-ship cruise missiles that it said were preparing to attack shipping lanes in the Red ...",
            "The AFR's Phil Coorey, Karen Middleton of the Saturday Paper, and News.com.au's Samantha Maiden discuss the issues of the week.",
            "David Speers interviews Prime Minister Anthony Albanese. The AFR's Phil Coorey, Karen Middleton of the Saturday Paper, and News.com.au's Samantha Maiden discuss..."
        ]
    },
    {
        "date": "2024-02-04",
        "most-common-noun": "Trump",
        "frequency": 14,
        "snippets": [
            "Many pundits have speculated in the two years since the 2020 election that Trump would have won the election had it not been for the coronavirus.\n\nCOVID-19 and ...",
            "“Instead of giving us his full backing, Biden is busy with giving humanitarian aid and fuel (to Gaza), which goes to Hamas,” Ben-Gvir said. “If Trump was ...",
            "GOP presidential candidate Nikki Haley is both braver and more capable of handling criticism than Donald Trump, though that’s a particularly low bar. She demo...",
            "Even Republicans who aren’t in an election year are lining up to kiss the ring of Donald Trump.\n\nJ.D. Vance’s Senate seat is safe through the next president...",
            "Donald Trump is like an improvisational actor working without a script in a movie without a director. He makes things up, and his gullible fans believe them.\n\nT...",
            "Nikki Haley should have known better.\n\nIf she was ever serious about challenging Donald Trump for the Republican presidential nomination, the former United Nati...",
            "Former President Trump dropped some names Sunday after being asked about whom he would pick as his running mate, but said no decision has been made.\n\nTrump told...",
            "How Trump taps into Christian ideology Trump's claims of political persecution resonate with his Christian supporters.\n\nPolitics How Trump taps into Christian i...",
            "The latest in Trump's trials After weeks of silence, Fulton County District Attorney Fani Willis filed a motion admitting to having a relationship with prosecut...",
            "A week ago, former Trump administration official Mike Gill was a father and a husband.\n\nNow, he is a sad statistic after dying Saturday from injuries that took ...",
            "The Washington Post is getting very nervous about the timeline regarding Donald Trump's criminal trials.\n\nIn a column published on Friday, the newspaper's assoc..."
        ]
    },
    {
        "date": "2024-02-05",
        "most-common-noun": "Monday",
        "frequency": 13,
        "snippets": [
            "Red Bull has commissioned an investigation into Christian Horner, the team principal of its highly successful Formula 1 racing team.\n\nIn a statement Monday, Red...",
            "Protests shut down major cities in Haiti on Monday as demonstrators clashed with police and demanded the resignation of Prime Minister Ariel Henry. Banks, schoo...",
            "The next hearing of the case will be held in the first week of March.\n\nThe Lucknow bench of the Allahabad High Court Monday issued a notice to the railway minis...",
            "JACKSON, Miss. — Mississippi's state auditor filed court papers Monday renewing his call for Brett Favre to repay the state for welfare money that the auditor...",
            "February 06, 2024 05:09 am | Updated 05:09 am IST - HYDERABAD\n\nUnion Minister for Tourism, Culture and Development of Northeast Region G. Kishan Reddy on Monday...",
            "WASHINGTON (AP) — The Biden administration announced Monday it is rolling out a new policy that will allow it to impose visa restrictions on foreign individua...",
            "NLRB official rules Dartmouth men's basketball team are employees, orders union vote\n\nA regional director for the National Labor Relations Board on Monday order...",
            "Sen. Deb Fischer (R-NE) said Monday she cannot vote for a border bill that funds other nations’ security while leaving America’s security in “jeopardy.”...",
            "A source in the Japanese government said on Monday that classified Japanese diplomatic telegrams were leaked in 2020 after Chinese hackers attacked the Japanese...",
            "Fox News anchor Martha MacCallum said Monday on “The Story” that “getting something” in the bipartisan border deal is better than nothing while intervie...",
            "Representative Nancy Mace (R-SC) said Monday on Fox News Channel’s “The Story” that the bipartisan border deal “keeps the border wide open.”\n\nEarlier ...",
            "Former White House advisor Kellyanne Conway said Monday on FNC’s “America Reports” that Senator Tim Scott (R-SC) “checks a lot of the boxes” for a pot...",
            "The New York Police Department (NYPD) on Monday shared a horrifying video showing the moment migrants on a moped dragged a woman along a New York City street an..."
        ]
    },
    {
        "date": "2024-02-06",
        "most-common-noun": "Tuesday",
        "frequency": 13,
        "snippets": [
            "A package aimed at giving $17.6 billion to Israel failed to pass the House of Representatives on Tuesday.\n\nIt had been facing a veto threat from the White House...",
            "The House on Tuesday failed to impeach the head of the Homeland Security Department, with a handful of Republicans joining Democrats to defeat the effort to pas...",
            "Donald Trump published a rant on Tuesday asking his supporters to give Anheuser-Busch, the maker of Bud Light, a “second chance” after conservatives loudly ...",
            "On Tuesday, the U.S. House of Representatives voted on the articles of impeachment for Secretary of Homeland Security Alejandro Mayorkas. The details of the art...",
            "Fight disinformation: Sign up for the free Mother Jones Daily newsletter and follow the news that matters.\n\nOn Tuesday, House Republicans fell short of getting ...",
            "February 07, 2024 05:21 am | Updated 05:21 am IST - NEW DELHI\n\nNEW DELHI\n\nThe Centre informed the Lok Sabha on Tuesday that more than 3.2 lakhs SIM cards and 49...",
            "The Republican-led House of Representatives on Tuesday failed to impeach Homeland Security Secretary Alejandro Mayorkas over his handling of the crisis at the s...",
            "Indianapolis Colts owner Jim Irsay made his first public comments about his health since January on Tuesday via social media.\n\nIrsay was being treated for a \"se...",
            "“We’re going on offense because guess what? There was a solution sitting right in front of you,” New York Gov. Kathy Hochul said Tuesday of Republicans on...",
            "GREENBELT, Md. — A former top prosecutor for the city of Baltimore was convicted Tuesday on one count of mortgage fraud, concluding a lengthy criminal trial i...",
            "On Tuesday, February 6, a three-judge panel ruled to reject Donald Trump’s claim to immunity from charges of attempting to overturn the results of the 2020 el...",
            "A federal appeals court on Tuesday unequivocally rejected former President Donald Trump’s absurd claim that he possesses total immunity to the federal electio...",
            "On Tuesday’s broadcast of CNN’s “The Lead,” El Paso, TX Mayor Oscar Leeser stated that while he supports the Senate border bill and thinks we need bipar..."
        ]
    },
    {
        "date": "2024-02-07",
        "most-common-noun": "Wednesday",
        "frequency": 11,
        "snippets": [
            "An embattled former executive of a New York real estate development firm was indicted Wednesday on charges he allegedly conspired in an $86.6 million fraud sche...",
            "Connecticut Gov. Ned Lamont on Wednesday gave an upbeat assessment of the state and its finances, countering calls from some of his fellow Democrats to raise ta...",
            "February 7, 2024\n\nWASHINGTON — A US drone strike that killed an Iraqi militia commander in eastern Baghdad on Wednesday was weeks in the making, part of a cal...",
            "The motion to proceed the package was defeated by a 49-50 vote on Wednesday\n\nRepublicans in the US Senate have blocked a bill that would have allowed for more f...",
            "NDP Leader Jagmeet Singh said Wednesday he warned Prime Minister Justin Trudeau during a recent closed-door meeting that there will be \"repercussions\" if the go...",
            "Here we are, and it is the first Wednesday of the month, and that can only mean that SLAGER-MANIA has once again returned. To celebrate, we have a timer on the ...",
            "The Senate on Wednesday rejected a bill that welded foreign military aid with what was billed as a border security package.\n\nThe bill, which was violently oppos...",
            "Joe Biden on Wednesday traveled to New York City to attend three private fundraisers.\n\nHe lumbered up the stairs to Air Force One after ignoring reporters.\n\nWAT...",
            "Sen. James Lankford (R-OK) said on Wednesday that an unnamed but “popular” right-wing media figure recently threatened him for working on a sweeping immigra...",
            "Democrats are hemorrhaging support from black and Hispanic Americans.\n\nThe newest Gallup data, published on Wednesday, found the Democratic Party has lost the s...",
            "Azerbaijani President Ilham Aliyev secured a fifth consecutive term in elections on Wednesday, official results showed, an expected outcome after his country's ..."
        ]
    },
    {
        "date": "2024-02-08",
        "most-common-noun": "Biden",
        "frequency": 23,
        "snippets": [
            "Special counsel Robert Hur released a report Thursday recommending against charging President Joe Biden for retaining classified documents from his years as vic...",
            "While describing the decision as a “glaring” double standard, Haley also used the decision to take a jab at both Biden and her rival Trump: “Both Joe Bide...",
            "Photo: Getty Images\n\nThe special counsel investigating Joe Biden’s handling of classified records while he was out of office announced on Thursday that he wou...",
            "In what comes as a devastating blow to his bid for re-election, Special Counsel Robert Hur effectively told President Joe Biden he won’t be charged for keepin...",
            "Republican Sen. Rick Scott (FL) called on President Joe Biden’s cabinet to invoke the 25th Amendment on Thursday, following revelations from Special Counsel R...",
            "Special Counsel Robert Hur on Thursday released a 388-page report on Biden’s stolen classified documents investigation.\n\nJoe Biden STOLE SCIF-designated class...",
            "LEESBURG, Virginia—Hours after the Justice Department released a report accusing Joe Biden of being an “elderly man with a poor memory,” the president mad...",
            "That scathing description came just as Biden’s aides were trying to explain away the president’s most recent verbal gaffes — in which he mixed up the head...",
            "President Joe Biden worked so closely with the ghostwriter he is accused of sharing government secrets with, Mark Zwonitzer, that he once declared that he’d t...",
            "So.\n\nNo criminal charges for President Biden for “willfully” holding onto classified documents in the garage of his home and at an office.\n\nThe report from ...",
            "On Thursday’s broadcast of “CNN News Central,” CNN Political Commentator Paul Begala reacted to remarks about President Joe Biden’s memory in the specia...",
            "On Thursday’s broadcast of “CNN News Central,” co-host Boris Sanchez stated that the White House isn’t going to put President Joe Biden out in public mo...",
            "The NY Post reports:\n\nBut, perhaps most damaging for the president, Hur — a former Maryland US attorney — suggested that jurors would not hold Biden liable ...",
            "Photo: Annabelle Gordon/CNP/Bloomberg via Getty Images\n\nThe special counsel investigating Joe Biden determined in a report released Thursday that the president ...",
            "Shortly after Special Counsel Robert Hur's report recommending against criminal charges for President Joe Biden was released Thursday, Biden's attorneys sent a ...",
            "(MSN) – Special counsel Robert Hur said President Biden, during his time as a private citizen, “willfully” kept classified documents on Afghanistan and mo...",
            "Within hours of the release of a report declining to charge President Joe Biden over handling sensitive documents on the grounds that he was a “well-meaning, ...",
            "The US Department of Justice has found evidence that President Joe Biden willfully retained classified materials pertaining to military, intelligence, and natio...",
            "WASHINGTON — Special counsel Robert Hur has declined to prosecute President Joe Biden for his handling of classified documents but said in a report released T...",
            "The Department of Justice released its long-awaited investigation into Joe Biden's mishandling of classified documents Thursday, delivering a damning assessment...",
            "President Joe Biden will not be charged over his retention of government documents, Special Counsel Robert Hur announced on Thursday. In doing so, Hur stated th..."
        ]
    },
    {
        "date": "2024-02-09",
        "most-common-noun": "Friday",
        "frequency": 12,
        "snippets": [
            "The Bear Season 3 will premiere on Hulu this June, FX chairman John Landgraf revealed at Friday’s Television Critics Association conference. Although there wa...",
            "The criminal case against Taylor Swift's alleged stalker, David Crowe, was dropped by the Manhattan District Attorney's Office in New York on Friday.\n\nCrowe was...",
            "The Supreme Court of Canada (SCC) ruled Friday against the province of Quebec’s challenge to the constitutionality of the child welfare provisions in the Act ...",
            "Results which have continued to come in through late Friday, some 12 hours after polling for national and provincial assemblies ended Thursday, show PTI-affilia...",
            "Variety reports:\n\nIn a blog post Friday, Instagram, the popular photo and video app owned by Meta, said it will no longer “proactively recommend” political ...",
            "Former President Donald Trump will speak at the NRA Presidential Forum in Pennsylvania on Friday, February 9.",
            "(JERUSALEM POST) – Credit ratings agency Moody's on Friday concluded its review of Israel and downgraded the country to \"A2\" from \"A1\", citing material politi...",
            "Some of \"The View\" co-hosts suggested on Friday that Vice President Kamala Harris or California Gov. Gavin Newsom would make a better Democratic presidential no...",
            "Hawaii was hit with a powerful magnitude 5.7 earthquake on Friday at around 10 am local time.\n\nA couple of hours later Los Angeles was hit with a magnitude 4.6 ...",
            "Former New York Mets general manager Billy Eppler was suspended through the 2024 World Series on Friday by baseball Commissioner Rob Manfred, who concluded he d...",
            "Happy Friday, Gentle Readers,\n\nI don't know about you, but I'm taking the weekend off to hide from the news. Thursday night's revelation that Joe Biden is perfe...",
            "Voting in Pakistan’s elections ended on Thursday, and even though the votes were still being tabulated on Friday, early results showed Islamist former Prime M..."
        ]
    },
    {
        "date": "2024-02-10",
        "most-common-noun": "memeorandum",
        "frequency": 16,
        "snippets": [
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites..."
        ]
    },
    {
        "date": "2024-02-11",
        "most-common-noun": "Sunday",
        "frequency": 29,
        "snippets": [
            "Israeli Prime Minister Benjamin Netanyahu took it upon himself to back President Joe Biden and vouch for Biden’s mental soundness early Sunday morning. The su...",
            "Former President Trump made a bold statement on his Truth Social social media platform Sunday before the Big Game (the Super Bowl, for all you non-sports fans),...",
            "On Sunday, the Customs and Border Protection (CBP) announced that a CPB dog had sniffed out four mummified monkeys in the luggage of a passenger returning to th...",
            "In an unusual session held on Super Bowl Sunday, the US Senate voted to move forward a substantial $95 billion aid package that will support Ukraine, Israel, an...",
            "The finer details behind Donald Trump's plan to deport millions of illegal immigrants are starting to emerge.\n\nIn a report published Sunday evening, Axios outli...",
            "President Biden and Israeli Prime Minister Benjamin Netanyahu spoke Sunday for the first time in more than three weeks, amid rising U.S. concerns over Israel’...",
            "There's a news alert out of Houston this Sunday, as police confirm to multiple media outlets that a shooter has been killed after gunfire interrupted a service ...",
            "The Houston Police Department used a Sunday afternoon press conference to announce that the Lakewood Church attacker was a female.\n\nBreitbart News reported that...",
            "HOUSTON — A woman in a trenchoat entered the Houston megachurch of celebrity pastor Joel Osteen and started shooting Sunday afternoon and was killed by two of...",
            "A shooting was reported at Joel Osteen’s Lakewood megachurch in Houston on Sunday.\n\nThe female shooter wore a trench coat as she walked into the church and cl...",
            "Finns headed to the polls Sunday to cast their votes for president, and after a close race, ex-Prime Minister Alexander Stubb of the center-right National Coali...",
            "Two people were injured and one suspect was killed during a shooting at Joel Osteen's Lakewood Church on Sunday afternoon, Texas authorities say.\n\nDuring a pres...",
            "Lloyd Austin has sought urgent treatment for the second time this year\n\nUS Defense Secretary Lloyd Austin was hospitalized over a medical emergency on Sunday, t...",
            "NBC news host Kristen Welker asked Department of Homeland Security Secretary Alejandro Mayorkas point-blank on Sunday if he deserved to keep his job over the cr...",
            "The Pentagon announced that Secretary of Defense Lloyd Austin, 70, was hospitalized Sunday afternoon for “symptoms suggesting an emergent bladder issue.” Th...",
            "Law enforcement officers responded to a \"possible shooter\" at Joel Osteen's Lakewood Church in Texas on Sunday afternoon. The shooting suspect is reportedly dea...",
            "Secretary of Defense Lloyd Austin has been readmitted to hospital, the Pentagon said on Sunday afternoon.\n\nPentagon Press Secretary Maj. Gen. Pat Ryder gave an ...",
            "The Royal Navy announced on Sunday that the departure of the HMS Prince of Wales from Portsmouth Naval Base had been delayed. The Royal Navy's newest and most e...",
            "Kyle Juszczyk might have the best pregame outfit of Super Bowl Sunday.\n\nThe San Francisco 49ers fullback entered the stadium with a customized jacket representi...",
            "The head of NATO led an international response Sunday denouncing Donald Trump's comment that he would encourage Russia to do \"whatever the hell they want\" to me...",
            "President Joe Biden warned Israeli Prime Minister Benjamin Netanyahu in a 45-minute telephone call Sunday not to attack Hamas’s last stronghold in Rafah witho...",
            "Defense Secretary Lloyd Austin was back in the hospital Sunday, returning to Walter Reed National Military Center for what was characterized in a Pentagon state...",
            "A sweeping US foreign aid package, including $60 billion for Ukraine, passed a key procedural vote Sunday, although opposition from right-wing Republicans may b...",
            "The Pentagon announced Sunday that Defense Secretary Lloyd Austin is back in the hospital, weeks after a lengthy hospitalization following prostate cancer treat...",
            "The shooter who opened fire Sunday at Joel Osteen's church in Texas is down, authorities say.\n\n\"Correction: shooter is down,\" Harris County Sheriff Ed Gonzalez ...",
            "US Secretary of Defense Lloyd Austin was taken to the hospital again on Sunday, a Pentagon spokesman said, this time \"for symptoms suggesting an emergent bladde...",
            "A young child between the ages of 5 and 9 was shot at pastor Joel Osteen’s Houston megachurch on Sunday, according to officials.\n\nFirst responders descended o...",
            "Sebastien Haller scored a dramatic late winner as hosts Ivory Coast fought back to beat Victor Osimhen's Nigeria 2-1 in Sunday's Africa Cup of Nations final and...",
            "Former Prime Minister Alexander Stubb won Finland's presidential election runoff on Sunday against ex-Foreign Minister Pekka Haavisto in a close race between tw..."
        ]
    },
    {
        "date": "2024-02-12",
        "most-common-noun": "Donald",
        "frequency": 16,
        "snippets": [
            "WASHINGTON — Donald Trump 's claim that he once told a NATO ally that he would encourage Russia ''to do whatever the hell they want'' to ''delinquent'' member...",
            "The facts just change on a whim, he says.\n\nDonald Trump’s political career has showcased his nebulous relationship with truth and reality, and now the same is...",
            "The judge overseeing former President Donald Trump’s Georgia election inference case stated Monday that Fulton County District Attorney Fani Willis’ alleged...",
            "On the campaign trail this weekend, Donald Trump made clear that if elected president again, he’d pursue more extreme immigration policies, including mass dep...",
            "As expected, Donald Trump has filed his application at the Supreme Court to keep the federal election interference case on hold while he keeps appealing. To suc...",
            "At a campaign event, Donald Trump claimed he told a NATO member that he would withhold U.S. help and encourage Russia “to do whatever the hell they want'' to ...",
            "A senator from Ohio is warning voters that some Republicans in the Senate have gone along with Democrats to set up a plan to force President Donald Trump, if he...",
            "Republican presidential candidate and former U.S. President Donald Trump gestures as he wraps up a campaign event on December 19, 2023 in Waterloo, Iowa. Iowa R...",
            "We have come to expect that certain members of the GOP will back even the most extreme, dangerous, or just plain absurd comments that Donald Trump makes. This t...",
            "Former President Donald Trump never misses an opportunity to twist reality for his own benefit. Even when presented with a perfectly viable truth that he can us...",
            "Former US president Donald Trump defended his record on NATO Monday, saying he had made it \"strong\" after sparking a firestorm of criticism over comments downpl...",
            "A Georgia judge on Monday said it was possible Fulton County District Attorney Fani Willis could be disqualified from Donald Trump’s election interference cas...",
            "Donald Trump’s recent threat that he would allow Russia to do “whatever the hell they want” with NATO countries if he’s elected president undermined a k...",
            "Now that Joe Biden’s politically weaponized DOJ has scored an “own goal”, the prospect of another four-years of the Donald stumbling around the Oval Offic...",
            "The New York Times reports:\n\nFormer President Donald J. Trump is privately discussing endorsing his daughter-in-law, Lara Trump, to be the co-chair of the Repub...",
            "February 13, 2024 04:26 am | Updated 04:26 am IST - WASHINGTON:\n\nDonald Trump on Monday turned to the U.S. Supreme Court as he presses his claim - rejected by l..."
        ]
    },
    {
        "date": "2024-02-13",
        "most-common-noun": "Opinion",
        "frequency": 11,
        "snippets": [
            "Opinion editor's note: Star Tribune Opinion publishes a mix of national and local commentaries online and in print each day. To contribute, click here.\n\n••?...",
            "Opinion editor's note: Star Tribune Opinion publishes a mix of national and local commentaries online and in print each day. To contribute, click here.\n\n••?...",
            "Opinion editor's note: Star Tribune Opinion publishes a mix of national and local commentaries online and in print each day. To contribute, click here.\n\n••?...",
            "Opinion editor's note: Star Tribune Opinion publishes letters from readers online and in print each day. To contribute, click here.\n\n•••\n\nI'm dumbfounded ...",
            "Opinion editor's note: Editorials represent the opinions of the Star Tribune Editorial Board, which operates independently from the newsroom.\n\n•••\n\nHere's...",
            "Opinion editor's note: Star Tribune Opinion publishes a mix of national and local commentaries online and in print each day. To contribute, click here.\n\n••?..."
        ]
    },
    {
        "date": "2024-02-14",
        "most-common-noun": "President",
        "frequency": 10,
        "snippets": [
            "On CNN, a \"reporter\" interviewing Vice President Kamala Harris gushes, \"I'm struck, just in your presence! Looking you in the eye, with your passion. …\"\n\nReal...",
            "President Joe Biden is shielding Palestinians in the United States from deportation while authorizing the Department of Homeland Security (DHS) to loosen work r...",
            "President Joe Biden’s Department of Homeland Security (DHS) is drafting plans that would include a “mass release” of illegal aliens currently in Immigrati...",
            "One of the things in particular that riled up the Biden White House so much about the Hur report was the mention by Special Counsel Robert Hur that President Jo...",
            "US President Joe Biden may not have the stamina for a conventional campaign but he's up to the task of governing, influential House of Representatives lawmaker ...",
            "Russian President Vladimir Putin openly expressed his preference for President Joe Biden as a better choice for the White House than former President Donald Tru...",
            "President Biden on Wednesday shielded thousands of Palestinians in the United States from deportation for the next 18 months, using an obscure immigration autho...",
            "For President Biden, this is high noon, to borrow the title of the iconic Gary Cooper western. He’s facing showdowns over wars in Gaza and Ukraine and along t..."
        ]
    },
    {
        "date": "2024-02-15",
        "most-common-noun": "Trump",
        "frequency": 19,
        "snippets": [
            "Diary of disturbing disinformation and dangerous delusions\n\nThis smear:\n\n“[Trump] did not move on making sure that we dealt with vaccinating the American publ...",
            "— The schedule means Trump will spend weeks in court instead of on the campaign trail. — Former President Donald Trump's first criminal trial will start on ...",
            "— The schedule means Trump will spend weeks in court instead of on the campaign trail. — Former President Donald Trump's first criminal trial will start on ...",
            "— The schedule means Trump will spend weeks in court instead of on the campaign trail. — Former President Donald Trump's first criminal trial will start on ...",
            "— The schedule means Trump will spend weeks in court instead of on the campaign trail. — Former President Donald Trump's first criminal trial will start on ...",
            "Trump has already started his habitual mudslinging against the court and the trial itself, claiming over the last year that Merchan, who has acknowledged a $15 ...",
            "— The schedule means Trump will spend weeks in court instead of on the campaign trail. — Former President Donald Trump's first criminal trial will start on ...",
            "— The schedule means Trump will spend weeks in court instead of on the campaign trail. — Former President Donald Trump's first criminal trial will start on ...",
            "We got a taste Thursday of what former president Donald Trump’s jam-packed legal schedule could look like in the coming months, with a split-screen of key hea...",
            "— The schedule means Trump will spend weeks in court instead of on the campaign trail. — Former President Donald Trump's first criminal trial will start on ...",
            "While writing Current Black Prosecutor Malfeasance Cases Suggest James/Engoron Trump Looting Thesis All Too Plausible, I did some research on Fulton County (Atl...",
            "Americans were still grappling with yet another mass shooting — this time, at the Kansas City Chiefs’ Super Bowl celebration — when Donald Trump delivered..."
        ]
    },
    {
        "date": "2024-02-16",
        "most-common-noun": "Trump",
        "frequency": 18,
        "snippets": [
            "During his New York civil fraud trial, Donald Trump angrily called the case a scam, part of \"the greatest witch hunt of all time.\" That argument may have found ...",
            "Representative Elissa Slotkin (D-MI) said Friday on MSNBC’s “Morning Joe” that if former President Donald Trump was reelected, he would “hand the keys o...",
            "Donald Trump suffered a big blow Friday as a New York judge ordered the former president and his companies to pay $355 million in penalties for what the judge d...",
            "MSNBC host Al Sharpton said Friday on MSNBC’s “Deadline” that the New York City civil fraud trial judgment against former President Donald Trump of $354 m...",
            "Amna Nawaz:\n\nIn a stunning financial blow, a judge in New York today fined Donald Trump and his business associates more than $350 million, ruling they engaged ...",
            "The sweeping punishment meted out Friday by a New York judge on Donald Trump and his family business deals a serious blow to the former president in his longtim...",
            "Judge Arthur Engoron on Friday released his verdict in Letitia James’ New York City fraud trial against President Trump.\n\nThe judge made his decision in a 92-...",
            "Welcome back, Deadline: Legal Newsletter readers. It was another wild week in the legal world of Donald Trump, with action in all four of the leading GOP presid...",
            "Legal experts analyzed what they called \"breathtaking\" civil penalties against former President Donald Trump, Donald Trump Jr., Eric Trump, former Trump Organiz...",
            "Former President Trump is expected to respond to the judge’s decision in his New York civil fraud trial, which ordered him to pay more than $355 million for c...",
            "Rapper Kanye West said this week that he still supports former President Donald Trump.\n\nWest, who made headlines during Trump’s time in office for supporting ...",
            "Former President Donald Trump and his sons were ordered to pay $364 million over a lawsuit in a New York state Supreme Court on Friday.\n\nThe civil lawsuit was f...",
            "New York Attorney General Letitia James will hold a press conference after former President Donald Trump was fined over $350 million dollars in the state’s fr...",
            "After a brief silence, except to complain about a photo that makes him look obese, Donald Trump addressed the massive amount in fines he needs to fork over. Jud..."
        ]
    },
    {
        "date": "2024-02-17",
        "most-common-noun": "Trump",
        "frequency": 14,
        "snippets": [
            "A European leader told his colleagues on Saturday that they should stop fixating on former President Donald Trump and get to work to make Europe, including Ukra...",
            "Friday’s bombshell ruling in the New York fraud case fined Donald Trump $355 million and Eric and Donald Trump Jr. $4 million each. The sons were also barred ...",
            "If anyone was waiting for the other shoe to drop in the upcoming presidential race, former President Donald Trump just did, launching his own line of tennis sho...",
            "As he closes in on the Republican presidential nomination, former President Donald Trump made a highly unusual stop\n\nPHILADELPHIA -- As he closes in on the Repu...",
            "We've been talking for some time about how bad Joe Biden's classified documents scandal was compared to former President Donald Trump's situation. Trump had thi...",
            "Friday, a New York judge ordered Donald Trump to pay an approximately $350 million fine in a civil fraud trial.\n\nBACKGROUND:\n\nBREAKING: Judge Orders Trump to Pa...",
            "An online campaign wants to cover a $354 million court judgment against the former US president\n\nFans of Donald Trump have started a crowdfunding campaign seeki...",
            "President Donald Trump took the stage at Sneaker Con in Philadelphia this afternoon, where he unveiled a new line of sneakers, merging the realms of politics an...",
            "The Pennsylvania Capital-Star reports:\n\nOn Saturday, former President Donald Trump made what appeared to be a last-minute visit to Philadelphia to speak at Snea...",
            "Donald Trump’s fans are rallying to raise money after the embattled former president was hit with a $364 million judgment in his New York civil fraud trial on...",
            "First there were MAGA hats, shirts and flags… Now there are gold shoes.\n\nFormer President Donald Trump unveiled his newest line of self branded merch at Sneak..."
        ]
    },
    {
        "date": "2024-02-18",
        "most-common-noun": "memeorandum",
        "frequency": 12,
        "snippets": [
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites...",
            "About memeorandum:\n\nmemeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\n\nUnlike sister sites..."
        ]
    },
    {
        "date": "2024-02-19",
        "most-common-noun": "New",
        "frequency": 12,
        "snippets": [
            "Body camera footage captured the moment a New York man lunged at police officers with a knife and stabbed a rookie cop several times before another officer kill...",
            "February 20, 2024 05:05 am | Updated 05:05 am IST - HYDERABAD\n\nChief Minister A. Revanth Reddy and Deputy Chief Minister Bhatti Vikramarka flew to New Delhi on ...",
            "New York has charged former president Donald Trump $355 million for allegedly inflating the value of his properties in order to defraud banks — despite zero e...",
            "New York CNN —\n\nThe United States has proposed a United Nations Security Council draft resolution on Gaza calling for a temporary ceasefire in Israel’s war ...",
            "A subway operator found a severed human leg on the tracks in the Bronx borough, according to the New York Police Department.\n\nThe leg was found on Saturday afte...",
            "\n\nposter American Fiction\n\n(Image by MRC) Details DMCA\n\n\n\nGroton, the elite New England boarding school, often invited in orators who would deliver rhetorical f...",
            "Apology To The Survivors Of Lake Alice\n\nThe Royal Australian and New Zealand College of Psychiatrists offers our deepest apology to the survivors, their whānau...",
            "ABC News reports:\n\nAfter Speaker Mike Johnson rejected the Senate-passed national security supplemental, a bipartisan group of House lawmakers unveiled a new pr...",
            "The New York Times Publisher A.G. Sulzberger admits that the Biden administration has been less than impressed with their coverage of his age and declining heal...",
            "Dept Of Internal Affairs Lose At High Court On Pokies Relocations\n\nThere are too many pokies in Aotearoa New Zealand says Colin Bridle, Deputy Chair of Feed Fam...",
            "Reason magazine’s Volokh Conspiracy has posted a ferocious denunciation of the Trump/James/Engoron atrocity: President Trump’s Kafkaesque Civil Trial in New...",
            "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ...",
            "Fox News host Arthel Neville grilled conservative pundit Gianno Caldwell after he suggested Donald Trump should re-elected because of his experience.\n\nDuring an...",
            "A ruling by a New York judge that President Donald Trump must pay $355 million to the state for fraud, \"without any actual fraud,\" is being challenged, accordin...",
            "Known Policy Challenges Must Be Tackled Head-on To Strengthen Economic Resilience\n\nThe New Zealand Productivity Commission Te Kōmihana Whai Hua o Aotearoa (the..."
        ]
    },
    {
        "date": "2024-02-20",
        "most-common-noun": "Tuesday",
        "frequency": 17,
        "snippets": [
            "Eleven Ukrainian children crossed the border from Belarus to Ukraine Tuesday evening, in the latest return of children taken to Russia and occupied territories ...",
            "Pakistan's two dynastic parties announced late Tuesday a power-sharing agreement that is set to return Shehbaz Sharif to the premiership after an election this ...",
            "Former U.N. Ambassador Nikki Haley on Tuesday vowed to stay in the Republican primary, even if she loses Saturday’s vote in her home state of South Carolina. ...",
            "Brian Walshe, the Massachusetts man charged with the murder of his real estate executive wife, was sentenced on Tuesday to 37 months behind bars in a separate c...",
            "Former South Carolina Governor Nikki Haley on Tuesday suggested that Donald Trump was at risk of developing dementia, stoking the online ire of his MAGA support...",
            "WASHINGTON – The Biden administration will impose \"major sanctions\" on Russia, the White House said Tuesday, in response to the death of Alexei Navalny, a fie...",
            "WASHINGTON — Hunter Biden 's lawyers suggested Tuesday that claims made by a former FBI informant charged with fabricating a bribery scheme involving the pres...",
            "New Jersey's First Lady Tammy Murphy, who is running for U.S. Senate, said Tuesday she opposes construction of a gas-fired backup power plant in a minority neig...",
            "Audrii Cunningham, an 11-year-old girl from Livingstone, Texas, was found deceased in the Trinity River on Tuesday. Audrii disappeared on February 15th after le...",
            "MADISON, Wis. — A Republican prosecutor asked the Wisconsin Supreme Court on Tuesday to decide whether a 174-year-old state law bans abortion in the state wit...",
            "Thousands of supporters of Albania’s opposition held an anti-government protest Tuesday accusing the Cabinet of corruption.\n\nProtesters threw stones and flare...",
            "Russian Foreign Minister Sergei Lavrov reaffirmed Tuesday his government’s support for the administration of Venezuelan President Nicolás Maduro, expressing ...",
            "With LeBron James in Year 21 as an NBA superstar, a debate topic about the next face of the league took center stage during ESPN’s \"First Take\" on Tuesday.\n\nA...",
            "EXCLUSIVE: Former President Trump is expected to raise more than $6 million at a fundraiser in South Carolina Tuesday night ahead of Saturday’s GOP primary.\n\n...",
            "The political rivals of Pakistan’s imprisoned former Prime Minister Imran Khan announced details of a power-sharing agreement late Tuesday, naming Shehbaz Sha...",
            "U.K. judges debate whether Julian Assange can appeal his extradition to the U.S. On Tuesday, a U.K. court began hearing arguments on whether Wikileaks founder J...",
            "For the third time since war broke out in Gaza in October, the US vetoed a ceasefire resolution at the United Nations on Tuesday — even as it unveiled its own..."
        ]
    },
    {
        "date": "2024-02-21",
        "most-common-noun": "Top",
        "frequency": 20,
        "snippets": [
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar..."
        ]
    },
    {
        "date": "2024-02-22",
        "most-common-noun": "President",
        "frequency": 10,
        "snippets": [
            "On Monday, the mainstream media devoted a considerable amount of attention to an eye-opening new claim from White House sources that President Joe Biden was, at...",
            "A former FBI informant who claims to have links to Russian intelligence and is charged with lying about a multimillion-dollar bribery scheme involving President...",
            "Claim: As of January 2024, more than 7.2 million migrants had illegally crossed into the U.S. over the Southwest border during U.S. President Joe Biden's admini...",
            "Weeks after a meeting between former President Donald Trump and Teamsters Union leaders, including President Sean O'Brien and Secretary-Treasurer Fred Zuckerman...",
            "About the Video\n\nMary Altaffer took this photo for AP. It shows former President Trump being escorted to a courtroom in New York on April 4, 2023, during his tr...",
            "ABC News reports:\n\nThe judge in former President Donald Trump’s civil fraud case has rejected a request from the defense to delay the enforcement of the penal...",
            "“MAGA will govern for fifty years. President Trump will go down as the best president since Abraham Lincoln and will win in a massive frickin’ landslide.\n\n?...",
            "LAS VEGAS (AP) — A former FBI informant accused of lying about multimillion-dollar bribery allegations against President Joe Biden and his son Hunter and purp...",
            "Not long after socialist activists flooded into Buenos Aires to protest President Javier Milei's sweeping budget cuts and reforms, it has been announced that Ar..."
        ]
    },
    {
        "date": "2024-02-23",
        "most-common-noun": "news",
        "frequency": 12,
        "snippets": [
            "Guest lineups for the Sunday news shows\n\nGuest lineups for the Sunday news shows\n\nThe Associated Press\n\nBy The Associated Press\n\nWASHINGTON -- ABC’s “This W...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "This is an edition of The Atlantic Daily, a newsletter that guides you through the biggest stories of the day, helps you discover new ideas, and recommends the ...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar..."
        ]
    },
    {
        "date": "2024-02-24",
        "most-common-noun": "Trump",
        "frequency": 18,
        "snippets": [
            "NBC News exit poll: Majority of S.C. GOP primary voters say Trump would be fit to be president if convicted\n\n65% of South Carolina Republican primary voters sai...",
            "Former President Donald Trump crushed Nikki Haley in the Conservative Political Action Conference’s (CPAC) straw poll on Saturday.\n\nTrump destroyed Haley with...",
            "Former President Donald Trump, the leading GOP candidate for president and likely GOP nominee, looks to continue his perfect streak on Saturday night in the Pal...",
            "Body language expert Judi James told TheMirror.com that Donald Trump seemed to be 'consuming his own words' during tonight's speech at the CPAC conference as hi...",
            "By Alexandra Ulmer and Nathan Layne\n\nGEORGETOWN, South Carolina (Reuters) - As Donald Trump comes close to clinching a third presidential nomination, anti-Trump...",
            "Standing alone, staring down the barrels of a legion of lawyers, former President Donald Trump will make his stand.\n\n“Biden and his deranged prosecutors, atto...",
            "Presently it is very likely that Donald Trump will be the nominee of the Republican Party. Joe Biden will represent the Democrats as the DNC had refused to groo...",
            "The Associated Press reports:\n\nAt least one member of the Republican National Committee is working to slow Donald Trump’s attempted takeover of the organizati...",
            "A GoFundMe fundraising campaign launched to help cover former President Donald Trump’s legal fees has raised over a million dollars in about a week.\n\nThe fund...",
            "As South Carolinians headed to the polls on Saturday, former President Donald Trump split time between the Palmetto State and National Harbor, Maryland. As he?...",
            "NBC News exit poll: Majority of S.C. GOP primary voters say Trump would be fit to be president if convicted More than 6 in 10 (65%) South Carolina Republican pr...",
            "Donald Trump issued a social media post Friday strongly supporting in vitro fertilization (IVF) after the Alabama Supreme Court issued a ruling concerning the l...",
            "President Trump spoke at CPAC on Saturday to a lively and patriotic crowd. He held a big rally in Rock Hill, South Carolina on Friday.\n\nPresident Trump warned o...",
            "Trump's mounting legal fees could spell financial peril NPR's Scott Detrow speaks with correspondent Domenico Montanaro and journalist David Cay Johnston about ...",
            "In Trump vs. Haley primary, South Carolinians weigh in South Carolina Republicans hold their primary on Saturday. Their choices are former President Donald Trum...",
            "Print this page\n\nDonald Trump on Saturday branded himself a “political dissident” facing persecution from “thugs” in the US justice system as he issued ..."
        ]
    },
    {
        "date": "2024-02-25",
        "most-common-noun": "access",
        "frequency": 13,
        "snippets": [
            "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ...",
            "Special Counsel Robert Hur could not determine who had access to Joe Biden’s stolen classified documents stored at Penn Biden Center because security deleted ...",
            "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ...",
            "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ...",
            "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ...",
            "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ...",
            "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ..."
        ]
    },
    {
        "date": "2024-02-26",
        "most-common-noun": "Biden",
        "frequency": 14,
        "snippets": [
            "Joe Biden told reporters Monday he expects Israel and Hamas to reach a deal this weekend for the release of the remaining Israeli hostages in the Gaza Strip—a...",
            "Washington — President Biden said Monday that a deal between Israel and Hamas for a cease-fire in Gaza is close.\n\n\"My national security adviser tells me that ...",
            "CBS created an uproar when they fired investigative journalist Catherine Herridge, who had been pursuing multiple stories pertaining to the Biden family, among ...",
            "The aerial campaign waged by Joe Biden’s DoD and his Western allies against the Shia Islamist group Ansar Allah – popularly known as Houthis – seems not t...",
            "Last month prospective voters across New Hampshire were confronted with a fake Joe Biden robocall urging them not to vote in the state’s presidential primary....",
            "Geoff Bennett:\n\nA campaign for Michigan voters to boycott President Biden in Tuesday's primary has picked up momentum.\n\nSome Muslim and Arab Americans are hopin...",
            "NEW YORK (AP) — President Joe Biden sat down for an interview with late-night comic Seth Meyers on Monday while he’s in New York for a campaign event with d...",
            "Biden, in recent weeks, has pushed harder for a pause in the fighting in order to enable additional humanitarian aid to flow into Gaza and to allow for the rele...",
            "Create your free profile or log in to save this article\n\nCreate your free profile or log in to save this article\n\nPresident Joe Biden said Monday that he hopes ...",
            "On Super Bowl Sunday, the White House released a short video in which a smiling President Biden, sitting next to a table stocked with chips, cookies and sports ...",
            "President Joe Biden is asking Congress to pass a Senate bill to preserve a program at the United States-Mexico border that the illegal alien charged with murder...",
            "RAFAH, Gaza Strip (AP) — President Joe Biden said Monday that he hopes a cease-fire between Israel and Hamas that would pause hostilities and allow for remain...",
            "Biden says he hopes cease-fire, hostage deal to pause Israel-Hamas war can take effect by next Monday\n\nBiden says he hopes cease-fire, hostage deal to pause Isr..."
        ]
    },
    {
        "date": "2024-02-27",
        "most-common-noun": "leaders",
        "frequency": 13,
        "snippets": [
            "When President Biden met with top congressional leaders in the Oval Office on Tuesday, Shalanda Young was there picking up signs of optimism.\n\nYoung runs Biden?...",
            "Geoff Bennett:\n\nCongress faces a number of crises this week, as leaders race to meet deadlines, including one that could spark a partial government shutdown. Fu...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Lavora Barnes:\n\nSo, that's — you have exactly described my job, right? I am organizing our team, our volunteers, our staff, and our leaders across the state.\n...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar...",
            "A Democratic congresswoman from Pennsylvania has canceled her scheduled Saturday address to an Islamic organization, some of whose leaders celebrated Hamas’ b...",
            "President Joe Biden is scheduled to meet Thursday with U.S. Border Patrol officials and local leaders in Brownsville, Texas, as part of his second trip to the s...",
            "Sister Sites:\n\nTechmeme\n\nTop news and commentary for technology's leaders, from all around the web Top news and commentary for technology's leaders, from all ar..."
        ]
    },
    {
        "date": "2024-02-28",
        "most-common-noun": "Wednesday",
        "frequency": 16,
        "snippets": [
            "The US Supreme Court agreed on Wednesday to hear former US President Donald Trump’s immunity claim in the federal 2020 election interference case against him....",
            "NEW YORK (AP) — White powder was found Wednesday in an envelope addressed to the New York judge who ordered Donald Trump to pay a $454 million civil fraud jud...",
            "More than two dozen members of Congress sent a letter to the Biden administration on Wednesday calling for consequences and accountability in Pakistan following...",
            "Sixteen railroad freight cars carrying corn derailed early Wednesday under a key railroad overpass in the northeast Nevada city of Elko, but no injuries were re...",
            "Wisconsin cities recorded nearly 60-degree swings in temperatures within 24 hours from Tuesday's balmy weather and Wednesday's chilly return to winter, tying a ...",
            "Mississippi's Republican-led House passed a bill Wednesday that would expand Medicaid benefits to hundreds of thousands more residents in one of the poorest sta...",
            "Former President Trump thanked the Supreme Court Wednesday for agreeing to weigh whether he can be criminally prosecuted for efforts to overturn the 2020 electi...",
            "The New York Times reports:\n\nCongressional leaders said on Wednesday they had agreed to another short-term stopgap spending bill to head off a partial governmen...",
            "Mitch McConnell, a lion of the Senate and one of its shrewdest legislative tacticians over four decades, announced on Wednesday afternoon that he will step down...",
            "Congressional leaders announced Wednesday that they have reached a tentative agreement to prevent a government shutdown for now, days before an end-of-the-week ...",
            "Hunter Biden did not deny President Joe Biden is the “big guy,” Rep. Marjorie Taylor Greene (R-GA) exclusively told Breitbart News following Wednesday’s d...",
            "Participants on ABC’s “The View” were left wrestling with the massive “uncommitted” votes in Michigan’s Democratic primary on Wednesday.\n\nAs of earl...",
            "Senate Minority Leader Mitch McConnell’s (R-Ky.) decision to step down from his leadership role, announced Wednesday, was both shocking and unsurprising.\n\nThe...",
            "Politico reports:\n\nSen. Cindy Hyde-Smith (R-Miss.) blocked passage Wednesday of a bill to protect access to in-vitro fertilization nationwide — the first fede...",
            "Hunter Biden, the star witness in the GOP’s impeachment investigation into his father, appeared Wednesday on Capitol Hill, where Republicans spent a long day ...",
            "The carefully cultivated Supreme Court majority justified its cultivation, and Mitch McConnell's lasting infestation of American self-government, late Wednesday..."
        ]
    },
    {
        "date": "2024-02-29",
        "most-common-noun": "Biden",
        "frequency": 14,
        "snippets": [
            "Former President Donald Trump labeled the situation at the southern border “a Joe Biden invasion” while speaking to the media in Eagle Pass, Texas, on Thurs...",
            "March 01, 2024 05:13 am | Updated 05:13 am IST - BROWNSVILLE, Texas\n\nThree hundred miles apart, U.S. President Joe Biden and likely Republican challenger Donald...",
            "Breitbart Economics Editor John Carney said Thursday on Fox Business Network’s “Kudlow” that the Biden administration is undermining the Federal Reserve?...",
            "As President Joe Biden prepares for his State of the Union address next week, some of Capitol Hill’s most high-profile progressive Democrats are urging him to...",
            "Joe Biden arrived in Brownsville, Texas on Thursday for a drive-by photo-op border visit.\n\nBrownsville is a desolate stretch with virtually no illegal alien inv...",
            "President Biden and former President Trump made separate visits to two towns along the southern border as immigration becomes a key issue ahead of the November ...",
            "On Wednesday morning, before Hunter Biden was to testify, Ron Johnson went on Fox to discuss what to expect with Maria Bartiromo. However, Bartiromo did the une...",
            "After several dramatic twists and turns in the Will He or Won't He Appear for a Deposition saga involving Hunter Biden, the First Son finally sat for a closed-d...",
            "B | House Oversight Committee Considers Citing Hunter Biden For Contempt Of Congress WASHINGTON, DC – JANUARY 10: Hunter Biden, son of U.S. President Joe Bide...",
            "An Idaho company chosen for an $850 million Biden administration loan is defending its decision to enlist its co-owner, a Chinese battery company, to help build...",
            "Joe Biden finally made it down to the border again, for just the second visit in his life.\n\nBut he's not visiting one of the problem areas under crisis. He's vi...",
            "Ep. 78 The Biden administration helped install a pro-Chinese government in Brazil, which immediately shut down opposition media and began arresting dissidents. ...",
            "President Biden and former President Trump made dueling trips to the southern border on Thursday that had them in simultaneous meetings with local officials fol..."
        ]
    }
]