[
    {
        "date": "2024-02-01",
        "most-common-noun": "Thursday",
        "frequency": 9,
        "snippets": [
            "Benzino is claiming victory in his battle with Eminem.\n\nBenzino Thinks He Cooked Eminem\n\nOn Thursday (Feb. 1), Benzino went on Instagram Live to weigh in on the...",
            "A man barricaded himself in a room at the Waldorf Astoria Beverly Hills hotel Thursday morning, resulting in a police response that resulted in a partial evacua...",
            "President Biden on Thursday ordered broad financial and travel sanctions on Israeli settlers accused of violent attacks on Palestinians in the West Bank, a forc...",
            "In our news wrap Thursday, President Biden issued an executive order sanctioning Israeli settlers in the West Bank who have been accused of attacking Palestinia...",
            "Bruce Springsteen is mourning the loss of his mother, Adele Ann Springsteen, at 98.\n\nIn a heartfelt Instagram post, the legendary musician announced Thursday th...",
            "A unit of French advertising giant Publicis Groupe SA agreed Thursday to pay $350 million to settle claims it helped OxyContin maker Purdue Pharma fuel the opio...",
            "President Joe Biden privately speaks of former President Donald Trump in sometimes vulgar terms, according to Thursday’s West Wing Playbook in Politico.\n\nPoli...",
            "A man barricaded himself in a room at the Waldorf Astoria Beverly Hills hotel Thursday morning, resulting in a police response that resulted in a partial evacua...",
            "CEO Tim Cook called out the company’s AI investments on Thursday, adding that the tech giant will show off the fruits of those moves in the year ahead.\n\nThe c..."
        ]
    },
    {
        "date": "2024-02-02",
        "most-common-noun": "Taylor",
        "frequency": 6,
        "snippets": [
            "\n\nMatt is joined by Rolling Stone’s Ethan Millman to discuss the ongoing battle between Universal Music Group and TikTok, why Taylor Swift, Drake, and other a...",
            "Getty Image\n\nYou’ve seen all the stories by now.\n\nIf Taylor Swift is going to attend Super Bowl 58 and support boyfriend Travis Kelce, it’ll take one heck o...",
            "Olivia Newton-John was apparently a Swiftie -- at least that's what her rep says, telling us the late singer would've gotten a kick out of these Taylor Swift's ...",
            "Taylor Swift may have just dropped her biggest clue about when she will announce Reputation (Taylor’s Version) — and Swifties are ready for it.\n\nFans pointe...",
            "Japan is taking a moment to promise Us this: Taylor Swift will be able to make it to Super Bowl LVIII.\n\nAfter a flurry of concern that Swift, 34, wouldn’t hav..."
        ]
    },
    {
        "date": "2024-02-03",
        "most-common-noun": "s",
        "frequency": 9,
        "snippets": [
            "Release Description:\n\nBackground:\n\nLa Montaña, once a hub of scientific excellence, has transformed into a nightmare landscape following a catastrophic failure...",
            "Plot: A narcoleptic professor believes she witnessed a murder in her neighbor's home at the hands of a rapper. She becomes obsessed with finding the truth and i...",
            "At the kickoff of her Celebration Tour in London last year, Madonna treated fans with songs she hadn’t performed live in years, like “Nothing Really Matters...",
            "What's a decipoint? It's the place where ten different geographical boundaries meet. I live within a rock's throw of a tripoint, where three counties meet, but ...",
            "When the Recording Academy’s list of its 2024 lifetime achievement awardees was announced on Jan. 5, the name “Laurie Anderson” was most surprising to one...",
            "\n\n\n\nWhen you jump on this trampoline, you are getting some real altitude! And you don't even have to jump that high. Actor, model, and adventurer Jay Alvarrez t...",
            "This New Study Makes Women Look SO BAD!",
            "A word of advice: Don’t let Past Lives (now streaming on Paramount+, in addition to VOD services like Amazon Prime Video) slip by. Celine Song’s directorial...",
            "Business by Mary Spiller Detroit Business Owner Rides With President Joe Biden, Talks Shop And More Darren Riley and President Joe Biden talked about politics, ...",
            "Authorities in Los Angeles arrested a 21-year-old woman on Saturday in relation to a viral dognapping that sent the owner skidding across the hood of a moving c...",
            "Yolanda Saldivar, Selena Quintanilla‘s killer, is speaking from prison ahead of her eligibility for parole in 2025 in a new Oxygen True Crime docuseries.\n\nNea...",
            "Here's why songs by Taylor Swift, Drake and more are starting to disappear from TikTok\n\nWhy did TikTok remove songs? Universal Music Group said it wouldn't allo...",
            "The new week is here and we’re back with a brand new set of horoscopes to help you plan for the week ahead by checking what the stars have in store!\n\nSource: ...",
            "Australian actor Gregory Charles Rivers died on Friday aged 58.\n\nThe Queensland-born star relocated to Hong Kong in the late 80s and appeared in over 40 popular...",
            "They’ve been canceled by the streaming platform.\n\nWhile fans get excited for the new seasons of Sweet Home, Hellhound, and All of Us Are Dead, here are five s...",
            "Bring on the defense! Jason Kelce’s response to Taylor Swift’s NFL coverage has been nothing but supportive. The Philadelphia Eagles player shared his posit...",
            "Getty Image\n\nWhen it comes to thinking on its feet, NASCAR has not always had the best reputation.\n\nBut it earned the praise of fans of drivers alike on Saturda...",
            "[Warning: Potentially Triggering Content]\n\nTwo teenagers in the United Kingdom who were convicted last month of murdering 16-year-old transgender teenager Brian...",
            "(G)I-DLE’s Yuqi and Minnie have shared the story of an awkward moment when their love lives overlapped!\n\nOn the February 3 episode of JTBC’s “Knowing Bros...",
            "Service robots are becoming more common these days, from cute mobile trays that deliver food to your table to large rolling boxes that carry your luggage for yo...",
            "Entrepreneurship by Jeffrey McKinney SBA, White House Aim To Eclipse Record In Federal Contracting Run With Black Businesses, Launching A Revamped Program To As...",
            "Looks like you already have a subscription! You can verify your subscription or upgrade to LIFETIME HERE:",
            "Do you need a battery pack that can charge your iPhone 13 over 9 times? Maybe you are looking to get over five full charges for your iPad Pro? The ROMOSS 40000m...",
            "From Medium:\n\nThe creation of content is a noteworthy use of AI in book writing. Advanced algorithms for natural language processing enable AI systems to genera...",
            "Play video content\n\nScary moment in \"The Situation\" household ... as a Ring camera shows Mike Sorrentino's son choking on his favorite pasta.\n\nThe \"Jersey Shore...",
            "Posted in: Comics, DC Comics, Preview | Tagged: poison ivy\n\nPoison Ivy #19 Preview: Secret Origins Revealed\n\nDiscover the \"untold\" backstory of DC's favorite ec...",
            "Audio of “The Bear” star Ayo Edebiri ripping into Jennifer Lopez on the “Scam Goddess” podcast resurfaced Friday ahead of the two appearing as host and ...",
            "Matthew Vaughn Says ‘Deadpool 3’ Gives Him “A Little Fear” As It Has Similar Ideas To His ‘Kick-Ass’ Reboot\n\nMatthew Vaughn Says ‘Deadpool 3’ Gi...",
            "I was deeply saddened to learn of the passing of Wayne Kramer on 2/2/24. Kramer was, of course, the guitar mastermind behind one of the most influential bands i...",
            "[Note: This article contains no spoilers for the plot of the movie Argylle; we read a plot synopsis of it online, but honestly aren’t confident we followed it...",
            "Along the way, he even secured his first No. 1 record , thanks to Drake’s “ First Person Shooter .” But fans are desperate for Cole to step away from the ...",
            "Mike \"The Situation\" Sorrentino and his wife, Lauren, saved their 2-year-old son's life after he started choking on his favorite pasta. And now the reality TV s...",
            "Posted in: Lionsgate, Movies | Tagged: guy ritchie, the ministry of ungentlemanly warfare\n\nThe Ministry of Ungentlemanly Warfare: First Trailer & Images Release...",
            "Marco Raduano’s lunch date was going great until the carabinieri showed up.\n\nThe Italian mob boss-turned-prison breaker was caught Thursday by police on the M...",
            "\n\nArtist: Kings Of Gehenna\n\n\n\nAlbum: Return To Nightmare\n\n\n\nReleased: 2024\n\n\n\nStyle: Death Metal\n\n\n\nFormat: MP3 320Kbps\n\n\n\nSize: 106 Mb\n\n\n\n\n\n\n\nTracklist:\n\n01 ?...",
            "Literary organization PEN America has issued a statement on a book launch earlier this week in Los Angeles that was disrupted by protesters.\n\nThe organization h...",
            "Name a badder duo\n\nAll eyes were on Grammy-nominees Victoria Monét and Coco Jones who raised the R&Baddie bar at Spotify’s star-studded Best New Artist party...",
            "Posted in: Games, Paradox Interactive, Video Games | Tagged: Age of Wonders 4: Primal Fury\n\nAge Of Wonders 4 Primal Fury Comes Out Later This Month\n\nParadox Int...",
            "Editor’s Note: This essay about Plus One was originally published here on Decider in June of 2019, but we have republished it in honor of the film’s recent ...",
            "Watch : Dylan Sprouse Recalls Vicious Fist Fight With Twin Cole Sprouse\n\nDylan Sprouse is enjoying the suite life with new wife Barbara Palvin.\n\nThe former Disn...",
            "Watch : Dylan Sprouse Recalls Vicious Fist Fight With Twin Cole Sprouse\n\nDylan Sprouse is enjoying the suite life with new wife Barbara Palvin.\n\nThe former Disn...",
            "After years of speculation, French striker Kylian Mbappé has informed Paris Saint-Germain that he will join Real Madrid when his contract expires at the end of...",
            "Pasangan musisi Tri Suaka & Nabila Maharani sedang berbahagia. Mereka baru saja dikaruniai anak pertama yang punya nama yang gagah, Muhammad Garuda Suaka. Nabil...",
            "Sterling K. Brown, who received an Oscar nomination for best actor in a supporting role for his turn as Clifford Ellison in “American Fiction,” doesn’t th...",
            "Kanye West, 46, got a lot of attention on Friday, when he showed up to his son Saint‘s basketball game wearing a white hockey mask. The rapper was photographe...",
            "Posted in: Disney+, Star Wars, TV | Tagged: ahmed best, carl weathers, disney, giancarlo esposito, katee sackhoff, mark hamill, ming-na wen, Pedro Pascal, Rober...",
            "Peaks of Yore Update v1.4.5a-TENOKE Posted on Feb 4th, 2024 at 0:35 am in Games PC by OMEGA Read changelog.txt for information on updated content! Genre: Action...",
            "Northgard Update v3.3.16.36367-TENOKE Posted on Feb 4th, 2024 at 0:35 am in Games PC by OMEGA Genre: Indie, Simulation, Strategy\n\nDeveloper: Shiro Games\n\nPublis...",
            "Heretics Fork Update v1.0.7-TENOKE Posted on Feb 4th, 2024 at 0:34 am in Games PC by OMEGA Read changelog.txt for information on updated content! Genre: Action,...",
            "Dungeons of Sundaria Update v1.0.0.53644-TENOKE Posted on Feb 4th, 2024 at 0:34 am in Games PC by OMEGA Read changelog.txt for information on updated content! G...",
            "Erin Moriarty returned to social media to show her appreciation to her fans amid Megyn Kelly‘s harsh criticism.\n\nThe former Fox News anchor accused The Boys s...",
            "Brick Rigs Update v1.6.3-TENOKE Posted on Feb 4th, 2024 at 0:34 am in Games PC by OMEGA Read changelog.txt for information on updated content! Genre: Simulation...",
            "Click to email a link to a friend (Opens in new window)\n\nClick to share on Twitter (Opens in new window)\n\nClick to share on Facebook (Opens in new window)\n\nIt w...",
            "Fans attending Madonna’s The Celebration Tour stop in Chicago Friday night (Feb. 2) got to hear something the Queen of Pop has never done before: perform her ...",
            "We can all breathe a sigh of relief—the Japanese Embassy has assured us that Taylor Swift will not have to miss seeing Travis Kelce play at the Super Bowl. Si...",
            "In his popular “New Rules” segment on this weekend’s “Real Time,” Bill Maher went after materialism in modern music.\n\n“If you want to know why your ...",
            "Emma Gatrill’s new album, Come Swim, has the most interesting genesis. It’s one thing to start a new record by asking friends to provide drum loops and beat...",
            "Fans of Disney’s Grand Californian Hotel & Spa have reason to celebrate, as new merchandise dedicated to the Disneyland resort has been released.\n\nChip ‘n?...",
            "Bossip Video\n\nThis Grammy event was a true VIBE!\n\nSome of our BOSSIP editors are currently on the ground in LA for Grammy Weekend and they tell us one of the be...",
            "Here’s how to be more supportive for someone who’s depressed.\n\nDepression is a multifaceted mental health condition that affects millions worldwide. Its cau...",
            "The UNC Tar Heels are perhaps at the top of the list of priority when it comes to crafting Jordan footwear Player Exclusives for its athletes. With Michael Jord...",
            "The IFM RAW YouTube channel has uploaded video of STATIC-X's February 2 concert at the Orlando Amphitheater in Orlando, Florida. Check out the clips below.\n\nAlt...",
            "Your name Gender Gender Male Female Other Enby TransFem TransMasc\n\nEmail\n\nRemaining characters: 320\n\nYour story must start with “Today,” and end with “FML...",
            "Career\n\nTechnology by Daniel Johnson San Francisco Encourages HBCUs To Open Satellite Campuses In City’s Vacant Buildings Breed says the initiative will not o...",
            "/l;p[-0OMG this is both so ballsy, funny, alarming, and goodness the biggest news of C-ent this weekend. A small budget C-drama titled The Spirealm (what an awf...",
            "+ 17\n\nHouses • Izmir, Turkey Architects: Ofisvesaire\n\nYear: 2022\n\nPhotographs: Kadir Asnaz\n\nAlumil Adriani E Rossi , Atlas Plan , BANG & OLUFSEN , Casa , Fosc...",
            "Special Ops Crime Squad UK S03E04 1080p WEB h264-CODSWALLOP Posted on Feb 4th, 2024 at 0:28 am in TV Shows by Robotnico Season 3, Episode 04 –\n\nRaw footage an...",
            "Season 3, Episode 05 –\n\nThere’s truly life-changing money on offer as Ant & Dec try to help more contestants climb as high up the never-ending money ladder ...",
            "The Rock may be cooking in the WWE once again ... but some fans aren't super happy about it -- 'cause it seems his return has knocked a major storyline off trac...",
            "Cult movies can stretch across any genre and the list of films now streaming on Max this month prove that. These entries, each a cult classic in its own right, ...",
            "“He is off the streets right now and in the jail and he shouldn’t be let out. … How many people have we seen perform murders in this town that are on elec...",
            "Ben Cousins will be swapping his footy boots for Cuban heels on the new season of Dancing With the Stars.\n\nThe AFL premiership player and 7NEWS Perth sport pres...",
            "In a feud that has now comfortably eclipsed, in lifespan, not just the original Charmed series, but a whole other one that came and went in the two decades and ...",
            "Justin Timberlake is under the weather but still hard at work promoting his new song “Selfish.”\n\nThe pop star posted a video of himself performing an acoust...",
            "The 2024 Grammy is set to take place this weekend, and five Nigerian artists have been nominated in four categories\n\nOne of the most renowned names nominated fo...",
            "Japanese metalcore band Crossfaith has announced they have parted ways with bassist Hiroki Ikegawa. The news came in a press release where they thanked him and ...",
            "During NAMM Show, the No Treble team was blessed to be able to come together and break bread together. It was a wonderful weekend of education and stimulation, ...",
            "Cortex Bass attended the 2024 NAMM Show in part to introduce the latest in its lineup. The Ganesha Bass, the company says, was designed to “suit all players ?...",
            "Melvins mastermind King Buzzo (aka Buzz Osborne) and Mr. Bungle bassist Trevor Dunn are teaming up this summer for a duo tour of the U.S. Kicking off on August ...",
            "YYNOT’s annual Bubba Bash took place on January 6th at the Keswick Theatre in Glenside, Pennsylvania to benefit Cedars-Sinai Hospital in memory of late Rush d...",
            "Darkglass Electronics has expanded their lineup of bass amps with four new combos this year including two analog models and two digital models. Each amp type ha...",
            "The Los Angeles Opera opens its 2024-25 season Sept. 21 with Puccini’s “Madama Butterfly” reimagined in a film studio and will present the company premier...",
            "A TikToker who first began posting on the popular social app TikTok in 2022 has consistently earned over 40,000 views on her videos– often short close-up vide...",
            "Just when you thought Marc Jacob's towering Kiki boots couldn't get better, the eponymous label presents us with its Kiki \"Timbs.\"\n\nMarc Jacobs debuted its new ...",
            "Black small businesses are now facing multiple headwinds amid trying to grow their enterprises.\n\nThe top challenges for those entrepreneurs heading into 2024 ar...",
            "27 SHARES Facebook Twitter\n\nIt’s fair to say, at this point, we have a basic idea of what filmmaker Matthew Vaughn intends for “Kick-Ass 3,” or a continua...",
            "As one of the K-Pop idols who’ve been in the industry for over twenty years, Kim Jaejoong has seen plenty of celebrities. Two in particular left him stunned b...",
            "Love Island: All Stars fans think they've uncovered 'the real reason' Georgia Harrison was seen crying during Thursday night's recoupling - and it wasn't Anton'..."
        ]
    },
    {
        "date": "2024-02-04",
        "most-common-noun": "Grammys",
        "frequency": 28,
        "snippets": [
            "Miley Cyrus put an edgy spin on country glamour for the 2024 Grammys.\n\nThe pop star walked the red carpet at Los Angeles’s Crypto.com Arena tonight in a golde...",
            "Taylor Swift has been in the music business for more than a decade, so it’s understandable to assume that the singer-songwriter is bathing in Grammys on Gramm...",
            "Watch : Miley Cyrus REACTS to Rumors About Her Song \"Flowers\"\n\nMiley Cyrus proved she can hold her own hand at the 2024 Grammys. The singer glowed as she walked...",
            "Watch : Miley Cyrus REACTS to Rumors About Her Song \"Flowers\"\n\nMiley Cyrus proved she can hold her own hand at the 2024 Grammys. The singer glowed as she walked...",
            "Watch : Miley Cyrus REACTS to Rumors About Her Song \"Flowers\"\n\nMiley Cyrus proved she can hold her own hand at the 2024 Grammys. The singer glowed as she walked...",
            "Photo: Photo by Amy Sussman/Getty Images\n\nFew of us want to see Dave Chappelle win yet another award, including singer Rufus Wainwright. During the Grammys Prem...",
            "Watch : 2024 Grammys Preview: Predicting the Biggest Winners!\n\nYou know Kandi Burruss, she's all about the girl power. And with great power comes great ability ...",
            "Watch : 2024 Grammys Preview: Predicting the Biggest Winners!\n\nYou know Kandi Burruss, she's all about the girl power. And with great power comes great ability ...",
            "Watch : 2024 Grammys Preview: Predicting the Biggest Winners!\n\nYou know Kandi Burruss, she's all about the girl power. And with great power comes great ability ...",
            "SZA has won Best Progressive R&B Album, for SOS, at the 2024 Grammy Awards. The singer and songwriter, who was nominated for a pack-leading nine Grammys this ye...",
            "Kandi Burruss is putting herself on pause.\n\nThe Xscape singer revealed on Sunday's 2024 Grammys that she won't be returning to The Real Housewives of Atlanta fo...",
            "THE TIMES OF INDIA | Feb 05, 2024, 06:13:28 IST Share Follow us\n\nLIVE NOW\n\nGrammys Awards 2024 LIVE Updates: Billie Eilish wins Best Song Written\n\nThe 2024 Gram...",
            "Top pop girl Dua Lipa has arrived on the 2024 Grammys red carpet looking as shiny as a disco ball—or maybe like the glimmering trophy she could take home toni...",
            "Killer Mike has picked up all three of the 2024 Grammys for which his critically acclaimed album MICHAEL was nominated, while J. Cole & Lil Durk have also nabbe...",
            "Joni Mitchell has reflected on her surprise appearance at Newport Folk Festival 2022 at the 2024 Grammys.\n\nThe annual awards ceremony is taking place in Los Ang...",
            "It’s Grammys night which means a night full of fashion looks that simply do not miss. Already kicking off the hottest looks at the 66th Annual Grammy Awards, ...",
            "Zach Bryan and girlfriend Brianna “Chickenfry” LaPaglia heated up the 2024 Grammys red carpet.\n\nThe couple arrived at the Crypto.com Arena in Los Angeles, o...",
            "Musical trio Boygenius have taken home their first Grammys after being nominated in several categories for 2024. The band composed of Julien Baker, Phoebe Bridg...",
            "It's time for music's biggest event! The industry's biggest stars will be walking onto the Grammys red carpet. Watch the awards pre-show to see the best looks o...",
            "The 2024 Grammys are here, as music’s biggest night returns and puts some of the most significant forces in the world of pop culture in competition with one a...",
            "Award-show season is in full swing, and tonight is music's big night—the Grammys. The highly anticipated red carpet for fashion and music lovers alike is here...",
            "The Grammys red carpet stands as an iconic runway where musical luminaries and celebrities showcase their sartorial flair. It is an annual spectacle where fashi...",
            "Kat Graham showed up on the 2024 Grammys red carpet looking absolutely stunning and taking cut-outs to a whole new level in a dramatic white gown from Stephane ...",
            "Paris Jackson wowed in a sexy black gown, featuring a racy cutout, across her toned midriff, at the Grammys 2024 in Los Angeles, California on Sunday.\n\nFor the ...",
            "In a sea of events honoring acting during award season, the 2024 Grammys are a refreshing change of pace. It's a slightly different crowd, but just as jam-packe...",
            "The 2024 Grammys are just as nerve-wracking for musicians as it is for the team that makes the ceremony possible. Unfortunately, considering that it is music’...",
            "The 2024 Grammys are upon us. If, barely a month into 2024, you've already begun to experience a bit of Awards Season fatigue—what with the Golden Globes, res...",
            "Taylor Swift hasn’t even arrived to the Grammys yet, but she’s already hinting that more details on Reputation: Taylor’s Version will be announced tonight..."
        ]
    },
    {
        "date": "2024-02-05",
        "most-common-noun": "Monday",
        "frequency": 11,
        "snippets": [
            "Nearby cotton faded with 7 to 18 point losses on Monday, while the 21 to 34 point gains for new crop. The Mar-Dec spread tightened to 491 points at the close. T...",
            "Monday’s session started lower though the bull made a stand and ended the session fractionally mixed to 1 ¼ cents higher. The new crop contracts were firmer ...",
            "Front month soybean futures ended the Monday session with 5 ¼ to 7 ¾ cent losses. Soymeal futures closed with $2.40 to $4.30 gains. Soy oil futures closed wit...",
            "A National Labor Relations Board (NLRB) regional official ruled on Monday that basketball players at Dartmouth College are considered school employees, and can ...",
            "U.S. bonds on Monday extended a rout sparked last week by strong economic data and pushback from the Federal Reserve on the potential timing and magnitude of in...",
            "NEW YORK -- Gap Inc. has tapped American fashion designer Zac Posen as the chain's creative director.\n\nThe hire announced on Monday is among the first big perso...",
            "Shares of Chegg Inc. were down after hours on Monday, after the education-technology platform forecast first-quarter sales that were below expectations and said...",
            "Virgin Galactic Holdings Inc. said late Monday that an alignment pin became detached from a portion of the mothership-launching apparatus during a recent spacef...",
            "Natura & Co. executives to explore splitting Avon and Natura into two separate companies.\n\nNatura & Co. said late Monday that its executives are exploring split...",
            "For eight years, Craig Wright has claimed to be the elusive Bitcoin creator Satoshi Nakamoto. On Monday, in the swelling heat of a UK courtroom, a trial began t...",
            "The Biden administration announced Monday it is rolling out a new policy that will allow it to impose visa restrictions on foreign individuals involved in the m..."
        ]
    },
    {
        "date": "2024-02-06",
        "most-common-noun": "Tuesday",
        "frequency": 12,
        "snippets": [
            "DIRECTV on Tuesday said it added three new The CW affiliates to its live-TV streaming service, DIRECTV STREAM.\n\nThe channels are KGCW-CW in Quad Cities, Iowa, W...",
            "A former top prosecutor for the city of Baltimore was convicted Tuesday on one count of mortgage fraud, concluding a lengthy criminal trial in which Marilyn Mos...",
            "Toyota announced Tuesday the automaker is pouring another $1.3 billion into its flagship Georgetown, Kentucky, plant, where it will begin producing a new all-el...",
            "Fight disinformation: Sign up for the free Mother Jones Daily newsletter and follow the news that matters.\n\nOn Tuesday, House Republicans fell short of getting ...",
            "ESPN, Fox Corp. and Warner Bros. Discovery said on Tuesday they are joining forces to launch a streaming sports service.\n\nThe platform will include offerings fr...",
            "A federal appeals court on Tuesday unequivocally rejected former President Donald Trump’s absurd claim that he possesses total immunity to the federal electio...",
            "AP Photo/Alex Brandon, File\n\nThe House of Representatives voted on Tuesday against impeaching Department of Homeland Security Secretary Alejandro Mayorkas, endi...",
            "Solar inverter maker Enphase Energy said on Tuesday it expects inventory levels to normalize and demand for its products to pick up by the end of the second qua...",
            "Enphase Energy Inc. shares jumped more than 14% in the extended session Tuesday after the alternative-energy company presented investors with a mixed quarter, b...",
            "Shares of Yum China Holdings Inc. rallied after hours on Tuesday after the company, which runs KFC and Pizza Hut restaurants in China, said it planned to “sig...",
            "A crew member of Marvel Studios television series \" Wonder Man \", passed away on Tuesday, after falling from the rafters at Radford Studio Center just outside o...",
            "Fox, Walt Disney’s ESPN, and Warner Bros. Discovery said on Tuesday they were set to release a sports streaming platform later this year, in a bid to capture ..."
        ]
    },
    {
        "date": "2024-02-07",
        "most-common-noun": "s",
        "frequency": 12,
        "snippets": [
            "[Warning: Potentially Triggering Content]\n\nA New Hampshire man accused of beating his 5-year-old daughter to death in 2019 has pleaded guilty to two lesser char...",
            "Scouted selects products independently. If you purchase something from our posts, we may earn a small commission.\n\nJennifer Aniston’s birthday is Feb.11, and ...",
            "Elements Music & Arts Festival is returning with the heat this summer. The annual Forest Festival in Pennsylvania is back for the 7th edition and a stacked phas...",
            "Disney made a rather surprising announcement this week, revealing that it’s making a previously unmentioned sequel to its 2016 animated hit Moana. And when we...",
            "These three SMID-Cap stock picks will make you money over the long haul\n\nThere are small-cap funds, and there are mid-cap funds, and those invest in both. These...",
            "In 2024's fiscal ebb and flow, value stocks emerge as the savvy investor's beacon\n\nIn the face of persistent market challenges, savvy investors focus on value s...",
            "Elevate your investment portfolio with our curated list of flying car stocks\n\nAs we approach the start of a new era in transportation, the idea of flying cars m...",
            "Last September, U.S. health officials warned of an \"urgent priority\" facing Americans.\n\nThe Centers for Disease Control had issued a study that found 22 states ...",
            "When unexpected expenses pile up and the emergency fund runs dry, where can you turn for money during tough times? For many people, their biggest stash of savin...",
            "These trailblazers are crafting the future canvas of augmented and virtual realms\n\nIn the investment world, the interest in virtual reality (VR) and augmented r...",
            "A stock split is when a company decides to exchange its stock for more (and sometimes fewer) shares of its own stock, with the price per share adjusting so that...",
            "A Roth IRA is one of the best possible ways to invest for retirement, and in fact, many experts think it’s the single best retirement account to have. That’...",
            "Disney, Fox and Warner Bros. Discovery announced plans Tuesday to launch a new streaming service that could become the biggest single source of sports content f...",
            "Microsoft CEO Satya Nadella announced Wednesday that he’s doubling down on his commitment to train India’s youth in AI skills. He’s aiming high, too: The ...",
            "“The problems facing most cities pale in comparison to San Francisco,” Capital Economics wrote recently. When the pandemic hit, the once superstar city spir...",
            "The surging stock market has helped younger generations grow wealth faster than older generations, according to a new analysis by the New York Federal Reserve.\n...",
            "A cat owner revealed the reasons why no one wanted a cat, triggering quite the defensive storm on TikTok.\n\nThe owner said in a TikTok clip that she saw a cat wa...",
            "Amid concerns President Joe Biden may be hurting his chances in the 2024 election over third-party candidates, some Democrats are urging Biden to challenge inde...",
            "An embattled former executive of a New York real estate development firm was indicted Wednesday on charges he allegedly conspired in an $86.6 million fraud sche...",
            "Vanderpump Rules star Ariana Madix is feeling justified in her decision to cut ties with Tom Schwartz.\n\nOn Wednesday, February 7, Ariana, 38, commented on a @Qu...",
            "Get ready for more sequels and franchises from Disney. CEO Bob Iger said on the company’s Wednesday earnings call that its stable of studios will be leaning m...",
            "The Way Home is the Hallmark Channel’s first new original series in seven years, and, when its first season premiered last year, marked a major shift in genre...",
            "See the Seattle funk outfit on “Roller,” “Wet Leather” and more.\n\nSeattle’s own Polyrhythmics returned to KEXP studios in November 2023 to perform for...",
            "Disney this summer will roll out a paid password sharing plan on its Disney+ streaming flagship that CEO Bob Iger says was directly influenced by Netflix‘s su...",
            "Heat player Haywood Highsmith was involved in a car accident following Tuesday night's game in Miami ... a crash that reportedly left one man in critical condit...",
            "If you've been thinking about updating your home security system, Amazon just kicked off its Presidents' Day sale with solid savings on Blink video doorbells an...",
            "Notice: Transcripts are machine and human generated and lightly edited for accuracy. They may contain errors.\n\n• Now, right after Senate Republicans blocked t...",
            "In our news wrap Wednesday, a new wave of Russian missiles and drones struck six regions across Ukraine and killed at least five civilians, a pair of bombings i...",
            "Israeli Prime Minister Benjamin Netanyahu rejected a counterproposal from Hamas that would have paused the war in exchange for releasing Israeli hostages over t...",
            "Disney is investing $1.5 billion for a stake in Epic Games, CEO Bob Iger said Wednesday, in its biggest bet yet on the gaming space. The media giant will work w...",
            "Nelson Peltz, founder and chief executive officer of Trian Fund Management, during the Future Investment Initiative (FII) Institute Priority Summit in Miami, Fl...",
            "While police were pursuing and apprehending a man who climbed a Las Vegas Strip landmark, local, federal and NFL officials met with the media on Wednesday to ou...",
            "Shares of Confluent CFLT, rose late Wednesday after the data-streaming company forecast more than 20% revenue growth in 2024 and its first breakeven year based ...",
            "Warner Music Group Corp. is planning to lay off about 600 employees, or around 10% of its workforce, as part of a restructuring plan aimed at freeing up more ca...",
            "Hello, my name’s Madeline, and you may know me around these parts for being The Everygirl’s Fashion Editor. But a lesser-known fact is that over the past ye...",
            "Are you ready for it? Taylor Swift’s Eras Tour concert movie is about to be available to stream at home.\n\n“This week is truly the best kind of chaos. I’m ...",
            "She has been in the spotlight for the past three days for one after another scandal.\n\nRapper MEENOI’s recent whereabouts after she got entangled in a series o...",
            "While most NFL press conferences are about football, Travis Kelce has fielded quite a few questions about girlfriend Taylor Swift ahead of Super Bowl LVIII.\n\nKe...",
            "Abbott Elementary Adds a Queer Actor as a Recurring Character\n\nHappy Abbott Elementary Day to All Who Celebrate! School is finally back in session! (I’d make ...",
            "Ahead of the SXSW debut of her first solo feature Bob Trevino Likes It, filmmaker Tracie Laymon has taken on new management at Artists First.\n\nPremiering in Nar...",
            "Quote tweeting one of the leaked image posts, established leaker @MyTimeToShineH wrote a worrying message to \"Daredevil\" fans: \"Foggy dies, Karen lives.\" But be...",
            "Warner Music Group will lay off 10% of its worldwide workforce, about 600 people, CEO Robert Kyncl said in a memo released today.\n\nThe company’s artists inclu...",
            "Sport Disney, Fox & Warner Bros. Cook Up Ultimate Sports Streaming Service By Shubhendu Vatsa - News Copy Link Share Share this on Facebook Facebook X LinkedIn ...",
            "The difference between Netflix’s cheaper ad tier and its premium plans isn’t just in price — it’s also the amount of titles available for you to watch.\n...",
            "Tech N9ne is gearing up for his Kansas City Chiefs to play in the Super Bowl ... by hosting a party at a famous Las Vegas strip club across the street from the ...",
            "In recent years, it seems like K-Pop B-side tracks — the songs on albums that aren’t the title track — have been getting a lot more attention, and sometim...",
            "Street Artist Giulio Masieri\n\nBy Giulio Masieri in Pordenone, Italy.\n\nIl Friuli: “The project – explains Masieri – was born in the period of the lockdown....",
            "21 SHARES Facebook Twitter\n\nThe Walt Disney Company reported its first quarter earnings of 2024 on Wednesday, and Chief Executive Officer Bob Iger made several ...",
            "Hut 8 Corp., one of the largest publicly traded bitcoin mining companies, named Asher Genoot to succeed Jaime Leverton as chief executive, three weeks after a s...",
            "Listeria bacteria can contaminate many foods. When ingested, they are most harmful to people who are pregnant, people who are at least 65 years old or those who...",
            "BMW is launching its first all-electric luxury wagon, the i5 Touring, with up to 348 miles (560 km) WLTP range. The luxury BMW wagon is more advanced than ever....",
            "In a potential warning sign to investors, three high-flying stocks had key reversals on Tuesday.\n\nThis means the stocks opened to new highs before trading below...",
            "U.S. Central Command forces, alongside UK Armed Forces and with the support from Australia, Bahrain, Canada, Denmark, the Netherlands, and New Zealand launched ...",
            "In a new interview with Radioactive MikeZ, host of the 96.7 KCAL-FM program \"Wired In The Empire\", FEAR FACTORY guitarist Dino Cazares was asked which METALLICA...",
            "0 SHARES Share Tweet Pinterest Flipboard Pocket Whatsapp Mail\n\nNestled on the northeast shores of Scotland, Aberdeen is a pretty historic city to visit. Not onl...",
            "It has been a good year for Mattel, and the toy giant is looking to capitalize on the recent surge in enthusiasm to drive digital and direct-to-consumer (D2C) s...",
            "As Threads continues to gain momentum, with the platform now up to 130 million active users, more brands are also testing the waters, and seeing what sort of en...",
            "BridgeTower Media, which operates business newspapers across the country, had acquired ColoradoBiz for an undisclosed amount.\n\nFounded in 1973, ColoradoBiz is t...",
            "Guide: Prime Energy Drink Nutrition Facts\n\nUnveiling the nutritional profile of Prime Energy Drink is akin to taking a journey into the powerhouse of vitality.\n...",
            "EXCLUSIVE: Ahead of the SXSW debut of her first solo feature Bob Trevino Likes It, filmmaker Tracie Laymon has taken on new management at Artists First.\n\nPremie...",
            "This article was produced in collaboration with Court Watch, an independent outlet that unearths overlooked court records.\n\nA legitimate presenting security res...",
            "POPSUGAR Photography | Kyley Warren POPSUGAR Photography | Kyley Warren\n\nEvery editorial product is independently selected by our editors. If you buy something ...",
            "There are tons of markets that don't exist because people just don't want to allow a market – for whatever reason, people feel icky about putting a price on s...",
            "Posted in: Movies, Sony | Tagged: dakota johnson, Madame Web\n\nMadame Web: Dakota Johnson Stares into the Abyss of the Film Industry\n\nMadame Web star Dakota John...",
            "Our experts answer readers' credit card questions and write unbiased product reviews (here's how we assess credit cards). In some cases, we receive a commission...",
            "Our experts answer readers' credit card questions and write unbiased product reviews (here's how we assess credit cards). In some cases, we receive a commission...",
            "Our experts answer readers' credit card questions and write unbiased product reviews (here's how we assess credit cards). In some cases, we receive a commission...",
            "Our experts answer readers' credit card questions and write unbiased product reviews (here's how we assess credit cards). In some cases, we receive a commission...",
            "Ice Spice is starring in her very first Super Bowl commercial, taking center stage for Starry soda's ad spot for the big game.\n\nIce Spice Stars in Soda Ad for 2...",
            "Warner Music Group will lay off 10% of its worldwide workforce, about 600 people, CEO Robert Kyncl said in a memo released today.\n\nThe company’s artists inclu...",
            "Which NCIS vet will be caught up in a family feud? What’s “new” on Fire Country? Is the latest Walking Dead spinoff the ultimate love story? Read on for a...",
            "A video of an Apple Vision Pro user running into a WiFi pop-up “wall” had redditors calling the moment a “Black Mirror-like experience,” and speculating...",
            "Easter falls on March 31 this year, which is coming up sooner than you might realize. Even though we're on the brink of Valentine's Day, it's not too early to s...",
            "A 9-0 ruling against Colorado’s decision to banish Donald Trump from the ballot would be best for the country and the Court.\n\nThis story appeared on wsj.com ,...",
            "After killing the border bill, will Trump also kill aid to Ukraine?\n\nThis story appeared on wsj.com , 2024-02-07.",
            "The Ninth Circuit rebukes the bureau for a lawless search and seizure.\n\nThis story appeared on wsj.com , 2024-02-07.",
            "The NFL and NBA are digesting the details behind a new platform that looms over their businesses.\n\nThis story appeared on wsj.com , 2024-02-07.",
            "Trade judges reject new duties on tin-mill imports used in cans.\n\nThis story appeared on wsj.com , 2024-02-07.",
            "A new photo showing the current state of the burial place of the late Black Stars player Christian Atsu surfaces a year after his passing\n\nThe picture was share...",
            "North West is showing off her vocals in a brand new collaboration with her father, Kanye \"Ye\" West.\n\nIn a newly dropped video for \"Talking/Once Again,\" Kanye's ...",
            "Ghanaian American comedian Michael Blackson has thrown a jab at Nigerians after their AFCON 2023 semi-final victory.\n\nNigeria defeated South Africa in Bouake on...",
            "Hiya stranger, login to post links to music videos.You can subscribe to this site as RSS or on twitter"
        ]
    },
    {
        "date": "2024-02-08",
        "most-common-noun": "post",
        "frequency": 12,
        "snippets": [
            "Pinterest stock tumbled late Thursday after the social media site reported light fourth-quarter sales and issued disappointing guidance.\n\nThe post Pinterest Sto...",
            "Video game publisher Take-Two Interactive Software badly missed the mark with its guidance for the current quarter.\n\nThe post Video Game Publisher Take-Two Whif...",
            "Affirm reported a smaller-than-expected loss in the December quarter while revenue topped Wall Street targets.\n\nThe post Affirm Posts Better-Than-Expected Resul...",
            "CrowdStrike stock is surging to all-time highs on industry strength. Why the move could provide short-term appeal.\n\nThe post CRWD Stock Flashes This Aggressive ...",
            "Expedia stock broke out ahead of Q4 results. Earnings growth accelerated in the holiday quarter but other news hit the travel stock.\n\nThe post Expedia Stock Div...",
            "A strong holiday quarter helped the luxury retailer crush earnings views. China and direct-to-consumer sales drove the beat.\n\nThe post Ralph Lauren Scores A Bre...",
            "Cloudflare reported Q4 earnings and revenue that topped estimates while 2024 profit guidance for NET stock came in above views.\n\nThe post Cloudflare Earnings, R...",
            "Moderna stock fell after maintaining its 2024 outlook despite beating 2023 sales expectations. Is MRNA stock a buy or a sell right now?\n\nThe post Is Moderna Sto...",
            "Pfizer stock remains under pressure despite becoming one of the biggest names of the pandemic. Is PFE stock a sell?\n\nThe post Is Pfizer Stock A Sell After Two Y...",
            "Summit Materials Cl A shows improving price performance, earning an upgrade to its IBD Relative Strength Rating\n\nThe post Summit Materials Stock Builds Up Relat...",
            "Target shows rising price performance, earning an upgrade to its IBD Relative Strength Rating\n\nThe post Target Stock Sees Relative Strength Rating Rallying High...",
            "Emerson stock shows improving price performance, earning an upgrade to its IBD Relative Strength Rating from 63 to 84.\n\nThe post Emerson Stock Pops On Earnings ...",
            "Hiya stranger, login to post links to music videos.You can subscribe to this site as RSS or on twitter"
        ]
    },
    {
        "date": "2024-02-09",
        "most-common-noun": "s",
        "frequency": 7,
        "snippets": [
            "Maker and musician Oliver Hagen has designed a custom MIDI controller for the Roland JD-Xi synthesizer, the DivingBoard.\n\nThe Roland JD-Xi has a very powerful s...",
            "The Bear season 3 will premiere in June, with FX CEO John Landgraf saying he has “no doubt” it will continue its binge-release strategy.\n\nMake your reservat...",
            "Actor Scarlett Johansson and NFL legend Dan Marino come from different professions, but they have two things in common: Both have a sweet tooth and an infatuati...",
            "Vitalik Buterin, the co-founder of Ethereum, has recently introduced a groundbreaking solution to counteract the growing menace of deepfake technology. As artif...",
            "Hulu has dropped the official trailer for We Were The Lucky Ones, its upcoming limited series adaptation of Georgia Hunter’s bestselling novel.\n\nWe Were The L...",
            "EXCLUSIVE: I’m hearing that Oscar nominee and Avengers star Scarlett Johansson (Marriage Story) is set to lead true-crime thriller Featherwood, which is one o...",
            "While some on Wall Street and in Hollywood believe that Netflix has won the streaming wars, FX boss John Landgraf begs to differ.\n\n“I have always worried abou...",
            "Brad Pitt and Honoree Bradley Cooper pose with the Outstanding Performer of the Year Award during the 39th Annual Santa Barbara International Film Festival at T...",
            "“Malcolm in the Middle” star has buckled up for his NASCAR Xfinity series debut in an attempt to qualify for United Rentals 300 at Daytona International Spe...",
            "Release Description:\n\nDiscover various levels of danger while trying to escape the eerily familiar backrooms based on popular creepypasta lore.New and Unique Le...",
            "Posted on Feb 10th, 2024 at 1:28 am in Movies Old by Damon\n\nNominated for 1 Oscar 12 wins & 28 nominations total See more awards »\n\nPlot: A young and parentles...",
            "Israel’s prolonged war with Hamas is going to become a significant economic and political burden for the country over the long haul, Moody’s said Friday. So...",
            "Ukrainian President Volodymyr Zelenskyy attends a flag-hoisting ceremony in Izium after the Ukrainian forces took control of the city from the Russian forces in...",
            "A new Charli XCX album is under way, and fans believe the singer has brought on a collaboration with Addison Rae.\n\nWhile promoting the lead single ‘Von Dutch,...",
            "Kylie Jenner’s Topless Selfie Has Kris Jenner “Quaking”\n\nKylie Jenner channels her mom Kris Jenner for her latest hair transformation, posting a topless p...",
            "TWICE THE FUN: As part of a “Dynamic Duo” themed event, the Project for Empty Space will honor Maria Grazia Chiuri, creative director of women’s haute cou...",
            "The appeal of buy now, pay later (BNPL) is undeniable.\n\nAnd the field is getting more crowded with FinTechs, and, more recently, banks. While the core value pro...",
            "Yeah, I’m not sure that this aligns with the key strengths of a real-time social discussion app.\n\nToday, Instagram chief Adam Mosseri has announced that both ...",
            "Welcome back, Deadline: Legal Newsletter readers. It was an epic week in legal history, centered on two cases that stem from the same poisonous root: a presiden...",
            "NFL Hall of Famer Emmitt Smith joins Morning Joe to discuss Super Bowl LVII. Smith also discusses teaming up with 'Ready to Rescue', a campaign raising awarenes...",
            "Spokesman for the White House Counsel's Office Ian Sams spoke to reporters at the start of the White House press briefing to address special counsel Robert Hur'...",
            "Sen. Rand Paul (R-KY) accused Senate Minority Leader Mitch McConnell (R-KY) of “criminal neglect” for emphasizing the need for aid to Ukraine, allegedly at ...",
            "In our news wrap Friday, President Biden met with German Chancellor Scholz to discuss new military aid for Ukraine, Vladimir Putin urged the U.S. to get Ukraine...",
            "Israeli Prime Minister Benjamin Netanyahu ordered the Israeli military to develop plans to evacuate Rafah, the southernmost city in Gaza. Its population before ...",
            "A long legal battle ended Thursday when a jury found that two conservative writers defamed the prominent climate scientist Michael Mann. William Brangham looks ...",
            "The New Orleans community is mourning the loss of a 17-year-old Palestinian American killed last month. Tawfic Abdel Jabbar is one of the 94 children, and 370 P...",
            "A new federal food assistance program is aiming to reduce child hunger by giving low-income families money for summer groceries. But only those who live in cert...",
            "[This is the four installment in a series about the oral argument in Trump v. Anderson. The first installment focused on Justice Gorsuch's colloquies about Offi...",
            "The company seems determined to do it again with another one of their productions, the live-action/animation hybrid “Coyote vs. Acme,” a comedy based on a N...",
            "Last year, John Oliver happily talked about George Santos getting kicked out of Congress and jokingly suggested that Santos should star in a Bravo TV show. Foll...",
            "One of the biggest headlines in NCAA Football last season was Deion Sanders taking over as the head coach of the Colorado Buffaloes. The start of his regime was...",
            "Super Bowl LVIII is Usher's show Usher — the chart-topping singer-songwriter — will be this year's halftime performer. With a catalog full of bangers, how w...",
            "The number of Mexican people entering the U.S. as families has grown significantly There's been a big surge in Mexican families fleeing cartel violence. They do...",
            "What are you up to this weekend? My friend is throwing herself a 44th birthday party, where everything is four-themed, including a four-tune teller. Curious wha...",
            "Sony has agreed to acquire half of Michael Jackson’s catalog from the star’s estate, in what is likely the richest transaction ever for a single musician's ...",
            "Billionaire has criticised Delaware, where brain implant company was previously incorporated, after pay package ruling\n\nThis story appeared on ft.com , .",
            "The age of apathy made for better company and less dangerous politics\n\nThis story appeared on ft.com , .",
            "TikTok is abuzz with the interiors trend — but it’s a style that has a long history\n\nThis story appeared on ft.com , .",
            "A moment of freedom from our serious selves is both joyful and therapeutic\n\nThis story appeared on ft.com , .",
            "House of Puff, a New York cannabis lifestyle, announced the introduction of The Spritz, its first THC-infused product.\n\nThis launch marks a pivotal expansion fo...",
            "Pandora has witnessed a remarkable surge of over 30% in the last 24 hours amid a broader market resurgence.\n\nThis increase can be attributed to recent announcem...",
            "As an emblem of modern Britain, the ailing King’s wife is a terrific fit\n\nThis story appeared on ft.com , .",
            "The 2024 XXL Freshman Class has not yet been announced, but that's not what the internet thinks.\n\nOn Feb. 4, a fake list began to make the rounds on social medi...",
            "How to watch the Super Bowl never used to be this complicated a question. And it’s especially tough if you haven’t watched one in years — or maybe never w...",
            "This is an edition of The Atlantic Daily, a newsletter that guides you through the biggest stories of the day, helps you discover new ideas, and recommends the ...",
            "The Sonic the Hedgehog franchise is speeding towards Paramount+ this April. The streamer released a trailer for the debut season of Knuckles, the franchise’s ...",
            "Developer Giorgio Sancristoforo – creator of Bento, Berna3, Gleetchlab and other music software – has introduced Full Blotter, described as a ‘very large ...",
            "Khan-linked Candidates Stun By Outperforming In Pakistan Election Against Military-Backed Nawaz Sharif\n\n\n\nResults which have continued to come in through late F...",
            "Up Next Dwayne 'The Rock' Johnson Shares 'Exciting' Details About Live-Action 'Moana' (Exclusive)",
            "The hugely successful Conjuring Universe is getting a brand new installment with The Conjuring 4, and THR reports tonight that Michael Chaves is on board to dir...",
            "Brian May admitted that he still finds the \\\"Bohemian Rhapsody\\\" riff hard to play, describing it as something \\\"a guitarist wouldn't naturally play\\\" and which...",
            "Release Description:\n\nThe game is in the year 3055, when AI robots have taken over the world. The human race is on the brink of extinction. Will Captain Miles f...",
            "Posted in: Batman, Comics, Comics Publishers, Current News, DC Comics | Tagged: Batman #142, Batman #143, chip zdarsky, joker\n\nA Look At The Joker's Past And Fu...",
            "While some on Wall Street and in Hollywood believe that Netflix has won the streaming wars, FX boss John Landgraf begs to differ.\n\n“I have always worried abou...",
            "Release Description:\n\nIn this innovative simulation game, you'll step into the role of a VTuber studio manager, navigating through the endless possibilities of ...",
            "Release Description:\n\nEmbark on a 3D rolling journey with \"Just Roll\", an indie game developed with passion using Unreal Engine. Navigate through intricate maze...",
            "JAY-Z has struck a Migos-like deal for his company Roc Nation, with the entertainment powerhouse set to team up with Versace.\n\nIn a series of Instagram posts on...",
            "We all know it: There’s nothing like a TV show ending on a high note. It’s exactly what FX’s Reservation Dogs did last year when it wrapped its run with a...",
            "The dYdX Foundation announced it has successfully secured $30 million in DYDX tokens from the dYdX Chain Community Treasury, following a community vote where 98...",
            "FX‘s John Landgraf is not sure the media ecosystem supports television shows that run beyond just a few seasons.\n\n“I think our attention spans have declined...",
            "Learn More\n\nWarner Bros Killed Coyote Vs. Acme And Twitter Is Furious At One Person\n\nIt looks like another one bites the dust at Warner Bros. Discovery. Thanks ...",
            "There’s about to be a new king of the stock-market jungle.\n\nMicrosoft Corp. is set to become the most highly valued U.S. company ever, surpassing the record m...",
            "The cause of the outbreak aboard the Queen Victoria Cruise is currently unknown.\n\nAn illness outbreak aboard a Cunard Cruise Line ship has spread, now leaving a...",
            "Entertainment News International (ENI) is the #1 popular culture network for adult fans all around the world.\n\nGet the scoop on all the popular comics, games, m...",
            "Songs about love, protest, and revolution\n\n3:43 PM Subscribe February 9, 2024\n\nIn time for Valentines Day: what are your favorite songs, especially ones that ha...",
            "Classic ANGEL bass player Felix Robinson will reunite with original ANGEL members Punky Meadows and Frank Dimino for five shows in April. Rounding out the group...",
            "Key Takeaways\n\nThe podcast episode delves into the intricate world of Bitcoin asset management and its implications for institutional investors, particularly pe...",
            "“Malcolm in the Middle” star has buckled up for his NASCAR Xfinity series debut in an attempt to qualify for United Rentals 300 at Daytona International Spe...",
            "New Line’s The Conjuring movie series is coming back for one last ride. Or one last rite, as it were.\n\nThe project, operating currently under the simple title...",
            "FX CEO John Landgraf celebrated his 20th year at the now Disney-owned network Friday at the Television Critics Association’s winter press tour by saying “ad...",
            "CNN’s Jake Tapper questioned Rep. Robert Garcia (D-CA) about President Joe Biden’s mental acuity on Friday, a day after the special counsel investigating Bi...",
            "Farmers in Italy, Spain and Poland demonstrated Friday as part of ongoing protests against European Union farming policies and to demand measures to combat prod...",
            "\"E-bikes are the most promising equitable climate solution in the transportation space that we have seen,\" says Melinda Hanson, the cofounder of the Equitable C...",
            "More than a million Palestinians are currently sheltering in Rafah, a city in southern Gaza that has become a refuge of last resort within the territory. This w...",
            "(Image credit: H&M)\n\nWho has time to scroll through 925 new arrivals? Well, I do. Curating shopping lists is part of my job, and it's a service to our readers t...",
            "Uproxx doesn’t really do cruises. Full respect to those who do, but the thought of being stuck in the middle of the ocean with thousands of strangers while pl...",
            "Arm Holdings ADR sees its Relative Strength Rating enter the elite 90-plus level.\n\nThe post Arm Holdings Stock Clears Technical Benchmark, Hits 90-Plus RS Ratin...",
            "Amicus Therapeutics shows rising price performance, earning an upgrade to its IBD Relative Strength Rating\n\nThe post Amicus Therapeutics Stock Sees Improved Rel...",
            "Vista Outdoor shows improving price performance, earning an upgrade to its IBD Relative Strength Rating\n\nThe post Vista Outdoor Sees Relative Strength Rating Ge...",
            "Five AI stocks to watch this week near buy points.\n\nThe post AI Stocks Braze, Sprout Social Break Out, Three Others Near Buy Points, Including Cathie Wood Favor...",
            "Shares of Expedia Group closed down 18% on Friday, their biggest single-day drop in nearly four years, after the online travel firm said it expected 2024 revenu...",
            "Sitting through Superman IV: The Quest for Peace was a pain in the ass for people in the audience, but Jon Cryer says we don’t know shit about crack ache.\n\nLo...",
            "With Presidents' Day just around the corner, now is the perfect time to kick off your furniture shopping spree. The holiday is known for offering some of the bi...",
            "Photo-Illustration: by The Cut; Photo: BFA, Courtesy of Vestiaire Collective, High Snob Society’s Visual Director\n\nIt’s New York Fashion week, so everywhere...",
            "Since first debuting in 2011, the Pagani Huayra has stood as one of the most extreme and high-performance hypercars that money can buy, with very few other vehi...",
            "Used on some level in watchmaking since the ‘70s, titanium has become significantly more prevalent as a case material over the past few years, in large part t...",
            "From sweet romance in the countryside to messy high school love, the BL fandom was blessed with boatloads of new BLs in 2023. We got storylines with traveling b...",
            "Brian Eno is one of those highly influential musicians who managed to push boundaries and achieve mainstream success while staying true to himself. As one of th...",
            "Legislation underpinning a plan to relocate the NBA’s Washington Wizards and NHL’s Washington Capitals across the Potomac River to northern Virginia easily ...",
            "Wall Street closed out its latest winning week with another milestone, the S&P 500’s first close above 5,000.\n\nThe benchmark index rose 0.6%, marking its 14th...",
            "Actor Scarlett Johansson and NFL legend Dan Marino come from different professions, but they have two things in common: Both have a sweet tooth and an infatuati...",
            "The Dartmouth men’s basketball team has scheduled a March 5 election to determine whether the players will unionize – a step that would be unprecedented in ...",
            "Stocks held near record levels on Wall Street as evidence kept piling up to show the job market remains remarkably solid.\n\nThe S&P 500 edged up 0.1% Thursday, j...",
            "Benchmark U.S. crude oil for March delivery rose 62 cents to $76.84 per barrel Friday. Brent crude for April delivery rose 56 cents to $82.19 per barrel.\n\nWhole..."
        ]
    },
    {
        "date": "2024-02-10",
        "most-common-noun": "Feb",
        "frequency": 12,
        "snippets": [
            "Jesse Watters Primetime 2024.02.09 Web-DL H264-DonJuan Posted on Feb 11th, 2024 at 1:29 am in TV Shows by Lisa Links: HOMEPAGE – TVDB Jesse.Watters.Primetime....",
            "Hannity 2024.02.09 Web-DL H264-DonJuan Posted on Feb 11th, 2024 at 1:29 am in TV Shows by Lisa Links: HOMEPAGE – TVDB Hannity.2024.02.09.Web-DL.AAC2.0.H264-Do...",
            "Gutfeld 2024.02.09 Web-DL H264-DonJuan Posted on Feb 11th, 2024 at 1:29 am in TV Shows by Lisa Links: HOMEPAGE – TV.com Gutfeld.2024.02.09.Web-DL.AAC2.0.H264-...",
            "Fox News At Night 2024.02.09 Web-DL H264-DonJuan Posted on Feb 11th, 2024 at 1:29 am in TV Shows by Lisa Links: HOMEPAGE – TVDB Fox.News.At.Night.2024.02.09.W...",
            "The Five 2011 2024.02.09 Web-DL H264-DonJuan Posted on Feb 11th, 2024 at 1:29 am in TV Shows by Lisa Links: HOMEPAGE – TVDB The.Five.2011.2024.02.09.Web-DL.AA...",
            "The Ingraham Angle 2024.02.09 Web-DL H264-DonJuan Posted on Feb 11th, 2024 at 1:28 am in TV Shows by Lisa Links: HOMEPAGE – TVDB The.Ingraham.Angle.2024.02.09...",
            "Posted on Feb 11th, 2024 at 1:26 am in Games PC by OMEGA\n\nRelease Description:\n\nIn this expansion, the missions are progression-based, not arenas. Loot and craf...",
            "The February 10th festival showcased a blend of winter sports, art, and culture\n\nSALT LAKE CITY, Feb. 10, 2024 /PRNewswire/ -- Today, joyfully marked the commen...",
            "Nickelodeon All-Star Brawl 2 Update v1.5.0-TENOKE Posted on Feb 11th, 2024 at 0:51 am in Games PC by OMEGA Read changelog.txt for information on updated content...",
            "1 of 3 | Cher has been nominated for induction into the Rock and Roll Hall of Fame. File Photo by Chris Chew/UPI | License Photo\n\nFeb. 10 (UPI) -- Cher, Lenny K...",
            "Spirit Of The Island Complete Edition Update v3.0.2.1-TENOKE Posted on Feb 11th, 2024 at 0:48 am in Games PC by OMEGA Read changelog.txt for information on upda...",
            "Wylde Flowers Update v20240209-TENOKE Posted on Feb 11th, 2024 at 0:48 am in Games PC by OMEGA Genre: Adventure, Simulation\n\nDeveloper: Studio Drydock Pty Ltd\n\n...",
            "Peaks of Yore Update v1.4.7b1-TENOKE Posted on Feb 11th, 2024 at 0:48 am in Games PC by OMEGA Read changelog.txt for information on updated content! Genre: Acti...",
            "Kingdom Rush Vengeance Hammerhold Campaign Update v1.15.7.6-TENOKE Posted on Feb 11th, 2024 at 0:48 am in Games PC by OMEGA Genre: Indie, Strategy\n\nDeveloper: I..."
        ]
    },
    {
        "date": "2024-02-11",
        "most-common-noun": "Super",
        "frequency": 50,
        "snippets": [
            "Reba McEntire brought her patriotic spirit to the Super Bowl.\n\nAhead of Sunday's big game at Allegiant Stadium in Las Vegas where the Kansas City Chiefs are fac...",
            "It Was Earth All Along In The Kingdom Of The Planet Of The Apes Super Bowl Trailer\n\nIf you hate every chimp you see, from chimpan-A to chimpan-Z, then you'll de...",
            "Watch : Get to Know Usher's Family Before He Takes the Stage at the Super Bowl\n\nPost Malone and Andra Day deserve congratulations for their 2024 Super Bowl perf...",
            "Since he won his first Super Bowl in 2002, NFL fans have wanted to know about Tom Brady’s net worth and how that changed after his retirement and his divorce ...",
            "Watch : Taylor Swift Made it to the 2024 Super Bowl\n\nKristin Juszczyk is going above and beyond her support of husband Kyle Juszczyk.\n\nIn fact, the fashion desi...",
            "A new Kingdom of the Planet of the Apes trailer dropped during the Super Bowl, showing off the latest installment in the Planet of the Apes franchise. The film ...",
            "A new “Kingdom of the Planet of the Apes” trailer was teased during the Super Bowl on Sunday, and you can watch the full video above. The latest entry in th...",
            "Taylor Swift and Blake Lively are enjoying Super Bowl LVIII! As Post Malone wowed the Las Vegas crowd with an acoustic performance of \"America the Beautiful,\" t...",
            "Fans of the ‘Deadpool’ movie franchise were treated to the first trailer of the third installment, titled “Deadpool & Wolverine” during Super Bowl 58.\n\n...",
            "Marvel Studios wasted no time debuting the first Deadpool 3 Deadpool & Wolverine trailer right at the beginning of the Super Bowl broadcast.\n\nAnnounced back in ...",
            "Super Bowl LVIII is officially underway, and Reba McEntire helped kick things off on Sunday (Feb. 11) with a heartfelt performance of “The Star-Spangled Banne...",
            "Musical theater fans scored a personal touchdown during Sunday’s Super Bowl with a surprise drop of the first trailer for Universal’s upcoming Wicked movie....",
            "During the Super Bowl, the first Wicked: Part One trailer was released, previewing the first part of the iconic musical‘s movie adaptation. The film is set to...",
            "Before Super Bowl LVIII got underway on Sunday, Reba McEntire took to the field to perform an emotional National Anthem.\n\nThe Country Music Hall of Famer brough...",
            "Deadpool is going to need a little help from his friends to survive in the multiverse. The Super Bowl trailer revealed the first footage and a new title for Dea...",
            "Post Malone helped kick off Super Bowl LVIII in Las Vegas on Sunday with an acoustic rendition of “America the Beautiful.”\n\nThe singer, wearing blue jeans a...",
            "Cynthia Erivo And Ariana Grande Defy Gravity In The Stunning Wicked Super Bowl Trailer\n\nHollywood has been wanting to turn Stephen Schwartz's smash hit musical ...",
            "Universal released a Super Bowl ad on Sunday for David Leitch’s thriller, which features multiple action sequences, aliens and space cowboys. In one scene, Go...",
            "Andra Day delivered a rousing performance of “Lift Every Voice and Sing” on Sunday ahead of Super Bowl LVIII.\n\nThe Grammy winner and past Oscar nominee took...",
            "Get ready, Ariana Grande fans and Broadway lovers. Universal unveiled the first trailer for “Wicked: Part One” during Super Bowl LVIII on Sunday, giving the...",
            "Reba McEntire is the latest in a long line of country music stars who have had the honor of singing the National Anthem before the Super Bowl. After memorable p...",
            "Despite any doubts that Taylor Swift would attend Super Bowl LVIII, the pop star made it to to support her boyfriend, Kansas City Chiefs tight end Travis Kelce,...",
            "Get ready, Ariana Grande fans and Broadway lovers. Universal unveiled the first trailer for “Wicked: Part One” during Super Bowl LVIII on Sunday, giving the...",
            "Learn More 5 Super Bowl Commercials That Were Banned For Being Too Steamy Companies shell out big bucks to have their commercials shown during the Super Bowl. H...",
            "At long last, the Super Bowl spot for Wicked: Part One finally gives us a new look at Oz. Jon M. Chu’s cinematic musical adaptation stars Ariana Grande and Cy...",
            "Post Malone kicked off the 2024 Super Bowl festivities with an impassioned performance of “America the Beautiful” at Allegiant Stadium in Paradise, Nevada.\n...",
            "CNN —\n\nReba McEntire, Andra Day and Post Malone kicked off America’s unofficial holiday with entertainment ahead of Super Bowl LVIII.\n\nCountry star McEntire...",
            "Both Super Bowl opponents may wear red, but all we can see is green.\n\nOn Sunday, during the 2024 Super Bowl broadcast, Universal dropped the first trailer for W...",
            "Post Malone is posted up (heh) at the Super Bowl, and performed an acoustic version of \"America the Beautiful\" ahead of the game. And while the camera mostly st...",
            "The first Deadpool 3 trailer appeared during a Super Bowl LVIII commercial break, revealing a closer look at Wade Wilson’s foray into the Marvel Cinematic Uni...",
            "Watch : Most Unforgettable Super Bowl Halftime Shows of All Time\n\nReba McEntire has made her Super Bowl debut.\n\nAnd this single mom who works two jobs delivered...",
            "Watch : Most Unforgettable Super Bowl Halftime Shows of All Time\n\nReba McEntire has made her Super Bowl debut.\n\nAnd this single mom who works two jobs delivered...",
            "Post Malone honored the country at Super Bowl 2024 — and Taylor Swift and BFF Blake Lively were swaying in appreciation!\n\nAhead of the big game against the Sa...",
            "Ryan Gosling‘s stuntman-bounty hunter in “The Fall Guy” is apparently a Swiftie.\n\nUniversal released a Super Bowl ad on Sunday for David Leitch’s thrill...",
            "Celebrities flocked to Las Vegas to attend the Super Bowl LVIII between the Kansas City Chiefs and the San Francisco 49ers on Sunday.\n\nTaylor Swift, who was in ...",
            "Despite suffering defeat in the final of the African Cup of Nations (AFCON), Super Eagles captain William Troost-Ekong got special recognition\n\nEkong was declar...",
            "Post Malone at the Super Bowl!!\n\nCLICK HERE to watch the rapper sing America The Beautiful.\n\nHe was joined by actress and model Anjel Piñero, who signed the pe...",
            "Posted in: CBS, Sports, Super Bowl, TV, WWE | Tagged: super bowl, Wrestlemania, wwe\n\nWWE WrestleMania XL Teaser Spotlights Roman, Cody, The Rock & Seth\n\nRoman R...",
            "cbs sports\n\nChiefs’ Chris Jones is going through a lot of emotions going into the Super Bowl.\n\nJust days before the team’s big game, Jones spoke about the u...",
            "Post Malone performed at the Super Bowl 2024 in Las Vegas tonight (February 11), ahead of the game between the Kansas City Chiefs and the San Francisco 49ers.\n\n...",
            "Reba McEntire's soaring national anthem moves Super Bowl players to tears\n\nWhile the Super Bowl halftime show secures the biggest spotlight, the trio of pre-kic...",
            "Andra Day took the crowd even higher with her pregame performance.\n\nThe Grammy winner, 39, sang the hymn “Lift Every Voice and Sing” ahead of Super Bowl LVI...",
            "Ryan Reynolds' Merc With A Mouth Enters The MCU In The Deadpool And Wolverine Super Bowl Trailer\n\nCan Deadpool save the MCU? At one point, the Marvel Cinematic ...",
            "Reba McEntire, 68, wowed the crowd at Super Bowl LVIII in Las Vegas, NV when she performed an amazing rendition of the National Anthem. The country singer start..."
        ]
    },
    {
        "date": "2024-02-12",
        "most-common-noun": "Super",
        "frequency": 13,
        "snippets": [
            "Alicia Keys’ live performance at Super Bowl LVIII on Sunday might have had a rocky start, but the NFL has come to her rescue — by quietly Autotuning the Gra...",
            "Everyone's favorite bowl game of the year—the Puppy Bowl—returned for the 20th annual matchup on Sunday before Super Bowl LVIII kicked off, and this year's ...",
            "There’s been a lot of debate in recent months about how much Taylor Swift is too much Taylor Swift for an NFL broadcast, but there’s one high-profile Super ...",
            "How are ye, Wonkers? Did you get drunk on cheese dip in front of the Super Bowl? We did, probably, but we still eked out some stories on Monday.\n\nFirst it was t...",
            "About\n\nBeyoncé's Verizon Ad refers to a Super Bowl commercial from the telecommunication company Verizon featuring American singer Beyoncé. The ad, titled \"Ca...",
            "Usher is a married man.\n\nThe singer had a big day on Super Bowl Sunday. In addition to performing the halftime show, he also tied the knot with his longtime gir...",
            "Taylor Swift & Travis Kelce Pack on PDA at Super Bowl After-Party\n\nTaylor Swift and Travis Kelce's Super Bowl LVIII celebrations continue into the early hours w...",
            "There’s been a lot of debate in recent months about how much Taylor Swift is too much Taylor Swift for an NFL broadcast, but there’s one high-profile Super ...",
            "Fast fashion retailer Temu’s Super Bowl ads drew the ire of lawmakers in Congress over the China-based company’s links to products made with the use of forc...",
            "The online marketplace Temu's “Make Your Wishes Come True” Super Bowl LVIII spot was the most popular ad-related search term, according to an analysis of Go...",
            "Shutterstock image\n\niSpot: Super Bowl LVIII Multi-Media Viewership Up 10.9% to 126.6 Million\n\nErik Gruenwedel\n\nA lot of people watched and/or streamed Super Bow..."
        ]
    },
    {
        "date": "2024-02-13",
        "most-common-noun": "story",
        "frequency": 11,
        "snippets": [
            "Students discuss getting their news from major internet platforms ahead of the 2024 election.\n\nThis story appeared on wsj.com , 2024-02-13.",
            "Gas prices are in check, but nearly everything else related to your car is getting more expensive.\n\nThis story appeared on wsj.com , 2024-02-13.",
            "Committee chair Mike Gallagher has been sharp critic of Beijing and its regional influence\n\nThis story appeared on ft.com , .",
            "Records from the Nevada Secretary of State show that Elon Musk has reincorporated his brain implant company Neuralink in Nevada.\n\nThis story appeared on bizjour...",
            "Twenty-two Republicans vote to help allies and rebuild U.S. defenses. Will Speaker Mike Johnson now let the House work its will?\n\nThis story appeared on wsj.com...",
            "The Palestinian relief agency gets some very friendly reviewers.\n\nThis story appeared on wsj.com , 2024-02-13.",
            "Did he offer ‘detailed recollections,’ or was he a forgetful old man?\n\nThis story appeared on wsj.com , 2024-02-13.",
            "Consumer prices rise faster than expected, and stocks take a dive.\n\nThis story appeared on wsj.com , 2024-02-13.",
            "Jane Fonda didn’t hold back when giving Jennifer Lopez advice on documenting her love story with husband Ben Affleck.\n\nWhen Lopez, 54, first asked Fonda, 86, ...",
            "One of the world’s richest men discloses his latest sales as part of pre-planned disposal\n\nThis story appeared on ft.com , .",
            "Records from the Nevada Secretary of State show that Elon Musk has reincorporated his brain implant company Neuralink in Nevada.\n\nThis story appeared on bizjour..."
        ]
    },
    {
        "date": "2024-02-14",
        "most-common-noun": "Wednesday",
        "frequency": 9,
        "snippets": [
            "Sling TV’s free, ad-supported streaming service Freestream on Wednesday added another six channels this month, total 21 so far in February.\n\nThe new channels ...",
            "LONDON — Alastair McKimm on Wednesday took to Instagram to reveal that he is stepping down from his role as editor in chief of i-D, a day after the Karlie Klo...",
            "Political analyst Charlie Cook on Wednesday said he doesn’t expect President Joe Biden to win re-election in November, offering his forecast at a National Ass...",
            "CNBC's Jim Cramer on Wednesday said investors shouldn't be worried in this market, listing five bearish \"scares\" that he said are part of the normal market rhyt...",
            "Fastly Inc.’s stock dropped nearly 20% in the extended session Wednesday after the cloud-computing company showed Wall Street a mixed fourth quarter, with rev...",
            "A gambling proposal to authorize a lottery, sports betting, and multiple casinos across Alabama was swiftly advanced by a legislative committee on Wednesday.\n\nT...",
            "Kansas City Police Chief Stacey Graves said 22 people were shot -- including nine children -- after gunfire erupted Wednesday in downtown Kansas City, with poli...",
            "Ventas recorded a 4.1% rise in its fourth-quarter normalized funds from operations (FFO) on Wednesday, led by strong demand for its assisted living and senior h...",
            "Meta Platforms on Wednesday added Broadcom CEO Hock Tan to its board of directors, bringing on the head of a company known for its networking chips.\n\nBroadcom i..."
        ]
    },
    {
        "date": "2024-02-15",
        "most-common-noun": "Season",
        "frequency": 10,
        "snippets": [
            "In Say Yes to the Dress: Atlanta Season 9, the popular reality series continues to follow brides as they search for the dress that perfectly fits their vision a...",
            "Say Yes to the Dress: Atlanta Season 8 is the eighth chapter of the popular reality TV series. It continues to explore the world of dresses at Bridals by Lori, ...",
            "Season 5, Episode 03 – “Sand Job”\n\nIn the remote African country of Mauritania, our trio follow in the footsteps of the legendary Paris-Dakar rally. Inste...",
            "Season 5, Episode 03 – “Sand Job”\n\nIn the remote African country of Mauritania, our trio follow in the footsteps of the legendary Paris-Dakar rally. Inste...",
            "Say Yes to the Dress: Atlanta Season 7 is the seventh chapter of the popular reality TV series. It follows southern brides as they try to find their perfect wed...",
            "Young Sheldon S07E01 720p HDTV x264-SYNCOPY Posted on Feb 16th, 2024 at 1:26 am in TV Shows TOP by FOX Season 7, Episode 01 – “Half a Wiener Schnitzel and U...",
            "Extreme Airport Africa S01E06 720p WEB h264-CAFFEiNE Posted on Feb 16th, 2024 at 1:13 am in TV Shows by Robotnico Season 1, Episode 06 – “After the Storm”...",
            "Say Yes to the Dress: Atlanta Season 3 continues the reality TV series set in the nation’s largest full-service bridal salon, Bridals by Lori. It provides an ...",
            "Dimension 20 S21E06 720p WEB-DL x264-BFM Posted on Feb 16th, 2024 at 1:7 am in TV Shows by Lisa Season 21, Episode 06 – “Party Politics”\n\nThe party at Sea...",
            "Posted in: FX, Hulu, Preview, TV | Tagged: fx, fx networks, hulu, Season 6, what we do in the shadows, wwdits\n\nWhat We Do in the Shadows: Guillén, Novak Finall..."
        ]
    },
    {
        "date": "2024-02-16",
        "most-common-noun": "s",
        "frequency": 11,
        "snippets": [
            "“Morning Joe” cohost Mika Brzezinski monologued for nearly three minutes before punting to her panelists on Friday while discussing the “fiery” testimon...",
            "Click to email a link to a friend (Opens in new window)\n\nClick to share on Twitter (Opens in new window)\n\nClick to share on Facebook (Opens in new window)\n\nIs t...",
            "Now you can share!\n\nHTML for websites & blogs\n\nBBCode for forums\n\n[url=https://www.kicktraq.com/projects/mikewolfer/widow-unleashed-7-and-8/][img]https://www.ki...",
            "An Optimists Guide to the Planet S01E02 1080p WEB H264-JaimeLannister Posted on Feb 17th, 2024 at 1:28 am in TV Shows by Lisa Season 1, Episode 02 –\n\nShelter ...",
            "Investment asset management firm VanEck has taken a strategic step by submitting its S1-A form for its proposed spot Ethereum ETF.\n\nGrowing Pivot Towards Spot E...",
            "“I’m not ready for my son to become a martyr.” Alexey Navalny’s mother said these words in 2011, at the start of his journey to prominence as Russia’s...",
            "NEW YORK — A seven-figure verdict, an eight-figure verdict and, now, a nine-figure verdict.\n\nDonald Trump has been hit with all three in the past nine months,...",
            "This Is Me… Now could have come with the disclaimer “from the free-roaming mind of Jennifer Lopez.” The visual album from pop star which dropped on Prime ...",
            "Donald Trump must pay $354.9 million in penalties for fraudulently overstating his net worth to dupe lenders, a New York judge ruled on Friday, handing the form...",
            "What would you change if you had the ability to see the future?\n\nMarvel's newest film Madame Web explores the origin story of one of the franchise's most signif...",
            "Since Jennifer’s Body became a cult classic, the movie’s cast members such as Megan Fox, Amanda Seyfried and Adam Brody have only continued to find more suc...",
            "The guitarist and his band will come to Washington, Oregon and California.\n\nWilliam Tyler and The Impossible Truth mapped out 2024 West Coast Tour dates. The gu...",
            "If you were confused about Hunter Schafer’s green suede Maison Margiela Tabi shoes worn to the ‘Cuckoo’ Berlin Film Festival photocall, they will make mor...",
            "Jason Becker has released a brand new song with the help of some fellow talented friends called “Some Assembly Required”.\n\nFrom Jason Becker’s YouTube Cha...",
            "Insurance companies are trying to manage the rising cost of prescription drugs by turning increasingly to a tactic that is drawing public scrutiny: exclusive de...",
            "Viewers of Comedy Chaos Season 1 are wondering how many episodes are in the series and when new ones come out. As everyone knows, laughter is the best medicine,...",
            "Heather Rae El Moussa was not letting anyone ruin her Valentine’s Day, especially the haters!\n\nEarlier this week, the Selling Sunset alum shared a touching me...",
            "Lack of Anime Drives Readers to Manga; New Titles on Kids Chart\n\nCircana BookScan Top 20 Adult Graphic Novels – January 2024 (12/31/23 - 2/3/24) Rank Title Au...",
            "From The Falls Church News-Press:\n\n“The internet dissected your daily newspaper into its constituent parts, letting readers find the news they want without ev...",
            "Lack of Anime Drives Readers to Manga; New Titles on Kids Chart\n\nWhen the anime ends but the manga keeps going, fans pick up the manga; on the Kids chart, two n...",
            "Amazon alleged in a legal filing published Friday morning that the National Labor Relations Board (NLRB) is unconstitutional. SpaceX and Trader Joe’s — comp...",
            "Get ready for some stellar basketball, because the NBA's All-Star Events are happening this weekend. Showcasing teams made up of sports legends like LeBron Jame...",
            "First reactions to Avatar: The Last Airbender series are mixed, with visuals praised but performances lacking spark of the original series.\n\nThe long-awaited pr...",
            "Welp, the wedding dress Jennifer Lopez wore for her and Ben Affleck's Las Vegas wedding ceremony is not from Jersey Girl, or any other movie for that matter.\n\nT...",
            "This question came in a while ago and I was holding onto it for possible book inclusion after sending a private draft reply to the person who asked, but the man...",
            "Influencer Laura Merritt Walker Reveals 3-Year-Old Son Has Died\n\nInfluencer Laura Merritt Walker and husband David Walker share that their 3-year-old son Callah...",
            "Usually my younger siblings wait until I’m done with work — they’re in earlier time zones than I am, so they’re being polite — then the group chat lig...",
            "Are you looking for a high-quality Bluetooth speaker for your home or travel? This portable Bose Bluetooth speaker is on sale right now for just $129! They also...",
            "(Stock image, Graphic by The Desk)\n\nThe parent company of Law360 has laid off around 10 percent of the operation’s newsroom employees, according to multiple r...",
            "PPI inflation comes in hot … the Red Sea problem isn’t getting better … Louis Navellier is bullish on oil … yesterday’s bad retail sales report … is...",
            "World leaders gathered in Germany on Friday for the start of the annual Munich Security Conference. Nick Schifrin reports from the conference and sits down with...",
            "A New York judge on Friday fined Donald Trump and his business associates more than $350 million, ruling they engaged in a yearslong effort to inflate the value...",
            "Batman comic book writer James Tynion IV announced the launch of a new independent multimedia production company, Tiny Onion, with plans to create content acros...",
            "“I’m not ready for my son to become a martyr.” Alexey Navalny’s mother said these words in 2011, at the start of his journey to prominence as Russia’s...",
            "Up Next ‘Blue Bloods’ Vanessa Ray on How She Surprised Donnie Wahlberg With a Major Life Announcement",
            "Alexei Navalny, Russia’s most famous opposition figure and President Vladimir Putin’s most effective rival, has been reported dead.\n\nRussian state media —...",
            "(Disney+)\n\nBluey is a global phenomenon, enchanting children and parents alike. As soon as audiences realized how good the show is, it was only a matter of time...",
            "Reddit has signed a contract allowing an Artificial Intelligence (AI) company to train its models on the social media platform's content, Bloomberg News reporte...",
            "None Homes become bank-owned properties after homeowners default on their mortgages and the bank forecloses.\n\n• None If no one opts to buy a foreclosure home ...",
            "Joe Louis Dudley, who expanded a kitchen-table business that he started with his wife at the time into one of the largest Black-owned hair care companies in the...",
            "Night Tales has built a name for themselves in the house and deep house scene with a very unique sound that has allowed them to crossover into more commercial m...",
            "Bre Johnson/BFA.com\n\nThis season’s Black In Fashion Council Discovery Showroom was a noteworthy moment away from the presentations at New York Fashion Week. E...",
            "The CEO of the online learning company Skillshare is suing an aggrieved former employee for a minimum of $1.5 million, claiming her “inexplicable and meritles...",
            "Viewers of Totally Funny Animals Season 1 are wondering how many episodes are in the series and when each new episode comes out. The TV series offers a hilariou...",
            "The disconnect has puzzled economists, investors and business owners. Here are some answers.\n\nThis story appeared on wsj.com , 2024-02-16.",
            "Brian Wilson‘s business manager LeeAnn Hard and his longtime publicist and manager Jean Sievers have filed a petition to become the Beach Boys frontman’s co...",
            "This Is Me… Now could have come with the disclaimer “from the free-roaming mind of Jennifer Lopez.” The visual album from pop star which dropped on Prime ...",
            "\n\nArtist: Durbin\n\n\n\nAlbum: Screaming Steel\n\n\n\nReleased: 2024\n\n\n\nStyle: Heavy Metal\n\n\n\nFormat: MP3 320Kbps\n\n\n\nSize: 96 Mb\n\n\n\n\n\n\n\nTracklist:\n\n01 – Made Of Metal...",
            "The new Pacman Jones record “Ferrari Kit” is a ball of kinetic energy and a metaphorical representation of the former NFL pro bowler’s mentality. Built li...",
            "Get Books Earlier -> Windows Desktop App, Books Butterfly Instant N.\n\nBook Covers View. Please Confirm Price at Amazon BEFORE buying. Free at 6:45 pm EST.\n\nProm...",
            "Is the Bitcoin-dollar poised to be the new petrodollar? My latest read, The Bitcoin-Dollar by Mark Goodwin, has been a thought-provoking journey into the intric...",
            "Prices and trading volume for Ethereum NFT collection Moonbirds rose sharply Friday afternoon, following the announcement that Bored Ape Yacht Club maker Yuga L...",
            "The brand said in December an audit done at the site revealed no indications of forced labor being used\n\nVolkswagen is facing increased pressure to abandon its ...",
            "Israel Spying On US Inquiries Into West Bank Settler Violence - With Goal Of Thwarting Sanctions\n\n\n\nIsraeli intelligence has been spying on information shared w...",
            "There are many ways to harness the power of vitamin A, including regular use of one of the best retinol eye creams available. The dermatologist-loved ingredient...",
            "Check out the new Formula 1: Drive to Survive Season 6 Teaser starring Lewis Hamilton!\n\n► Learn more: https://www.rottentomatoes.com/tv/formula_1_drive_to_sur...",
            "A trio of professional gamers sued video game developer Activision Friday for its “unlawful 100% monopoly” on “Call of Duty” leagues and tournaments, a ...",
            "Wholesale prices in the United States accelerated in January, the latest sign that some inflation pressures in the economy remain elevated\n\nWASHINGTON -- Wholes...",
            "A vigil for Alexei Navalny in Krakow, Poland, on February 16, 2024. | Omar Marques/Anadolu/Getty Images\n\n\n\n\n\nNavalny’s death is the end of an era for Russia ?...",
            "Lily Gladstone thinks the Kansas City Chiefs and San Francisco 49ers should both be held “accountable” for their use of offensive Native American imagery.\n\n...",
            "Arumi Bachsin kini jadi istri dari Wakil Gubernur Jawa Timur, Emil Dardak. Wanita kelahiran 1994 ini secara otomatis juga menjabat sebagai ketua TP PKK Provinsi...",
            "This is completely fascinating. It's the story of the biggest Swedish export to the world, told through an unexpected lens. Stig Anderson [Wikipedia] was the fo...",
            "For entrepreneurs who rely on ADHD medication--brand-name and generic alike--to help them focus, supply chain shortages and rising prices could negatively impac...",
            "Dancehall musician Shatta Wale revealed that hiplife musician Patapaa's One Corner was what inspired his Freedom song\n\nHe spoke about Patapaa setting up a new t...",
            "Socialite Hajia4Real has deleted all her content on Instagram as she reportedly embarks on a social media break\n\nThis comes after the Ghanaian's prolonged legal...",
            "Host of The Delay Show, Deloris Frimpong Manso, aka Delay, turned many heads online when she stepped out in a fitting white dress\n\nIn the video, she was seen wa...",
            "Posted on Feb 17th, 2024 at 1:8 am in Foreign Movies F Old by Damon\n\nXue di zi (original title)\n\nPlot: An assassin, trained in the use of a throwing weapon that...",
            "In an interesting set of developments, major financial institutions in the US are urging the SEC to consider flexible crypto narratives. The banks are making of...",
            "His hiatus actually did not last that long.\n\nPre-debut scandals have led to the termination of many up-and-coming idols, sometimes ending their career before th...",
            "Opinions expressed by Entrepreneur contributors are their own.\n\nWith each passing year, there's always a \"first\" Black someone. The first Black mayor. The first...",
            "These are the values that Banza co-founders (and brothers) Scott and Brian Rudolph instilled as they scaled.\n\nThis week on How Success Happens, I spoke with Bri...",
            "Fool.com contributor Parkev Tatevosian evaluates where Boeing (NYSE: BA) stock could be by 2025.\n\n*Stock prices used were the afternoon prices of Feb. 14, 2024....",
            "A heavy-handed operation in the city could be a decisive blow to the deteriorating relationship between Washington and Jerusalem\n\nThis story appeared on ft.com ...",
            "President Joe Biden’s campaign is embracing TikTok to court younger voters ahead of the presidential elections, but U.S. adults have mixed views about whether...",
            "The death of a relative is always hard to go through, and the events surrounding it can also serve to stress those involved out further. A living woman in China...",
            "FOX Weather, a free round-the-clock live weather service, launched on two more platforms this week. Hulu+ Live TV and TCLtv+ now host “America’s Weather Tea...",
            "The Feminist Know-It-All: You know her. You can’t stand her. Good thing she’s not here! Instead, this column by gender and women’s studies librarian Karla...",
            "Viewers of Totally Funny Kids Season 1 are wondering how many episodes are in the series and when each new episode comes out. It is a light-hearted clip show ho...",
            "Robert Irwin and and his girlfriend Rorie Buckey have announced their split after almost two years of dating.\n\nThe pair made the shock announcement in a joint s...",
            "A trio of professional gamers sued video game developer Activision Friday for its “unlawful 100% monopoly” on “Call of Duty” leagues and tournaments, a ..."
        ]
    },
    {
        "date": "2024-02-17",
        "most-common-noun": "t",
        "frequency": 6,
        "snippets": [
            "Baby Tate recently clapped back at a fan who accused her of biting Nicki Minaj's style.\n\nBaby Tate Responds to a Fan Who Think She's Biting Nicki Minaj's Style\n...",
            "Lena Dunham cuddled up Stephen Fry as they attended the Another End premiere during Berlin's 74th Film Festival on Friday.\n\nThe actress, 37, stunned in a semi-s...",
            "Log in (at the top of the page) to enable voting.\n\nLog in (at the top of the page) to enable voting.",
            "On Thursday, the NBA All-Star Celebrity Game took place in Indianapolis before being broadcast the following night. It had NFL MVPs like Micah Parsons, Puka Nac...",
            "FOLLOW ComicBookMovie.com\n\nDISCLAIMER: ComicBookMovie.com is protected under the DMCA (Digital Millenium Copyright Act) and... : ComicBookMovie.com is protected...",
            "The Biden administration is planning to slow down the rollout of a rule that was designed to juice the United States’s transition to electric vehicles.\n\nThe a...",
            "xxdovelin:\n\nxxdovelin:\n\nAlways whole ‡\n\nFrom my comic, ARRILLUM. Read the first book, VALLONO",
            "The Hedera Council announced a new partnership with food giant Mondelēz International, the company behind popular brands such as Toblerone, Cadbury, and Oreo....",
            "Does Khloé Kardashian approve of Kim Kardashian dating Odell Beckham Jr.?\n\nYears before the SKIMS creator began dating the football player, Koko had been roman...",
            "Secure a $1,000 first bet on UFC 298 or the NBA through our Caesars Sportsbook promo code NEWSWK1000.\n\nSecure a $1,000 first bet on UFC 298 or the NBA through o...",
            "A mother and daughter who were caught out by Taylor Swift ticket scammers have had a remarkable reversal of fortune.\n\nMilana Bruno met her hero in a viral momen...",
            "The Dodgers’ new $325 million man was an instant hit in his first live batting practice.\n\nTeammates raved about the “nasty” stuff Yamamoto – who has yet...",
            "Middle America Is Dying, And D.C. Doesn't Care\n\n\n\nAuthored by Salena Zito via The Washington Examiner,\n\nWEIRTON, West Virginia - Most people in this town will t...",
            "George Santos seems to have never met a camera or a misrepresentation he didn’t like, except when it comes to Jimmy Kimmel.\n\nLacking all sense of irony, the e...",
            "On the witness stand last year, Donald Trump proclaimed: “I have a lot of cash.”.\n\nThis story appeared on seattletimes.com , .",
            "Bruins Takeaways: Bruins ‘add to their problems’ with self-inflicted loss to Kings \"We added to our problems today. We had breakdowns that shouldn't be happ...",
            "To call Julia von Heinz’ “Treasure” both sympathetic and broadly appealing might well be damning the film with faint praise, but circumstances here force ...",
            "Han Solo's parsec line from \"A New Hope\" always seemed like a huge \"Star Wars\" plot hole. It would finally get further clarification in 2018's \"Solo: A Star War...",
            "Lawrence O’Donnell had biting words for Donald Trump when he discussed the staggering $551 million that Trump now owes in two separate lawsuits. The MSNBC hos...",
            "An Alabama sheriff’s deputy took his own life this week in the middle of a police training event on sex trafficking, local authorities say.\n\nThe Fultondale Po...",
            "The Hanteo Music Awards (HMA) 2023 kicked off last night!\n\nOn February 17, the Hanteo Music Awards 2023 held the first night of its ceremony at Dongdaemun Desig...",
            "A couple of days ago, Maroo Entertainment updated the profile photos of the members of their K-Pop boy group GHOST9.\n\nWhile all of the seven members look striki...",
            "Bethenny Frankel's defending \"Today\" ... blasting Kelly Rowland for reportedly bailing on cohosting the show because her dressing room wasn't up to par.\n\nHere's...",
            "There's no right way to invest, with various approaches (like value, growth, and growth plus income) all offering the potential for investors to build a million...",
            "There’s no beef between comedian and actor Bassem Youssef and Superman: Legacy director/king of all D.C. Comics movies James Gunn, apparently. Which is worth ...",
            "Best Buy’s President’s Day sale ends on Monday, so you have the weekend to look over offers. The retailer sells everything from fridges to electric scooters...",
            "Tracklist:\n\n1. Living in Sin (Ricky Wilde Remix) (5:31)\n\n2. Lovers on a Beach (Steve Anderson Remix) (6:36)\n\n3. Videotheque (Project K Remix) (7:06)\n\n4. Causewa...",
            "4 Fakta Dua Hati Biru, Sequel Film Dua Garis Biru yang Menjawab Kisah Asmara Bima dan Dara Angga Yunanda kembali memerankan Bima dalam sekuel film Dua Garis Bir...",
            "Log in (at the top of the page) to enable voting.\n\nLog in (at the top of the page) to enable voting.",
            "The Dodgers’ new $325 million man was an instant hit in his first live batting practice.\n\nTeammates raved about the “nasty” stuff Yamamoto – who has yet...",
            "How well do EVs handle cold weather?\n\nElectric vehicles lose some range in cold weather. But how much range, exactly? Enthusiasts and researchers alike run regu...",
            "The biggest concern of would-be electric vehicle shoppers is access to public charging. Two companies are trying to change that.\n\nThis story appeared on npr.org...",
            "Margot Robbie has settled on her first project after Barbie, and it finds her teaming up with Colin Farrell.\n\nThe duo will join forces for a new movie called A ...",
            "George Santos seems to have never met a camera or a misrepresentation he didn’t like, except when it comes to Jimmy Kimmel.\n\nLacking all sense of irony, the e...",
            "Store offers a contemporary twist on a traditional snack.\n\nYou may have seen flower-based doughnuts in Tokyo before, but what about something a bit more traditi...",
            "Posted in: Max, Movies, streaming, TV | Tagged: dc studios, dcu, james gunn, superman, superman legacy\n\nSuperman: Legacy: Bassem Youssef Clarifies Casting Contr...",
            "For casual or even regular beer drinkers, how or where you drink it is not that much of a priority. The important thing is to have a preferably ice cold glass o...",
            "Ice Spice and Spike Lee have recently met up in Brooklyn, and now, fans are unsure exactly what such a meeting might mean.\n\nIn an Instagram post made on Friday ...",
            "In this VladTV Flashback from 2022, Atlanta-based journalist George Chidi posited the theory that the YSL RICO case was a sort of test run for how prosecutors w...",
            "Looks like you already have a subscription! You can verify your subscription or upgrade to LIFETIME HERE:",
            "The US faces a sweeping loneliness epidemic, causing people to feel more disconnected and depressed.\n\nWhile some blame technology as the cause of the problem, s...",
            "To call Julia von Heinz’ “Treasure” both sympathetic and broadly appealing might well be damning the film with faint praise, but circumstances here force ...",
            "Posted in: Comics, DC Comics, Preview | Tagged: catwoman\n\nCatwoman #62 Preview: Selina's Suicide Squad Shocker\n\nSelina Kyle thinks cat burglaries have nine live...",
            "Investors are hungry for growth stocks now that the S&P 500 has been climbing. But don't forget your fundamentals.\n\nFor most investors, it's important to have a...",
            "Russia said its forces took complete control Saturday of a city in eastern Ukraine that was the focus of intense combat for months, a development that Moscow co...",
            "I didn’t expect Starpets, of all games, to have such a brutal teaser trailer. I know I’ve been up since 3 AM, but the last thing I expected to see was a pla...",
            "On the witness stand last year, Donald Trump proclaimed: “I have a lot of cash.”\n\nAfter Friday’s eye-popping penalty in his New York civil fraud trial, he...",
            "Abanti Chowdhury/BI\n\nThe US faces a sweeping loneliness epidemic, causing people to feel more disconnected and depressed.\n\nWhile some blame technology as the ca...",
            "Specific Coast is the solo project from writer/producer Matt Dunne, who will release his debut EP, Trying My Best, this April.\n\n“Problems” is the lead singl...",
            "Who needs that Oklahoma radio station when you've got the Savannah Bananas!\n\nThe hugely popular team (baseball's version of the Harlem Globetrotters) blasted Be...",
            "Barry Keoghan has made a major change for his career as he is reportedly quitting the UK to head to Los Angeles.\n\nThe Saltburn star, 31, is said to have moved t...",
            "Each year, music’s biggest names come together to compete for high recognition at the Grammy Awards. But occasionally, entertainers can put aside their compet...",
            "Been looking for a good cord-cutting deal among all of the Presidents Day sales? Good news both the new Fire TV Stick 4K Max and the Fire TV Cube are on sale at...",
            "Urban Sales has unveiled key deals for Mascha Halberstad’s CGI animation Fox And Hare Save The Forest ahead of its world premiere in the Berlin Film Festival?...",
            "A former German spy chief who was sacked after being accused of averting his eyes to the threat posed by the far-right founded a new right-wing party on Saturda...",
            "US Prepares New Weapons Transfer To Israel, Ironically While Pushing For Ceasefire\n\n\n\nJust days ago President Biden told Israeli Prime Minister Benjamin Netanya...",
            "The excitement in the Long Island theater where I first saw Pulp Fiction was unlike anything I’d previously experienced at the movies: Everything people were ...",
            "I. “You Can Hear a Pin Drop”\n\nCarl Winslow, the protagonist of the ’90s sitcom Family Matters, wore his badge with honor. On the show, about a middle-clas...",
            "Posted in: Exclusive, Interview, Movies | Tagged: exclusive, interview, Lily Sullivan, Lucy Campbell, Matt Vesely, Monlith, Well Go USA Entertainment\n\nMonolith:...",
            "\n\nArtist: Dj Drama\n\n\n\nAlbum: I’m Really Like That [Sped Up]\n\n\n\nReleased: 2024\n\n\n\nStyle: Hip Hop\n\n\n\nFormat: MP3 320Kbps\n\n\n\nSize: 88 Mb\n\n\n\n\n\n\n\nTracklist:\n\n01 ?...",
            "Wall Street's five-week winning streak came to an end, with the S & P 500 losing 0.42% for the week, while the Dow Jones Industrial Average lost 0.11% and the N...",
            "Siesta Key's Madisson Hausburg Welcomes Daughter 2 Years After Son's Death\n\nSiesta Key's Madisson Hausburg has given birth to a baby girl, two years after her s...",
            "Photo: Illustration: Vulture. Photos: Getty Images\n\nParamore has rejected an honor from the Tennessee government for their Grammy win after fellow winner Alliso...",
            "EXCLUSIVE: Urban Sales has unveiled key deals for Mascha Halberstad’s CGI animation Fox And Hare Save The Forest ahead of its world premiere in the Berlin Fil...",
            "Africa-born, London-raised designer Foday Dumbuya has become a standout talent on the London Fashion Week schedule. Season after season, the creative takes us o...",
            "The West London office of Comcast and Paramount Global’s joint venture Sky Showtime. (Image via LinkedIn, Graphic by the Desk)\n\nFollowing in the footsteps of ...",
            "Hungarian Prime Minister Viktor Orbán sought to contain the political fallout of a presidential pardon scandal during an annual state of the nation address on ...",
            "You couldn’t stop listening to and watching the “Say My Name” music video, so you got a little more curious about ATEEZ. You’re not exactly an ATINY (AT...",
            "The 3CD deluxe edition includes two bonus discs created in 2013, and remastered for this edition.\n\nOriginally released in 1984, Structures from Silence turned o...",
            "Reheating services inflation isn’t a surprise. But the PPI for finished core goods saps hopes for goods “deflation” to continue to hold down overall infla...",
            "It’s been seven years since her debut.\n\nPopular Korean cheerleader Park Ki Ryang went viral for her idol-like visuals, gaining the attention of fellow celebri...",
            "When the Juilliard-trained flautist Nathalie Joachim started writing rhythmic avant-pop songs, she described it as her “reverse Andre 3000” moment. Joachim ...",
            "GRAMMY-nominated brother duo Grey – renowned for producing mega-hits with global icons such as Zedd, Camila Cabello, and Sofia Carson – have finally unleash...",
            "On Thursday this week (Feb 15), Sam Altman, CEO of OpenAI (ChatGPT, DALL-E) released a sneak peek into our not-to-distant future of realistic AI generated text-...",
            "What does ‘psychedelic’ mean? As a descriptor, it’s been flattened by years of boring bands doing 60s nostalgia. But it should mean more than guitars with...",
            "Linda Hamilton may be joining the Hawkins, Indiana, crew for the fifth and final season of Stranger Things, but she won’t be watching it along with the rest o...",
            "Former President Donald Trump’s attorney Alina Habba slammed New York Attorney General Letitia James and vowed retribution after the Republican presidential f...",
            "IN AN ERA of Marvel movie fatigue, Sony's contributions to the superhero canon are an enjoyably silly change of pace. Relatively, refreshingly light on lore whe..."
        ]
    },
    {
        "date": "2024-02-18",
        "most-common-noun": "People",
        "frequency": 15,
        "snippets": [
            "Love is in the air at the 2024 People's Choice Awards.\n\nBut in case you need a little extra proof, Francesca Farago and Jesse Sullivan looked ready to say \"I do...",
            "Watch : Francesca Farago and Jesse Sullivan Open Up About Their IVF Journey | 2024 People’s Choice Awards\n\nLove is in the air at the 2024 People's Choice Awar...",
            "The People’s Choice Awards, which solicit votes from fans and the general public, originated in 1975. The 49th annual ceremony takes place on Sunday at the Ba...",
            "Francesca Farago and Jesse Sullivan Open Up About Their IVF Journey | 2024 People’s Choice Awards\n\nFrancesca Farago and Jesse Sullivan get candid with Laverne...",
            "Kandi Burruss Reveals Her Favorite RHOA Moment After 14 Seasons!\n\nKandi Burruss dishes to Paige DeSorbo on the red carpet at the 2024 People’s Choice Awards a...",
            "Advertisement\n\nThere was no shortage of star power at the 49th annual People's Choice Awards, held at the Barker Hangar in Santa Monica, California, on Sunday.\n...",
            "The fans have voted, the people have spoken, and the 2024 People’s Choice Awards are underway, starting with this year’s best red carpet looks. This year’...",
            "The 2024 People's Choice Awards are officially underway!\n\nHosted by Simu Liu, pop culture's biggest night promises to be full of surprises, exciting moments, an...",
            "Watch : People's Choice Awards: The Biggest Nominees!\n\nThe people have spoken and now the stars have done their thing—turning up at the 2024 People's Choice A...",
            "Watch : People's Choice Awards: The Biggest Nominees!\n\nThe people have spoken and now the stars have done their thing—turning up at the 2024 People's Choice A...",
            "Watch : People's Choice Awards: The Biggest Nominees!\n\nThe people have spoken and now the stars have done their thing—turning up at the 2024 People's Choice A..."
        ]
    },
    {
        "date": "2024-02-19",
        "most-common-noun": "s",
        "frequency": 8,
        "snippets": [
            "This is a cast-iron, shoe-related ... thing that I found in the family home and do not know the provenance of, but there were shoemakers in our past. Have you s...",
            "“Traumatism as an opening to the future of the wound is the promise of a text.” (Cixous, 1998, p13)\n\nIn medical terms, we speak of dehiscence when there is ...",
            "Expect the MARA stock outlook to stay very bright\n\nSome stocks have complicated bull cases, but that’s not really the story here with Marathon Digital (NASDAQ...",
            "Battery stocks play a critical role in the burgeoning EV revolution. Moreover, McKinsey’s’ forecast shows the battery market is expected to grow to a whoppi...",
            "These EV stocks are slated to be multibaggers in 2024\n\nThe electric vehicle (EV) market is likely headed toward a slump in 2024. Interest rates remain elevated,...",
            "The Street is now more likely to embrace growth stocks\n\nThe near- and medium-term outlooks for growth stocks have greatly improved in recent weeks. That’s bec...",
            "Profit from the future cannabis boom with these three sleeper picks\n\nThe cannabis sector has been relatively quiet lately. With federal legalization in the U.S....",
            "SBUX, PANW and LEN are 3 stocks to buy this week to beat a volatile market.\n\nDuring the week of February 12-16, we talked about three stocks to watch, Deere & C...",
            "Alexei Navalny's death Friday in a Russian Arctic prison continues reverberating around the globe. World leaders, including President Biden, spoke Monday of ste...",
            "Along the eastern flank of NATO nations sit several former Soviet satellite states, with long and bitter memories of Russian dominance. They are among the stron...",
            "Joe Alwyn returned to social media after 5 months away with a nostalgic photo dump.\n\nAlwyn, 32, posted a carousel of photos on Instagram on Monday, February 19,...",
            "More people are using crypto in Russia than ever before, a leading Moscow-based academic has claimed.\n\nPer the Russian-language media outlet Coinspot, the comme...",
            "No Bullshit Bitcoin is funded by our community.\n\n\"We got a new minor release on the v0.2 track: v0.2.2. It contains some performance improvements and bug fixes,...",
            "Rok Nagita Slavina Mirip Kue Lapis, Harganya Bikin Meringis! Harga Rok Nagita Slavina ini bikin publik tercengang.\n\nSuara.com - Kehidupan Nagita Slavina kerap k...",
            "During an appearance on a recent episode of the \"Shout It Out Loudcast\", Ace Frehley once again admitted that he isn't the most technically proficient guitarist...",
            "Entertainment News International (ENI) is the #1 popular culture network for adult fans all around the world.\n\nGet the scoop on all the popular comics, games, m...",
            "A$AP Rocky has confirmed his partner Rihanna,is still “working on” her highly-anticipated ninth album – currently dubbed ‘R9’.\n\nLast week, it was repo...",
            "The Five’s Jessica Tarlov got shouted down by her Fox News co-hosts while trying to discuss the various criminal charges against Donald Trump, prompting her t...",
            "Italian trio MEDUZA has teamed up with Indian producer Varun Jain to release their latest single, ‘Dola re Dola‘. The new track sounds perfect for a jungle ...",
            "Japan's transport ministry is preparing action against a Motor (NYSE: ) Corp affiliate for cheating engine emissions tests, including possibly withdrawing certi...",
            "BHP Group reported an 86% drop in first-half net profit as it wrote down the value of its nickel operations and set aside more cash to cover costs associated wi...",
            "Grab a cube of cheese and your favorite theater lover because The Devil Wears Prada musical is on its way to England!\n\nThe Devil Wears Prada: A New Musical — ...",
            "Photo: David Livingston/FilmMagic\n\nRider Strong, Will Friedle, and Danielle Fishel devoted the entirety of their February 19 episode of Pod Meets World to their...",
            "In Whitechapel Season 1, ambitious Detective Inspector Chandler tackles a seemingly simple murder case in the gritty streets of London’s Whitechapel. But the ...",
            "huffylemon:\n\nthis is so cute 🥹\n\nWonderful example of the Boomer Ellipsis as a feature of casual handwritten style from the pre-internet era (probably pre-boo...",
            "[Warning: Potentially Triggering Content]\n\nRuby Franke‘s son is leaning on dark humor to get through her child abuse trial.\n\nAs Perezcious readers know, the f...",
            "Hiya stranger, login to post links to music videos.You can subscribe to this site as RSS or on twitter",
            "O’HARE — O’Hare Airport’s transformation of Terminal 3 is getting another infusion of federal cash.\n\nO’Hare was awarded a $40 million Airport Terminal...",
            "Average wage at the 'gas station' will be about $50K\n\nEditor’s note: The above video shows KXAN News’ top morning headlines from Monday, Feb. 19, 2024.\n\nSAN...",
            "It’s, unfortunately, increasingly common for security cameras to have a glitch that exposes data from one user’s system and have that data show up in someon...",
            "Chinese tech giant Alibaba Group is betting on its overseas businesses while domestic consumption growth remains sluggish. One bright spot in Alibaba's latest e...",
            "Lucy Alexandra Spencer spent 16 weeks abroad last year in Oman, France, Switzerland and Portugal. Unlike with most people, traveling is how she earns — rather...",
            "Posted in: Games, Indie Games, Video Games | Tagged: Indie Live Expo, Ryu’s Office\n\nDetails Revealed For Indie Live Expo 2024 This May\n\nWe now have a better i...",
            "Posted in: Movies | Tagged: Anita Mui, blu-ray, Ching Siu Tung, Criterion Collection, hong kong action movies, in the mood for love, johnnie to, Maggie Cheung, ...",
            "‘Strawberry Shortcake: Berry in the Big City Season One’ Available on DVD From Distribution Solutions\n\nStephanie Prange\n\nNCircle Entertainment’s animated ...",
            "While “Bob Marley: One Love” is shaping up to be a box office success for Paramount, its strong start isn’t enough to keep the struggling theatrical marke...",
            "Rita Liao, who covers Asia for TechCrunch, is moving to a part-time role in March with the technology news site.\n\nLiao has a special interest in Chinese compani...",
            "Getty Image\n\nFOX Sports analyst Joel Klatt had high praise for Caleb Williams ahead of the 2024 NFL Draft. The college football personality named him the BEST q...",
            "Hipgnosis Songs Fund Takes Legal Action ‘To Secure An Indemnity from Merck Mercuriadis’ As Liquidator-Levied Lawsuit Ramps Up\n\nSave\n\nAnother day, another ro...",
            "A Russell Crowe Movie You Haven't Heard Of Made The Top 10 At The Box Office\n\nRussell Crowe is a beloved Oscar-winning actor with movies like \"Gladiator\" and \"A...",
            "Legal by Daniel Johnson Georgia High School Football Coach Arrested For Allegedly Strangling Girlfriend To Death Carl Kearney Jr., who was named coach of the ye...",
            "Watch the full interview now as a VladTV Youtube Member: Click Here\n\nPart 2: Michael Blackson: Taylor Swift Didn't Know Football, She Would Cheer at Wrong Times...",
            "\n\nUHM is an independently owned site that relies solely on ad revenue, so we ask that if you like this site and what we do to help support by temporarily disabl...",
            "Bobby Shmurda has apologised for getting into an altercation at Proud Late nightclub in London after the venue reportedly failed to pay him.\n\nREAD MORE: Eight r...",
            "We typically associate truffles with adding flavor to food, but some of the best truffles in the world can also do wonders for your skin. Case in point: this Wh...",
            "As an Amazon Associate I earn from qualifying purchases. Please support Super Punch by following the affiliate links and buying from Amazon and eBay . This site...",
            "Reviewed by Top_Dawg_Critic 6 / 10\n\nOne would expect that a four part anthology would have something more in common than just the theme. This film was not the c...",
            "LONDON — The European Union said Monday it is investigating whether TikTok has broken the bloc’s strict new digital rules for cleaning up social media and k...",
            "U.S. — A new study from the National Institutes of Health has found that 10 out of 10 newborn babies greatly prefer female boobs over man boobs.\n\nThe study, w...",
            "Seven years after Denis Villeneuve’s feature film Blade Runner 2049, Blade Runner is headed to the small screen in Amazon’s Blade Runner 2099, and Deadline ...",
            "“Hong Kong’s strategic location, its well-established infrastructure and its status as an international finance centre enables innovation and technology com...",
            "Stark Bank, one of the few Latin America startups to receive funding from Jeff Bezos’ family office, is generating profits from its business of helping compan...",
            "There is nothing more British than a Burberry trench coat. The look has come to define not just the brand but the aesthetic of London's biggest style stars from...",
            "University Challenge S53E30 1080p WEB H264-Dr460Ns Posted on Feb 20th, 2024 at 1:8 am in TV Shows by Lisa Season 53, Episode 30 – “Birkbeck v Sheffield”\n\n...",
            "Merrell introduced the Moab Speed lineup all the way back in 2021, doubling down on its blend of lifestyle aesthetics with outdoor reliability and building on o...",
            "Coinbase Commerce, the cryptocurrency payments solution of U.S.-based exchange Coinbase, has removed support for bitcoin payments using self-custody wallets. Br...",
            "Would Maduro invade his neighbor to snatch its oil assets?\n\nThis story appeared on wsj.com , 2024-02-19.",
            "America's Fat Kids Now in Ozempic Marketers' Crosshairs\n\n\n\nAuthored by Ben Bartee via Armageddon Prose substack,\n\nVia Reuters:\n\n“A small but rapidly growing n...",
            "Hunter’s former partner tells Congress how Joe & Co. sold influence.\n\nThis story appeared on wsj.com , 2024-02-19.",
            "The girls are loving clean, sustainable beauty and even moreso, those that were created with a conscience.\n\nWe are the girls and Josie Maran is the clean beauty...",
            "Source: unsplash.com\n\nIn the dynamic realm of digital content creation, YouTube stands as a colossus, hosting millions of creators all eager to carve out their ...",
            "San Francisco is reportedly once again at the center of a tech revival, with entrepreneurs and investors returning to the city after a period of exodus during t...",
            "Kelly Clarkson took the stage to celebrate Jennifer Lopez by singing the singer/actress/dancer’s 1999 single “Let’s Get Loud.”\n\nFans watch Clarkson’s ...",
            "True to his compulsive nature, Godzilla could not be ignored forever by the Oscars.\n\nThe King of the Monsters, first uncorked by Toho Studios 70 years ago, left...",
            "Jon Stewart’s return to “The Daily Show” keeps breaking records. Over 3 million viewers tuned into watch the late night host’s return on Feb. 12, accord...",
            "Learn More\n\nThe Only Actors Still Alive From The Cast Of Blazing Saddles\n\nWhile comedy has always been a place of escapism, it also has the potential to comment...",
            "In what feels like a centuries-long plot for world domination, species of ants living in Central and South America have spread across the planet, globalizing th...",
            "(Nickelodeon)\n\nAvatar: The Last Airbender is coming to Netflix. Not the original animated series from Nickelodeon (although that one is also streaming on Netfli...",
            "\n\nArtist: Low Island\n\n\n\nAlbum: Life In Miniature [Full Extended Edition]\n\n\n\nReleased: 2024\n\n\n\nStyle: Indie Pop\n\n\n\nFormat: MP3 320Kbps\n\n\n\nSize: 159 Mb\n\n\n\n\n\n\n\nTra...",
            "True Investor, a trailblazing organization committed to empowering women in real estate, is elated to share the success of its groundbreaking event co-hosted wi...",
            "“Masters of the Air” launched with more viewers in its opening weekend than any Apple TV+ series ever has, according to the streamer. Though an exact number...",
            "Connected fashion brand 9dcc, which already launched premium t-shirts and baseball caps paired with Ethereum NFTs that enable on-chain benefits, has unveiled it...",
            "Sony aims to sell 18 million PlayStation 5 consoles in its financial year ending in March 2023.\n\nSony is likely to release a refreshed version of the PlayStatio...",
            "A blog dedicated to fashion law claimed that Donald Trump could soon face another lawsuit after he revealed his new signature sneaker line at Sneaker Con at the...",
            "The Roots have announced the lineup for the 2024 Roots Picnic in Philadelphia, featuring artists like Lil Wayne, Jill Scott, André 3000, and more across two da...",
            "Clean It Fix It S03E06 720p WEB-DL x264-W45Ps Posted on Feb 20th, 2024 at 1:3 am in TV Shows by Lisa Season 3, Episode 06 –\n\nThe team are in Middlesex to help...",
            "Richard Osmans House Of Games S07E91 720p WEB H264-W4N70Ks Posted on Feb 20th, 2024 at 1:3 am in TV Shows by Lisa Season 7, Episode 91 – \"Mark Chapman, Will K...",
            "Season 24, Episode 33 – \"The Fens\"\n\nSteve Brown’s escapees from a large Bedfordshire town want to relocate to the fabulous Fens to start a glamping business...",
            "Mastermind S2024E25 720p WEBDL x264-W4N70Ks Posted on Feb 20th, 2024 at 1:3 am in TV Shows by Lisa Links: HOMEPAGE – TVM Mastermind.S2024E25.WEBDL.x264-W4N70K...",
            "“Masters of the Air” launched with more viewers in its opening weekend than any Apple TV+ series ever has in its first season, according to the streamer. Th...",
            "The revered and beloved fuzz wah pedal, touted as the \\\"secret weapon\\\" of late Metallica bassist Cliff Burton has been modernized and reissued by Morley.\n\nClif...",
            "Watch the full interview now as a VladTV Youtube Member: Click Here\n\n--------\n\nFormer NBA player Smush Parker joined VladTV for a discussion about his life and ...",
            "Shoppers, listen up: Presidents Day savings aren’t quite over yet, but time is of the essence to shop majorly discount travel essentials and accessories. As w...",
            "Traders work on the floor of the New York Stock Exchange during afternoon trading on February 05, 2024 in New York City.\n\nS&P 500 futures are near flat Monday n...",
            "Law enforcement agencies from 11 countries have disrupted the notorious LockBit ransomware operation in a joint operation known as ''Operation Cronos.\"\n\nAccordi...",
            "An address suspected to be associated with Justin Sun, the founder of TRON, has reportedly acquired $160.7 million in Ethereum (ETH). This move has sparked spec...",
            "The Teamsters union appears ready to shut down work at two major beer companies at once, after striking at Molson Coors' Texas brewery over the weekend and warn...",
            "Some of India's top airlines have been ordered to start sending out passengers' bags within 10 minutes of the plane's engine shutting down.\n\nThe civil aviation ...",
            "Some of the Best Looks From The People’s Choice Awards Green Carpet!\n\nLICK HERE\n\nThe 49ers WAGs hit Cabo in Bikinis!\n\nLICK HERE\n\nHere is That Much Talked Abou...",
            "G-SHOCKs are not only a favorite in the watch community for their timeless design language and indestructible builds. One of our favorite selling points of the ...",
            "1\n\n28 years ago, Happy Gilmore upset Shooter McGavin in the Tour Championship to win his first Gold Jacket. On February 16, 1996 Happy Gilmore hit theaters. The...",
            "Exclusive -\n\nBenny The Butcher summoned Hit-Boy and The Alchemist to assist on the production of his latest album, Everybody Can’t Go, and he has now elaborat..."
        ]
    },
    {
        "date": "2024-02-20",
        "most-common-noun": "week",
        "frequency": 7,
        "snippets": [
            "Supreme season officially kicked off last week, with an expansive range of apparel and accessories touching down on shelves across the world. Beforehand, the br...",
            "Let's take a look at the expectations for NVIDIA’s earnings announcement...\n\nLast week, all eyes on Wall Street were laser-focused on economic data. Specifica...",
            "Lil Wayne, Nas and André 3000 were a few of the headlining names announced when the 2024 Roots Picnic revealed its lineup this week, but not everyone was thril...",
            "The pressure on the chief intensified this week after what has widely been described as a disastrous interview.\n\nWoolworths and its rival Coles control 65% of t...",
            "The Los Angeles Dodgers open their 2024 Spring Training schedule this week after a high-spending offseason that has the club positioned as early World Series fa...",
            "Matt James, 32, debuted his freshly shaven face over the weekend! The Bachelor alum took to TikTok on February 18 and revealed that his girlfriend, Rachael Kirk...",
            "Two suspects have been charged in the horrifying Kansas City Super Bowl parade shooting.\n\nNearly one week after the fatal shooting, 18-year-old Dominic Miller o...",
            "Amazon.com Inc. is set to join the Dow Jones Industrial Average in a week, a move meant to reflect “the evolving nature of the American economy,” S&P Dow Jo..."
        ]
    },
    {
        "date": "2024-02-21",
        "most-common-noun": "Wednesday",
        "frequency": 9,
        "snippets": [
            "Director Jason Reitman and a coalition of 35 other prominent filmmakers have officially purchased Westwood’s Village Theater, it was announced Wednesday. The ...",
            "Chipmaker Analog Devices (ADI) on Wednesday edged above Wall Street's targets for its fiscal first quarter, but it guided well below views for the current perio...",
            "Fox News host and New York resident Greg Gutfeld threatened to move to Florida on Wednesday in protest over former President Donald Trump’s $354 million civil...",
            "Rivian announced Wednesday that it will lay off 10% of its salaried workers beginning Thursday morning, amid a quarterly loss and an increasingly competitive EV...",
            "President Joe Biden touted a new pathway for debt relief that kicked into gear Wednesday for 153,000 student loan borrowers, calling it a ticket to \"chase dream...",
            "Shares of SunRun Inc. fell in extended trading Wednesday after the residential solar-power installer and energy-storage provider reported fourth-quarter results...",
            "Chord Energy Corp. and Canada’s Enerplus Corp. said late Wednesday they have agreed to merge in an $11 billion stock and cash deal with an eye toward stablish...",
            "Director Jason Reitman and a coalition of 35 other prominent filmmakers have officially purchased Westwood’s Village Theater, it was announced Wednesday. The ...",
            "The families of Gabby Petito and Brian Laundrie emerged from a mediation conference in Venice, Florida on Wednesday with a confidential resolution that will see..."
        ]
    },
    {
        "date": "2024-02-22",
        "most-common-noun": "Kotsur",
        "frequency": 11,
        "snippets": [
            "Troy Kotsur has joined Season 3 of “Foundation” at Apple TV+.\n\nThe role will mark a return to Apple for Kotsur, who previously starred in the film “CODA,?...",
            "Oscar-winning actor Troy Kotsur has joined the cast of Foundation season three.\n\nThe CODA star will play Preem Palver, the leader of a planet of psychics in the...",
            "Troy Kotsur has been cast in Season 3 of “Foundation.” This will mark the actor’s latest collaboration with Apple TV+ following his Best Supporting Actor ...",
            "Troy Kotsur, who won the Oscar for his role in CODA, is heading back to Apple.\n\nKotsur is joining the third season of Foundation.\n\nIt comes as the series, which...",
            "Troy Kotsur, who won the Oscar for his role in CODA, is heading back to Apple.\n\nKotsur is joining the third season of Foundation.\n\nIt comes as the series, which...",
            "Troy Kotsur has been cast in Season 3 of “Foundation.” This will mark the actor’s latest collaboration with Apple TV+ following his Best Supporting Actor ...",
            "Troy Kotsur has joined Season 3 of “Foundation” at Apple TV+.\n\nThe role will mark a return to Apple for Kotsur, who previously starred in the film “CODA,?..."
        ]
    },
    {
        "date": "2024-02-23",
        "most-common-noun": "s",
        "frequency": 12,
        "snippets": [
            "Abbott Elementary has been having fun surprising its audience with many star-studded cameos.\n\nThe ABC sitcom, which debuted in 2021, quickly became a critically...",
            "Finalists for the 2023 Analog Analytical Laboratory (AnLab) Awards, and the 38th Asimov’s Readers’ Awards, have been announced, with many finalists availabl...",
            "The Korean Business Research Institute has revealed this month’s brand reputation rankings for singers!\n\nThe rankings were determined through an analysis of s...",
            "Ryan Murphy can’t be stopped. The prolific producer took to Instagram to drop a teaser for Grotesquerie, a new horror drama series starring Niecy Nash-Betts.\n...",
            "“Russia, Russia, Russia” is Donald Trump’s mocking mantra whenever someone raises the myriad investigative findings and concerns around him and Russian Pr...",
            "The News\n\nA U.S. federal judge declined on Friday, as of 6pm Texas time, to grant an eleventh-hour plea by bitcoin miners to prevent the Department of Energy fr...",
            "Tracklist:\n\n1. I GOT YOU\n\n2. ONE SPARK\n\n3. RUSH\n\n4. NEW NEW\n\n5. BLOOM\n\n6. YOU GET ME\n\nDOWNLOAD From : Rapidgator, Katfile, MexaShare, Fikper …",
            "Google has changed its mind about one of its beloved payment apps. The tech giant has announced that it is killing Google Pay in the U.S., which was first intro...",
            "is seeking to avoid being held personally liable in two dozen lawsuits accusing Meta Platforms Inc.-rte-company> and other social media companies of addicting c...",
            "Beloved TV and radio host Wendy Williams dropped out of the public eye after her daytime talk show was canceled in 2022 and ever since, fans have been wondering...",
            "Hashlabs Mining co-founder and chief mining strategist Jaran Mellerud said Ethiopia, Nigeria, Kenya, Argentina and Paraguay could pick up more hash rate in the ...",
            "Former talk show host Wendy Williams issued a statement Friday afternoon thanking fans for their “overwhelming” response to Thursday’s announcement that s...",
            "From Judge Roger Benitez's decision in Fouts v. Bonta(S.D. Cal.):\n\nThis case is about a California law that makes it a crime to simply possess or carry a billy....",
            "Season 30, Episode 02 –\n\nAdam Hills, Josh Widdicombe and Alex Brooker are joined by guests Jonathan Ross, Lucy Beaumont and Shaun Ryder for a comic review of ...",
            "Tinashe unveiled her new twenty-minute immersive video project, The BB/ANG3L Experience. Following her recent tour of the East Coast for her album, BB/ANG3L, th...",
            "Netflix’s Heartstopper has had some fabulous guest appearances throughout its first two seasons, and we’ve learned that another is currently lined up for th...",
            "Netflix’s Heartstopper has had some fabulous guest appearances throughout its first two seasons, and we’ve learned that another is currently lined up for th...",
            "There’s No Doubt that Flavor Flav learned his lesson after this!\n\nThe rapper was on Thursday’s episode of Bethenny Frankel‘s Just B podcast, and while cha...",
            "Published by OMEGA View all posts by Master\n\nPost navigation\n\nFeel free to post your Old Next Goal Wins 2023 BDRip H264-RBB torrent, subtitles, samples, free do...",
            "By Marcia Dunn | Associated Press\n\nCAPE CANAVERAL, Fla. — A private U.S. lunar lander tilted over at touchdown and ended up on its side near the moon’s sout...",
            "RHOA's Porsha Williams Files for Divorce From Simon Guobadia\n\n‘The Real Housewives of Atlanta’ alum Porsha Williams files for divorce from Nigerian business...",
            "Beloved TV and radio host Wendy Williams dropped out of the public eye after her daytime talk show was canceled in 2022 and ever since, fans have been wondering...",
            "So… what happened on your screens this week? Let’s find out! Vivek Shraya’s stellar webseries How to Fail as a Popstar makes failure look good. RuPaul mad...",
            "Soybean futures fell by as much as 14 ¾ cents across the front months on the last trade day of the week. March beans finished at a new contract low and the low...",
            "New York investigators trying to seize a drawing from the Art Institute of Chicago filed an exacting 160-page motion on Friday accusing the museum of blatantly ...",
            "The President ignores the law again as he forgives more student debt. The total is now $138 billion and counting.\n\nThis story appeared on wsj.com , 2024-02-23.",
            "Emails show the Federal Trade Commission chief has run roughshod over her agency’s staff.\n\nThis story appeared on wsj.com , 2024-02-23.",
            "A New York jury has found Javier Aguilar guilty of violating the Foreign Corrupt Practices Act.\n\nThis story appeared on wsj.com , 2024-02-23.",
            "Memo to Mr. Trump: Europe is moving to meet its alliance military targets.\n\nThis story appeared on wsj.com , 2024-02-23.",
            "Is This How Skynet Begins? Bezos, Nvidia Join OpenAI In Funding Humanoid Robotics Firm\n\n\n\nA startup focused on developing general-purpose humanoids has attracte...",
            "The pausing of in-vitro fertility procedures looks like it won’t last long.\n\nThis story appeared on wsj.com , 2024-02-23.",
            "It’s Been 30 Years Since the NBA’s Last Quadruple-Double. Will We See Another Soon?\n\nThere are several reasons for the league’s quadruple-double drought?...",
            "Love Is Blind's Chelsea Said This to Megan Fox Post-Show\n\nChelsea Blackwell chats exclusively with E! News about that viral moment from Love Is Blind S6 when sh...",
            "Travis Kelce had Taylor Swift on his mind even back in 2016!\n\nIn an old Afterbuzz TV interview clip that resurfaced this week on TMZ, the Kansas City Chiefs tig...",
            "Dua Lipa’s “Houdini” hits No. 1 on Billboard’s Dance/Mix Show Airplay chart, escaping the No. 2 spot to appear atop the ranking dated March 2.\n\nLipa ear...",
            "It’s been an arduous-yet-fruitful journey for French Montana navigating the turbulent music industry since 2009’s Mac Wit Da Cheese.\n\nFifteen years later, T...",
            "I can't handle the Tooth Fairy, indeed.\n\nStephen Lovekin\n\nThe going rate for the Tooth Fairy is $5.84 per tooth.\n\nBut some parents — uh, I mean Fairies if any...",
            "Season 35, Episode 28 –\n\nCOPS follows police officers, constables, and sheriff’s deputies during patrols and various police activities by embedding camera c...",
            "Season 31, Episode 19 –\n\nTogether on Graham’s sofa are Oscar-winner Cate Blanchett, starring in Australian period drama The New Boy, great British actress K...",
            "Former talk show host Wendy Williams issued a statement Friday afternoon thanking fans for their “overwhelming” response to Thursday’s announcement that s...",
            "Posted on Feb 24th, 2024 at 1:16 am in TV Shows by Robotnico\n\nBe a part of the LMAD nation! A clown plays “Winfall” for a new car. Then, a stack of pancakes...",
            "It’s very easy to misread the title of Victor Kossakovsky’s latest documentary as “Architection,” since it is, in some ways, a detective story about the...",
            "After disappointing fourth-quarter results, Rivian (RIVN) stock earned a double downgrade, sending share prices to an all-time low. Sitting at its lowest value ...",
            "Recently, Google Gemini, the company's AI image generator and chatbot, came under fire after claims arose online that the app was turning white historical chara...",
            "The Biden administration on Friday restored a U.S. legal finding dating back nearly 50 years that Israeli settlements in the occupied Palestinian territories ar...",
            "Former President Donald Trump said Friday that he would “strongly support the availability of IVF” and called on lawmakers in Alabama to preserve access to ...",
            "Jeff Bezos, Nvidia Corp. and other big technology names are investing in a business that’s developing human-like robots, according to people with knowledge of...",
            "Release Description:\n\nA maze? How about a roguelike maze? Explore different worlds to get out of here. Each time you enter a world, the unknown awaits. Can you ...",
            "An employee from the Acumen Winery has confirmed Georgia district attorney Fani Willis paid in cash during her 2023 visit.\n\nStan Brody alleged Willis spent $400...",
            "[DVD]\n\n01. Maware☆Maware -Drama Ending Non-Credits ver.-\n\n02. Catch Me! -Music Video-\n\n03. Catch Me! -Dance Video-\n\n04. Catch Me! -Drama Opening Non-Credits v...",
            "An unverified screenshot depicting a result to a prompt from Google Gemini AI, posted by an X user.\n\nGrimes, the Canadian musician and record producer, declared...",
            "Entertainment News International (ENI) is the #1 popular culture network for adult fans all around the world.\n\nGet the scoop on all the popular comics, games, m...",
            "Benzino takes aim at Eminem again by making fun of a photo of Em dressed like Britney Spears.\n\nBenzino Returns to Dissing Eminem\n\nOn Friday (Feb. 23), Benzino p...",
            "SumUp is reportedly looking to raise 1 billion euros ($1.1 billion) from private credit lenders.\n\nThe U.K. payments company would use the money to refinance exi...",
            "CNBC's Jim Cramer on Friday guided investors through next week's market action, advising them to pay attention to earnings reports from companies including Sale...",
            "Travis Kelce had Taylor Swift on his mind even back in 2016!\n\nIn an old Afterbuzz TV interview clip that resurfaced this week on TMZ, the Kansas City Chiefs tig...",
            "Russian War on Ukraine Marks a Second Anniversary : State of the World from NPR The Russian invasion of Ukraine is marking a grim second anniversary. We hear fr...",
            "Disneyland Resort has revealed more details on offerings that will be available during the next Disneyland After Dark event, Disney Channel Nite — including a...",
            "Orin Kerr has published a thought-provoking response to my post several days ago critiquing the New York State $450 million civil fraud verdict against Donald T...",
            "None BNB has reclaimed a price level not seen in over a year.\n\n• None The BNB chain has integrated another DeFi platform.\n\nBinance Coin [BNB] has recently exp...",
            "Christopher Nolan (“Oppenheimer”) broke down his technique for writing nonlinear scripts, saying he no longer pens them in chronological order first as it r...",
            "Matt Mullenweg, CEO of Tumblr owner Automattic, is supposed to be on sabbatical. Instead, he’s arguing with Tumblr users over an individual content moderation...",
            "The $7 billion \"buy now, pay later\" startup Klarna recently faced a public board spat. Here are three strategies to approach conflict within a business.\n\nKlarna...",
            "Margaret Qualley and Geraldine Viswanathan star in a lesbian road trip comedy that will mostly remind you of better movies. Photo: Wilson Webb / Working Title /...",
            "At Hell Gate, an interview with Lucy Sante.\n\nLooking for some February book recommendations? The CLMP has you covered.\n\nAt io9, talking comics with Ed Brubaker....",
            "Here’s a roundup of recent tour news. Check the Tour Dates category for more.\n\nMAGGIE ROGERS\n\nMaggie Rogers has announced Part 1 of the Don’t Forget Me Tour...",
            "Up Next ‘Law & Order’ Flashback: Watch Sam Waterston’s First On-Set Interview in 1994",
            "Remember when Twitter was less about hot takes and more about cold, hard humor? Ah, the golden era of Twitter, a time when the platform was a playground for wit...",
            "Posted in: AMC, Preview, Trailer, TV, Walking Dead | Tagged: amc, michonne, Rick Grimes, the ones who live, The Walking Dead\n\nThe Walking Dead: The Ones Who Liv...",
            "Click to share on Pocket (Opens in new window)\n\nClick to share on Tumblr (Opens in new window)\n\nClick to share on LinkedIn (Opens in new window)\n\nClick to share...",
            "Christopher Nolan (“Oppenheimer”) broke down his technique for writing nonlinear scripts, saying he no longer pens them in chronological order first as it r...",
            "Former President Trump on Friday signaled he would engage in escalatory trade wars with foreign nations if reelected, a tactic he employed during his first term...",
            "The 49th Cesar Awards, France’s top film honors, have been handed out in Paris, with Justine Triet‘s Oscar contender Anatomy of a Fall emerging as the big w...",
            "Réka Juhász is a professor of economics at the University of British Columbia, and she studies what's known as industrial policy. That's the general term for ...",
            "After five days of deliberations, a jury in New York on Friday held the National Rifle Association liable for financial mismanagement and found that Wayne LaPie...",
            "Houston, the US is officially back on the moon.\n\nOn Thursday, an unmanned lunar spacecraft called Odysseus made the first US moon landing in 50 years. The space...",
            "States Must Act Now To Save Rural Lives From Fentanyl Crisis\n\n\n\nAuthored by Heidi Heitkamp via RealClear Wire,\n\nAcross rural America, the expanding crisis of fe...",
            "Senators says think-tank led by consultancy undermined national security by advising China’s government\n\nThis story appeared on ft.com , .",
            "This month, the 2002 Britney Spears-starring road trip dramedy Crossroads finally arrived on Netflix, marking the first time that the movie has ever been availa...",
            "Martin Scorsese praised wife Helen Morris for her “fortitude” and “strength” amid her 30-year battle with Parkinson’s disease.\n\nScorsese, 81, chose Mo...",
            "Have you even really lived until you’ve gotten a lap dance from Madonna? Just ask Amy Schumer.\n\nIn a new interview with The Associated Press, the comedian hil...",
            "Wheat futures faded into the weekend, but held onto a weekly gain. Chicago futures were down by as much as a dime on Friday, though March was still up by 13 cen..."
        ]
    },
    {
        "date": "2024-02-24",
        "most-common-noun": "Awards",
        "frequency": 26,
        "snippets": [
            "Hollywood’s biggest stars hit the red carpet for the 30th annual Screen Actors Guild Awards on Saturday night in Los Angeles.\n\nThe star-studded list of attend...",
            "Watch : Best SAG Awards Red Carpet Looks of ALL TIME\n\nGossip girl here, your one and only source for 2024 SAG Awards couples. And who am I? A big fan of Adam Br...",
            "Watch : Best SAG Awards Red Carpet Looks of ALL TIME\n\nGossip girl here, your one and only source for 2024 SAG Awards couples. And who am I? A big fan of Adam Br...",
            "Watch : Best SAG Awards Red Carpet Looks of ALL TIME\n\nGossip girl here, your one and only source for 2024 SAG Awards couples. And who am I? A big fan of Adam Br...",
            "Hollywood’s biggest stars hit the red carpet for the 30th annual Screen Actors Guild Awards on Saturday night in Los Angeles.\n\nThe star-studded list of attend...",
            "Fran Drescher made a dazzling entrance on the red carpet at the 2024 SAG Awards in Los Angeles on Saturday. Since 2021, “The Nanny” actress has served as th...",
            "Awards season blazes on, and next up is the Screen Actors Guild Awards, more commonly known as the SAG Awards. There’s a lot in store for the 30th annual even...",
            "Awards season is officially in full swing, and this week, it’s time for the Screen Actors Guild awards. And, as always, the actors are going all out for the s...",
            "Watch : Best SAG Awards Red Carpet Looks of ALL TIME\n\nThese two are meeting again, just not at a kissing booth.\n\nJoey King and Taylor Zakhar Perez had a Kissing...",
            "Watch : Best SAG Awards Red Carpet Looks of ALL TIME\n\nThese two are meeting again, just not at a kissing booth.\n\nJoey King and Taylor Zakhar Perez had a Kissing...",
            "Watch : Best SAG Awards Red Carpet Looks of ALL TIME\n\nThese two are meeting again, just not at a kissing booth.\n\nJoey King and Taylor Zakhar Perez had a Kissing...",
            "Watch : Best SAG Awards Red Carpet Looks of ALL TIME\n\nThese two are meeting again, just not at a kissing booth.\n\nJoey King and Taylor Zakhar Perez had a Kissing...",
            "Questions abounded before the red carpet opened at Saturday’s 30th Annual Screen Actors Guild Awards, and not only about who would take home the coveted troph...",
            "The 30th annual Screen Actors Guild Awards, also known as the SAG Awards, was held at the Shrine Auditorium and Expo Hall on Saturday in Los Angeles, and featur...",
            "Questions abounded before the red carpet opened at Saturday’s 30th Annual Screen Actors Guild Awards, and not only about who would take home the coveted troph...",
            "Awards season is still in full swing! The SAG Awards 2024 red carpet is here, and that means the nominees will be bringing their fashion A game. (Pour one out f...",
            "With the Oscars just two weeks away, the stars went bold for one of the final ceremonies of the 2024 awards show season, the Screen Actors Guild Awards. Stars l...",
            "The 30th annual Screen Actors Guild Awards is held at the Shrine Auditorium and Expo Hall in Los Angeles, California, on Feb. 24, 2024. The celebrities hit the ...",
            "All your favorite film and TV stars gathered for the 30th Annual Screen Actors Guild Awards on Saturday. As usual, Black stars dominated the red carpet with unf..."
        ]
    },
    {
        "date": "2024-02-25",
        "most-common-noun": "s",
        "frequency": 10,
        "snippets": [
            "A man set himself on fire outside of the Israeli embassy in Washington D.C. ... apparently protesting the conflict in the Middle East.\n\nPictures of the proteste...",
            "Technology AT&T will give $5 to customers hit by cellphone network outage An AT&T retail location is shown in Willow Grove, Pa., Thursday, Feb. 22, 2024. AP Pho...",
            "Keke Palmer Celebrates Son Leo’s First Birthday With an Emotional Message!\n\nOn February 25th, the actress takes to Instagram to wish her baby boy, Leo, who sh...",
            "From The Wall Street Journal:\n\nCan government tell Big Tech companies how to edit content and police their platforms? That’s the question before the Supreme C...",
            "Underlying US inflation probably rose in January by the most in a year, as tracked by the Federal Reserve’s preferred metric, highlighting the long and bumpy ...",
            "My in-laws helped my wife and me purchase a home that we all live in, including my teenager. They provided $300,000, and we bought the home for just over $500,0...",
            "The 2024 Screen Actors Guild (SAG) Awards featured several notable moments. From Barbra Streisand’s Life Achievement Award speech to Pedro Pascal being swept ...",
            "\n\nArtist: Liam Bailey\n\n\n\nAlbum: Zero Grace\n\n\n\nReleased: 2024\n\n\n\nStyle: Reggae\n\n\n\nFormat: MP3 320Kbps\n\n\n\nSize: 90 Mb\n\n\n\n\n\n\n\nTracklist:\n\n01 – Holding On\n\n02 –...",
            "Good Luck to You, Leo Grande is a comedy-drama film about Nancy Stokes, a retired schoolteacher who seeks to explore her sexuality by hiring a young sex worker ...",
            "TOKYO -- As the U.S., Europe, China and Japan in the northern hemisphere race to put electric vehicles on roads by offering subsidies and building infrastructur...",
            "Getty Image / Kirby Lee\n\nKickoffs in the NFL have become boring and stale. With the legs of kickers bigger than ever, and the kickoff now occurring from the 35-...",
            "Nick Offerman became a first-time Independent Spirit Awards winner during the 2024 awards ceremony on Sunday, winning for best supporting performance in a new s...",
            "Glen Powell and Sydney Sweeney are in search of their next romantic comedy after the success of Anyone But You.\n\nPowell, 35, revealed to Variety during the 2024...",
            "Hey, meme aficionados and Disney enthusiasts. Get ready for the funniest Disney memes of the week, where humor meets magic in a spectacular laugh fest. We’ve ...",
            "The Long Good Friday is a British crime thriller that follows the story of Harold Shand, a London gangster, as he tries to secure a lucrative real estate deal a...",
            "As an Amazon Associate I earn from qualifying purchases. Please support Super Punch by following the affiliate links and buying from Amazon and eBay . This site...",
            "The lead singer of the popular reggae band Morgan Heritage has died\n\nBy The Associated Press\n\nSAN JUAN, Puerto Rico -- Peter Anthony Morgan, lead singer of the ...",
            "The following is a guest post from Robert Rhodin, the CEO of KeychainX.\n\nAs the crypto market’s capitalization has grown, the diversity and complexity of asse...",
            "Avison Young’s chief executive says it did not default on debt payments and that its lenders have agreed to forgive more than half the amount owed, after the ...",
            "At HuffPost, we believe that everyone needs high-quality journalism, but we understand that not everyone can afford to pay for expensive news subscriptions. Tha...",
            "Watch : Meri Brown Confirms Split From Boyfriend Amos Andrews\n\nMeri Brown is a single woman again.\n\nThe Sister Wives star has confirmed that her romance with Am...",
            "The Miracle Maker is an animated film that portrays the life of Jesus Christ through a unique blend of claymation and 2D animation, focusing on his teachings, m...",
            "America’s most common form of currency might also be its least wanted.\n\nThere are now more $100 bills in circulation than any other denomination, with the num...",
            "This year’s Independent Spirit Awards faced a major broadcast hurdle as a Pro-Palestinian protestor with a speaker and a prerecorded message blared out many o...",
            "TechCrunch Mobility is a weekly newsletter dedicated to all things transportation. Sign up here — just click TechCrunch Mobility — to receive the newsletter...",
            "New players can sign up with our bet365 bonus code NEWSXLM to get a $150 bonus or use a $1K first-bet safety net for any NBA game.\n\nNew players can sign up with...",
            "American Taylor Swift fans were left reeling after a video from one of her Australian concerts went viral.\n\nThe global megastar, 34, has been impressing Swiftie...",
            "The Only Major Actors Still Alive From Logan's Run\n\nThe dystopian sci-fi film \"Logan's Run\" is set in a supposedly idyllic future society where residents above ...",
            "Inkheart is a fantasy adventure film that revolves around a man named Mo and his daughter, Meggie, who discover they have the power to bring characters from boo...",
            "Updated February 26 KST:\n\nGong Myung’s agency Saram Entertainment has denied the dating rumors linking him to Weki Meki’s Kim Doyeon.\n\nOn February 26, short...",
            "AEW Collision 2024.02.24 1080p WEB h264-HEEL Posted on Feb 26th, 2024 at 1:14 am in TV Shows by Robotnico ﻿ Links: HOMEPAGE – TVDB AEW.Collision.2024.02.24....",
            "LOS ANGELES — Hollywood musicians have reached a tentative agreement with the major entertainment companies after a month of bargaining.\n\nThe American Federat...",
            "Lifetime aired the first two hours of “Where is Wendy Williams?” on Saturday. The talk show host revealed her diagnosis of aphasia and frontotemporal dement...",
            "Illinois Bill Wants Make It \"Child Abuse\" For Parents To Object To Gender-Transitioning Of Kids\n\n\n\nAuthored by Steve Watson via Modernity.news,\n\nA bill introduc...",
            "Former President Donald Trump celebrates at his election night event in Columbia, SC.\n\nAP Photo/Andrew Harnik\n\nFormer President Trump's primary victory in South...",
            "SHORPY ART\n\n\n\nFramed or unframed, desk size to sofa size, printed by us in Arizona and Alabama since 2007. Explore now.",
            "what we know\n\nHow AI Is Being Used to Influence and Disrupt the 2024 Election\n\nHow AI Is Being Used to Influence and Disrupt the Election",
            "In a recently viral TikTok, user @internetaunty shared her own encounter with an MLM (Multi-level marketing) recruiter at a Starbucks. In the video, she reveale...",
            "In a recently viral TikTok, user @internetaunty shared her own encounter with an MLM (Multi-level marketing) recruiter at a Starbucks. In the video, she reveale...",
            "TikTok has published a new guide to app marketing on the platform, with new insights from measurement and analytics provider Adjust which underline how to creat...",
            "“We will start preparing for a transition taxonomy this year,” Chan said. “This will be the next phase in our work” to develop a local green classificat...",
            "NEW YORK, Feb. 25, 2024 /PRNewswire/ -- The Korean Cultural Center New York (KCCNY), a branch of the Ministry of Culture, Sports and Tourism of the Republic of ...",
            "Posted in: Games, Indie Games, Video Games | Tagged: Palia, Singularity 6\n\nPalia Will Be Released For PC On Steam In Late March\n\nSingularity 6 confirmed this we...",
            "Reviewed by stevendbeard 4 / 10\n\nI saw Daddy Daughter Trip, starring Rob Schneider-The Ridiculous 6, the Deuce Bigalow movies; Jackie Sandler-Kevin Can Wait_tv,...",
            "What a child needs to hear\n\nParenting can be a rollercoaster of emotions, especially when dealing with an angry child. In those heated moments, knowing the righ...",
            "Season 34, Episode 25 –\n\nFifteen questions are all that stand between contestants and a life-changing £1 million jackpot as Jeremy Clarkson hosts with the bi...",
            "Furlough is a comedic drama film that follows the story of a rookie corrections officer who is tasked with escorting a rebellious inmate on a 36-hour furlough t...",
            "The Great Pottery Throw Down S07E08 1080p HDTV H264-DARKFLiX Posted on Feb 26th, 2024 at 1:10 am in TV Shows by Robotnico Season 7, Episode 08 –\n\nIt's the qua...",
            "TWICE‘s With YOU-th tops this week’s new music poll.\n\nMusic fans voted in a poll published Friday (Feb. 23) on Billboard, choosing the K-pop group’s lates...",
            "Aidy Bryant celebrated “the resilience and ingenuity” of her fellow artists during her opening monologue of the 2024 Film Independent Spirit Awards on the b...",
            "In its latest annual report, Riot Platforms, the publicly-listed bitcoin mining firm, outlines several significant risks that could impact its operations, inclu...",
            "Learn More\n\nStar Wars: What Does BB-8 Stand For?\n\nStar Wars character names are just as fascinating to dig into as the lively backstories of those who inhabit t...",
            "Season 1, Episode 02 –\n\nPauline Carroll learns about the Khmer empire's greatest king, Jayavarman VII, following his military victories, unprecedented buildin...",
            "Season 1, Episode 02 –\n\nOn this second leg of his journey, Ben heads deeper into the vast Congo wilderness to fulfil his life-long dream of seeing wild gorill...",
            "Match Of The Day 2 2024.02.25 1080p HDTV H264-FTP Posted on Feb 26th, 2024 at 1:9 am in TV Shows by Robotnico Mark Chapman introduces highlights from the day’...",
            "Try as he might, Jim Gaffigan could not shut down the heckles of pro-Palestinian activists just outside the massive tent in Santa Monica containing the Film Ind...",
            "Nobody commented this post yet.\n\nYou should register if you want to comment this post.",
            "Report\n\nCultura Tres Brings South America To South London As They Headline The New Cross Inn\n\nWith Sepultura announcing their farewell last year, many fans are ...",
            "If you want to see Dune: Part Two before the busy opening night crowds, there is an option. The highly anticipated sequel to Denis Villenevue’s adaptation of ...",
            "Finding Forrester is a drama film about an unlikely friendship between a reclusive writer, William Forrester, and a talented young basketball player, Jamal Wall...",
            "None Walmart this week announced its $2.3 billion acquisition of Vizio and its SmartCast Operating System.\n\n• None The deal widens Walmart's advertising reach...",
            "Companies with average fundamentals and deeply oversold stocks for some quick gains\n\nShort squeeze rallies can be massive at the blink of an eye and provides in...",
            "At Sunday’s Independent Spirit Awards, actor Nick Offerman addressed “homophobic hate” aimed over the last year at “Long, Long Time,” his much-lauded ...",
            "shared a letter sent to employees on Sunday after the company's cellular network experienced an outage on Thursday that impacted tens of thousands of Americans....",
            "BYD, the Chinese carmaker that recently overtook Elon Musk’s Tesla in global sales of electric vehicles, has struck fear into legacy automakers. That’s prim...",
            "Lifetime aired the first two hours of “Where is Wendy Williams?” on Saturday. The talk show host revealed her diagnosis of aphasia and frontotemporal dement...",
            "Home » Review » Week in Review » Week in Review: Alexander Skarsgård for Mackage, Oscar Isaac x FOG + More\n\nPin Alexander Skarsgård for the Mackage spring-...",
            "Neither the actor nor the idol has responded to the report as of now.\n\nIn an exclusive report, a South Korean news outlet, News Tomato, revealed that actor Gong...",
            "Demon Slayer: Kimetsu No Yaiba -To The Swordsmith Village - Official Trailer\n\nFor a second straight week, biopic \" Bob Marley: One Love \" continues to exceed ex...",
            "\"There has been spare capacity in the shipping-freight industry to respond to the difficulties, which has bought us some time,\" William Bain, BCC head of trade ...",
            "This year’s Independent Spirit Awards faced a major broadcast hurdle as a Pro-Palestinian protestor with a speaker and a prerecorded message blared out many o...",
            "The Super Bowl-sized tax losses claimed by professional sports team owners have caught the Internal Revenue Service’s attention, calling for increased audit s...",
            "This memo offers a preview of Morning Consult’s February U.S. Consumer Spending and Household Finance Report. Morning Consult Economic Intelligence subscriber...",
            "This guy really flipped his lid.\n\nAn irate McDonald’s customer in Boston got so fired up when an employee at the fast food restaurant touched the lid of his d...",
            "Billie Eilish helped Melissa McCarthy check an item off her bucket list! HA!\n\nOn Saturday night at the 30th annual SAG Awards, the two ladies took the stage to ...",
            "The Squid and the Whale is an indie drama that delves into the unraveling of a Brooklyn family as seen through the eyes of two teenage brothers coping with thei...",
            "LE SSERAFIM recently made their highly anticipated comeback with their third EP, EASY, on February 19, 2024, and released five new catchy songs for fans to enjo...",
            "\n\nThe specific use I am researching here is the hookup of several multiplexers to one microprocessor. With such setups, one can use the same 4 switching-signal ...",
            "YBN Nahmir has escalated his pursuit for a showdown with Adin Ross, who he continues to taunt over a fight Ross no longer seems to want.\n\nOver the weekend, the ...",
            "The sound of a bullhorn playing a recording of the chant “Free Palestine” could be heard on the Film Independent Spirit Awards broadcast on Sunday, as a pai...",
            "A homeless person sits on the ground in a subway station in Manhattan on February 20, 2024.\n\nCHARLY TRIBALLEAU/Getty Images\n\nPoverty in New York City surged by ...",
            "Looks like you already have a subscription! You can verify your subscription or upgrade to LIFETIME HERE:",
            "How would you rate episode 8 of\n\nA Sign of Affection ?\n\n© 森下suu・講談社／ゆびさきと恋々a作委員会\n\nI always like it when characters feel lik...",
            "At Sunday’s Independent Spirit Awards, actor Nick Offerman addressed “homophobic hate” aimed over the last year at “Long, Long Time,” his much-lauded ...",
            "If you’re not watching the second season of Mashle: Magic and Muscles, then you’re missing out on a ton of magical absurdity. Despite having zero magic, Mas...",
            "The sound of a bullhorn playing a recording of the chant “Free Palestine” could be heard on the Film Independent Spirit Awards broadcast on Sunday, as a pai...",
            "The tenure of former President Donald Trump's wife, Melania Trump, as the first lady was marked not only by her public engagements but also by an intense intern...",
            "Proud Mary is an action thriller film centered around Mary, a skilled hitwoman working for a Boston crime family, whose life takes a dramatic turn when she enco...",
            "Before defending the idea of an \"American Psycho\" remake, let's first drop in on the reasons why it sounds like a terrible idea. First of all, Lionsgate decidin...",
            "Circle Chart (formerly known as Gaon Chart) has revealed its chart rankings for the week of February 11 to 17!\n\nAlbum Chart\n\nn.SSign topped this week’s physic...",
            "TWICE‘s With YOU-th tops this week’s new music poll.\n\nMusic fans voted in a poll published Friday (Feb. 23) on Billboard, choosing the K-pop group’s lates..."
        ]
    },
    {
        "date": "2024-02-26",
        "most-common-noun": "Monday",
        "frequency": 15,
        "snippets": [
            "Joe Biden told reporters Monday he expects Israel and Hamas to reach a deal this weekend for the release of the remaining Israeli hostages in the Gaza Strip—a...",
            "US commerce secretary Gina Raimondo shared some hard truths about the $39 billion in CHIPS Act funding up for grabs in a speech on Monday.\n\nAmong them was that ...",
            "In our news wrap Monday, Donald Trump appealed the $454 million judgment in his New York civil fraud case, Ukrainian troops retreated again in the east as Russi...",
            "Photo: Kevin Winter/Getty Images\n\nJennifer Lopez’s new documentary, which premieres Monday evening on Prime Video, is called The Greatest Love Story Never Tol...",
            "President Joe Biden on Monday evening said he thought a cease-fire between Israel and Hamas could be in place in roughly a week.\n\n“I hope by the end of the we...",
            "U.S. Senator Bernie Sanders broke his silence on the self-immolation death of an active-duty airman during an interview with Newsweek on Monday.\n\nAaron Bushnell...",
            "The beaten-down electric vehicle (EV) sector needed a win on the stock market, and on Monday it got one. Thanks to some good news from one of their own, numerou...",
            "In the wake of Nvidia 's rapid ascension, CNBC's Jim Cramer on Monday picked companies he thinks could have a chance at breaking $1 trillion in market capitaliz...",
            "President Joe Biden sat down for an interview with late-night comic Seth Meyers on Monday while he’s in New York for a campaign event with donors.\n\nNBC said i...",
            "Create your free profile or log in to save this article\n\nCreate your free profile or log in to save this article\n\nPresident Joe Biden said Monday that he hopes ...",
            "Lean hog futures closed mixed on Monday, as the nearby April and May contracts fell 92 and 10 cents respectively vs the +30c gains in the summer months. The Apr...",
            "Corn prices ended the Monday session at or near the highs for the day with 6 ¾ to 8 cent gains. The May contract’s carry is 14 ½ cents at the close. New cro...",
            "Cotton futures were up by 62 to 165 points at the close for Monday. May futures printed a wide 240 point range on the day, with more than a penny on both sides ...",
            "Beans initially started the last week of Feb with continued weakness to new lows for the move. Prices firmed up Monday afternoon and closed mixed, with fraction...",
            "The cattle market was mixed on Monday with fats 12 to 57 cents higher and feeders 50 cents to $1.52 weaker. The April live cattle contract printed a $1.67 range..."
        ]
    },
    {
        "date": "2024-02-27",
        "most-common-noun": "Tuesday",
        "frequency": 10,
        "snippets": [
            "Bitcoin’s fast-rising price is attracting traders and speculators back into the market, on-chain data suggests.\n\nIn a Tuesday newsletter, blockchain intellige...",
            "In our news wrap Tuesday, Israel and Hamas cast doubt on President Biden's suggestion that a Gaza cease-fire deal could be reached by Monday, communities in Isr...",
            "NEW YORK — Macy’s will close 150 unproductive namesake stores over the next three years including 50 by year-end, the department store operator said Tuesday...",
            "Bitcoin (BTC-USD) surged past $57,000 intraday on Tuesday, the first time the digital asset has sat at that milestone in over two years. The cryptocurrency has ...",
            "Kristin Cavallari officially has a new man in her life, Mark Estes, and she couldn't be more excited to show him off.\n\nOn Tuesday, ET confirmed that the 37-year...",
            "\"A Bold New Chapter\": Macy's To Close 150 Stores, Focus On Luxury Consumer With Bloomingdale's\n\n\n\nMacy's announced on Tuesday that it is entering \"A Bold New Ch...",
            "E-commerce platform eBay beat market expectations for quarterly revenue and profit on Tuesday, helped by healthy consumer spending during the holiday season and...",
            "During a private White House meeting on Tuesday, Mitch McConnell nudged Mike Johnson to take up the Senate’s $95 billion foreign aid bill — a move that woul...",
            "The royal family is mourning Thomas Kingston.\n\nThe British financier was the husband of Lady Gabriella Kingston. On Tuesday Gabriella, as well as family members...",
            "Wall Street took another breather on Tuesday, with the Dow Jones Industrial Average suffering back-to-back losses after notching multiple record highs earlier t..."
        ]
    },
    {
        "date": "2024-02-28",
        "most-common-noun": "s",
        "frequency": 9,
        "snippets": [
            "\n\nThe Dune-night boys are here to look back at Arrakis! They dive into their thoughts on both the David Lynch 1984 Dune film and Denis Villeneuve’s 2021 Dune:...",
            "It’s a great day for gossips and snitches—and anyone who thinks talented employees who perform dangerous and highly sought-after work deserve a half-decent ...",
            "Mitch McConnell announced on Wednesday that he will step down as the GOP’s Senate leader after next November’s elections. At 82, the guy is still alive and ...",
            "Posted in\n\n2024 02 18 18 00 フジテレビＴＷＯ ロック・ショー・スペシャル・ジ・アルフィー’S・ナイト.ts 4.60 GB\n\n2024/02/18(日)...",
            "Are you a Disney+ subscriber who keeps getting a “sorry, something went wrong” message or a message saying that your show is not available in your area? You...",
            "Quebec-based JAMP Pharma Group says it will acquire a large manufacturing facility in the province in a bid to boost pharmaceutical production in Canada, which ...",
            "Bitcoin surges, exchanges run hot, and Coinbase glitches—lather, rinse, repeat. Following widespread reports that Coinbase users were logging in to see zero b...",
            "Richard Lewis, who was widely known for his time on Curb Your Enthusiasm, died at the age of 76 on February 27, 2024. The actor had been diagnosed with Parkinso...",
            "“Lost Angel: The Genius of Judee Sill”\n\nWebsite: https://shorturl.at/ALP03\n\nTrailer: http://tinyurl.com/mutzbddn\n\nIt creeped me out, in a good way.\n\nI got e...",
            "Ryan Gosling To Perform ‘Barbie’ Hit ‘I’m Just Ken’ at the 2024 Oscars!\n\nRyan Gosling is bringing his ‘kenergy’ to the 2024 Oscars! The ‘Barbie?...",
            "New Mexico: Prop firearm discharged, kills woman on movie set in Santa Fe\n\nA New Mexico detective on Wednesday said Hannah Gutierrez identified an ammunition bo...",
            "After a stunning morning for the crypto market that saw Bitcoin rocket 11% in a matter of hours before quickly plunging, many traders are no longer smiling, wit...",
            "An Electronic Arts video game logo is seen at the Electronic Entertainment Expo.\n\nElectronic Arts announced Wednesday that it will cut 5% of its workforce, part...",
            "Bitcoin’s rally is turning out to be bad news for Coinbase, the crypto trading app that has just confirmed some of its customers are seeing a zero balance acr...",
            "The BlackCat/ALPHV ransomware gang has officially claimed responsibility for a cyberattack on Optum, a subsidiary of UnitedHealth Group (UHG), which led to an o...",
            "UnitedHealth Group (NYSE:UNH) is facing an antitrust probe initiated by the U.S. Department of Justice (DOJ), according to the Wall Street Journal. Following th...",
            "California Gov. Gavin Newsom signed a law that exempts Panera Bread from a new $20-an-hour minimum wage hike for fast food chains after the billionaire owner of...",
            "Good afternoon, everyone. Thank you for having me here today. I always enjoy meeting with business and community leaders in the Federal Reserve’s Second Distr...",
            "Create your free profile or log in to save this article\n\nCreate your free profile or log in to save this article\n\nChemicals once commonly found in a range of pr...",
            "Here's a big reason why people may be gloomy about the economy: the cost of money\n\nThe government's best-known measure for the cost of living tracks the price o...",
            "Salesforce provided investors with an outlook for annual sales that fell short of analysts’ expectations, suggesting that it has not yet benefited from its in...",
            "We can’t imagine it’s easy being a television executive. The pressure! The expectations! The endless lunches, often coming in the aftermath of some absolute...",
            "Photo: Michael Loccisano/Getty Images\n\nLiam Neeson is getting silly in a new reboot of the Naked Gun series. According to The Hollywood Reporter, the police pro...",
            "Meta CEO Mark Zuckerberg has discussed cooperation on extended reality devices with LG Electronics executives as part of his visit to South Korea that highlight...",
            "Software firm C3.ai on Wednesday posted better-than-expected quarterly results and narrowed its full-year revenue forecast range which was still ahead of Wall S...",
            "New data from Fidelity Investments showed trends among Americans and their retirement plans, including a 41% increase in accounts with $1 million.\n\nIf you're wo...",
            "Posted in: Collectibles, Hasbro | Tagged: hasbro, transformers\n\nTransformers Autobots Stand United 5-Pack Coming Soon from Hasbro\n\nBuild up your Autobot Army an...",
            "Nobody commented this post yet.\n\nYou should register if you want to comment this post.",
            "Gemini, the cryptocurrency exchange founded by The Winklevoss twins, has agreed with the New York Department of Financial Services (NYDFS). The agreement requir...",
            "The front month corn futures were near their highs for the close with a nickel gain for both the March and the May contracts. The new crop futures also closed h...",
            "Computer scientists at the University of Maryland have developed an efficient way to craft prompts that elicit harmful responses from large language models (LLM...",
            "After finishing the midweek trading session with more than 1% losses, the domestic wheat market is now mixed on the weekly charts. Chicago futures were down by ...",
            "The cotton market had gotten to the expanded 5 cent limit earlier in the session, but futures backed off for a mixed close on Wednesday. Old crop prices were up...",
            "After a back and forth session the soybean futures ended Wednesday in the black. Gains were 2 ¾ to 5 ¼ cents across the front months, though May traded from -...",
            "Hog futures were in the black at the close, though by more than $1 under the day’s highs. Futures went home 7 to 35 cents higher across the front months. USDA...",
            "Adam Aron and the AMC Entertainment board have agreed to reduce the CEO’s target compensation by 25% this year, he said, as he’s bombarded with hostility by...",
            "Front month feeder cattle futures were down by $2.72 to $3.85 with losses of as much as 1.5% on the day. The fats also faded by triple digits for a midweek pull...",
            "Paramount Global CEO Bob Bakish derided a planned streaming venture backed by Disney, Fox Corp. and Warner Bros. Discovery for having “only a subset of sports...",
            "Deezer CEO Jeronimo Folgueira to Step Down in March As Direct Subscribers Remain Flat in 2023\n\nSave\n\nLess than three years after signing on as Deezer’s CEO ?...",
            "My newsletter: https://simonowens.substack.com/\n\n\n\nFor most of Instagram’s existence, it wasn’t thought of as a platform for distributing news, but a growin...",
            "Adam Aron and the AMC Entertainment board have agreed to reduce the CEO’s target compensation by 25% this year, he said, as he’s bombarded with hostility by...",
            "Over the past three years, Nicole Kidman’s AMC Theaters commercial has become one of the biggest memes in the movie industry. This Friday, it’s getting not ...",
            "Ballot measures ending the subminimum wage are expected to turn out voters in key battleground states in the 2024 elections.\n\nRestaurant servers in the United S...",
            "If you can read this, either the style sheet didn't load or you have an older browser that doesn't support style sheets. Try clearing your browser cache and ref...",
            "Electronic Arts announced Wednesday that it will cut 5% of its workforce, part of a plan that includes reducing office space and ending work on some video games...",
            "The Consumer Financial Protection Bureau (CFPB) will propose rules this year to limit the activities of data brokers, including those that sell personal data to...",
            "You probably use your bank’s mobile app for everyday tasks such as checking your account balance, paying bills and transferring money between accounts. Howeve...",
            "Portions of this article were drafted using an in-house natural language generation platform. The article was reviewed, fact-checked and edited by our editorial...",
            "Portions of this article were drafted using an in-house natural language generation platform. The article was reviewed, fact-checked and edited by our editorial...",
            "AP Photo/Pablo Martinez Monsivais\n\nFormer President Donald Trump was given “a gift” by the Supreme Court of the United States on Wednesday, argued legal ana...",
            "338,238 Jeep Grand Cherokees to address an issue with the steering wheel that could cause drivers to suddenly lose control of their vehicles.\n\nThe recall covers...",
            "Progress on the Oxagon, Sindalah, and the 110-mile-long The Line centerpiece developments in Saudi Arabia’s NEOM megaproject has been documented in a new upda...",
            "Do you want to report this series\n\nas inappropriate content?\n\nIf you’d like to report copyright infringement,\n\nclick here.",
            "Tory Lanez's legal team has filed their inaugural brief in his appeal on the conviction in the Megan Thee Stallion shooting. In the documents, Lanez's legal tea...",
            "Google parent company Alphabet has taken a beating in the stock market since pulling the plug on features of its artificial intelligence tool, Gemini, after use...",
            "There was a time when far right fans of The Boys had no inkling the show didn’t like them. They thought Homelander, the Trumpy leader of the villainous superh...",
            "'Good Times' Actor Buddy Duress Dead at 38\n\nActor Buddy Duress - real name Michael Stathis - known for working on films such as the Safdie Brothers’ ‘Good T...",
            "'Good Time' Actor Buddy Duress Dead at 38\n\nActor Buddy Duress - real name Michael Stathis - known for working on films such as the Safdie Brothers’ ‘Good Ti...",
            "The entertainment world and beyond is mourning the death of Richard Lewis. The comedian's rep, Jeff Abraham, confirmed the tragic news to ET saying Lewis died T...",
            "Here’s a roundup of recent tour news. Check the Tour Dates category for more.\n\nTHE CHATS\n\nAussie punks The Chats will be back in North America this spring, be...",
            "Explore how M2-Systems™ merges philosophy with modern typography to create timeless designs. Discover their commitment to clarity, order, and social responsib...",
            "From The Wall Street Journal:\n\nA medley of games, riddles, rhymes and number problems, “Lewis Carroll’s Guide for Insomniacs” is the perfect companion for...",
            "When Mau and Ricky Montaner returned to Venezuela last year after an almost-10-year absence, they both admit they were a little worried.\n\n“Ricky and I were re...",
            "Chance the Rapper has all types of collaborators under his belt, from Justin Bieber, Shawn Mendes and Kehlani to Kanye West, Childish Gambino and beyond. Howeve...",
            "Turkish President Recep Tayyip Erdoğan has offered to host a new round of Ukraine-Russia peace negotiations more than two years after the Russian invasion bega...",
            "Michael Weatherly and Cote de Pablo are returning to the NCIS franchise.\n\nWeatherly, 55, and de Pablo, 44, will reprise their respective fan-favorite roles, Ton...",
            "ScHoolboy Q is quite evidently very proud of his upcoming album given that he’s been stirring up excitement for it on a daily basis, though he still has regre...",
            "Tags:\n\nNovember 1942. \"Lititz, Pennsylvania. Small town in wartime. Mrs. Julian Bachman at home with her family. She's twenty-three, has been married one year, ...",
            "While the insurer did not disclose the policyholder’s name, Edward Moncreiffe, CEO for Hong Kong and Macau at HSBC Life, said the client was an ultra-high-net...",
            "Does it make sense to keep all of your old social posts on your profile in perpetuity, or would we better off taking a Snapchat-like, ephemeral approach to our ...",
            "From \"Hot Labor Summer\" to \"Striketober,\" 2023 was another big year for workers joining picket lines. Today on the show, we'll dig into two recent reports that ...",
            "Don Henley has finished telling a court why he contends that drafts of lyrics to “Hotel California” and other classic Eagles songs should never have shown u...",
            "Fellow comedians, famous fans, co-stars and friends react to the death of Richard Lewis, who died Wednesday at age 76.\n\n“Richard and I were born three days ap...",
            "Oversold stocks are the equivalent of Wall Street’s clearance sale. Many times, stores have too much inventory of certain products that are holding up valuabl...",
            "These under-$5 stocks could be some of tomorrow's biggest winners\n\nUnder-$5 stocks for new investors are a tricky proposition. On one hand, today’s under-$5 s...",
            "Utility stocks are trusted for the long haul for a reason. Commanding permanent relevance, they’re practically impossible to displace.\n\nStated differently, ut...",
            "None Gross Profit: GAAP gross profit at $45.3 million with a 58% gross margin; Non-GAAP gross profit at $54.7 million with a 70% gross margin.\n\n• None Net Los...",
            "Courtesy of CEP Compression\n\nOn a trip last year to Hawaii, I made a terrible discovery: when I’m sitting for long stretches in cramped airplanes, my feet ten...",
            "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAccess your favorite topics in a personalized feed...",
            "Claim: Posts on social media accurately show a Reddit post from Aaron Bushnell, the U.S. airman who died after setting himself on fire to protest the ongoing Is...",
            "Nobody commented this post yet.\n\nYou should register if you want to comment this post.",
            "Actor Richard Lewis has passed away.\n\nThe beloved stand-up comedian, who became most famous in recent years for playing a fictionalized version of himself on Cu...",
            "This is a summary of a request from Smallhold to hire Pashman Stein Walder Hayden as bankruptcy counsel, filed Feb. 27 with the U.S. Bankruptcy Court in Delawar...",
            "In Blow To Special Counsel Smith, SCOTUS Agrees To Hear Trump Immunity Appeal\n\n\n\nThe Supreme Court granted certiorari of former President Donald Trump’s presi...",
            "Actor Robert Downey Jr. and his wife, film producer Susan Downey, have been together for over 20 years, share two children, and run a successful production comp...",
            "Brief Overview of the Topic\n\nDesktop wallpapers have evolved significantly over the years, from basic, pixelated images to breathtaking digital art. This journe...",
            "Paramount Global CEO Bob Bakish derided a planned streaming venture backed by Disney, Fox Corp. and Warner Bros. Discovery for having “only a subset of sports...",
            "Richard Lewis' final appearance on Curb Your Enthusiasm before his death is making headlines. On the episode, titled \"Vertical Drop, Horizontal Tug,\" Lewis talk...",
            "Pin HUGO embraces pastel hues and tailoring for its spring-summer 2024 campaign. Photo: Stuart Winecoff / HUGO\n\nIn the vibrant parade of spring-summer styles, H..."
        ]
    },
    {
        "date": "2024-02-29",
        "most-common-noun": "Thursday",
        "frequency": 8,
        "snippets": [
            "In a statement issued on Thursday, Vanguard announced that Tim Buckley, the current Chairperson and CEO who has been in the position for over three decades, wil...",
            "Missouri's attorney general filed a lawsuit Thursday accusing Planned Parenthood of illegally taking minors into Kansas to obtain abortions without parental con...",
            "Oprah Winfrey announced she was leaving WeightWatchers on Thursday and giving away all her stock – a move that follows the TV talk queen revealing that her re...",
            "Four decades after its release, director Francis Ford Coppola took to Instagram on Thursday to share audition tapes from his 1983 film, The Outsiders.\n\nThe film...",
            "Publisher Akita Shoten announced on Thursday that a television anime adaptation and a live-action movie of Hiromasa Okujima 's Babanbabanban Vampire manga are i...",
            "A federal judge held veteran investigative reporter Catherine Herridge in civil contempt on Thursday for refusing to divulge her source for a series of stories ...",
            "The turmoil surrounding New York Community Bancorp (NYCB) intensified again on Thursday when it disclosed the exit of CEO Thomas Cangemi, weaknesses in its inte...",
            "WASHINGTON (AP) — A federal judge held veteran investigative reporter Catherine Herridge in civil contempt on Thursday for refusing to divulge her source for ..."
        ]
    }
]